#![allow(non_upper_case_globals)]
#![allow(non_snake_case)]
#![allow(non_camel_case_types)]
#![allow(improper_ctypes)]
/* automatically generated by rust-bindgen 0.56.0 */

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _ISOC95_SOURCE: u32 = 1;
pub const _ISOC99_SOURCE: u32 = 1;
pub const _ISOC11_SOURCE: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const _XOPEN_SOURCE: u32 = 700;
pub const _XOPEN_SOURCE_EXTENDED: u32 = 1;
pub const _LARGEFILE64_SOURCE: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_ISOCXX11: u32 = 1;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const __USE_XOPEN: u32 = 1;
pub const __USE_XOPEN_EXTENDED: u32 = 1;
pub const __USE_UNIX98: u32 = 1;
pub const _LARGEFILE_SOURCE: u32 = 1;
pub const __USE_XOPEN2K8XSI: u32 = 1;
pub const __USE_XOPEN2KXSI: u32 = 1;
pub const __USE_LARGEFILE: u32 = 1;
pub const __USE_LARGEFILE64: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_GNU: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;

pub const __PTHREAD_MUTEX_HAVE_PREV: u32 = 1;
pub const __have_pthread_attr_t: u32 = 1;
pub const _ALLOCA_H: u32 = 1;
pub const PATH_SEP: &'static [u8; 2usize] = b"/\0";
pub const BN_MAX_INSTRUCTION_LENGTH: u32 = 256;
pub const BN_DEFAULT_NSTRUCTION_LENGTH: u32 = 16;
pub const BN_DEFAULT_OPCODE_DISPLAY: u32 = 8;
pub const BN_MAX_INSTRUCTION_BRANCHES: u32 = 3;
pub const BN_MAX_STORED_DATA_LENGTH: u32 = 1073741823;
pub const BN_NULL_ID: i32 = -1;
pub const BN_INVALID_REGISTER: u32 = 4294967295;
pub const BN_AUTOCOERCE_EXTERN_PTR: u32 = 4294967293;
pub const BN_NOCOERCE_EXTERN_PTR: u32 = 4294967294;
pub const BN_INVALID_OPERAND: u32 = 4294967295;
pub const BN_MAX_STRING_LENGTH: u32 = 128;
pub const LLVM_SVCS_CB_NOTE: u32 = 0;
pub const LLVM_SVCS_CB_WARNING: u32 = 1;
pub const LLVM_SVCS_CB_ERROR: u32 = 2;
pub const LLVM_SVCS_DIALECT_UNSPEC: u32 = 0;
pub const LLVM_SVCS_DIALECT_ATT: u32 = 1;
pub const LLVM_SVCS_DIALECT_INTEL: u32 = 2;
pub const LLVM_SVCS_CM_DEFAULT: u32 = 0;
pub const LLVM_SVCS_CM_SMALL: u32 = 1;
pub const LLVM_SVCS_CM_KERNEL: u32 = 2;
pub const LLVM_SVCS_CM_MEDIUM: u32 = 3;
pub const LLVM_SVCS_CM_LARGE: u32 = 4;
pub const LLVM_SVCS_RM_STATIC: u32 = 0;
pub const LLVM_SVCS_RM_PIC: u32 = 1;
pub const LLVM_SVCS_RM_DYNAMIC_NO_PIC: u32 = 2;
pub const BN_MAX_VARIABLE_OFFSET: u64 = 549755813887;
pub const BN_MAX_VARIABLE_INDEX: u32 = 1048575;
pub const BN_FULL_CONFIDENCE: u32 = 255;
pub const BN_MINIMUM_CONFIDENCE: u32 = 1;
pub const BN_HEURISTIC_CONFIDENCE: u32 = 192;
pub const DEFAULT_INTERNAL_NAMESPACE: &'static [u8; 20usize] = b"BNINTERNALNAMESPACE\0";
pub const DEFAULT_EXTERNAL_NAMESPACE: &'static [u8; 20usize] = b"BNEXTERNALNAMESPACE\0";
pub const MAX_RELOCATION_SIZE: u32 = 8;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = u64;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = u64;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = u64;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = u64;
pub type __off64_t = u64;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = u64;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = u64;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = u64;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = u64;
pub type __blkcnt_t = u64;
pub type __blkcnt64_t = u64;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = u64;
pub type __ssize_t = u64;
pub type __syscall_slong_t = u64;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = u64;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = u64;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = u64;
pub type int_fast32_t = u64;
pub type int_fast64_t = u64;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type size_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub const idtype_t_P_ALL: idtype_t = 0;
pub const idtype_t_P_PID: idtype_t = 1;
pub const idtype_t_P_PGID: idtype_t = 2;
pub type idtype_t = ::std::os::raw::c_uint;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: u64,
    pub rem: u64,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> size_t;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> u64;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtof32(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float32;
}
extern "C" {
    pub fn strtof64(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float64;
}
extern "C" {
    pub fn strtof32x(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float32x;
}
extern "C" {
    pub fn strtof64x(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float64x;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> u64;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strfromd(
        __dest: *mut ::std::os::raw::c_char,
        __size: size_t,
        __format: *const ::std::os::raw::c_char,
        __f: f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf(
        __dest: *mut ::std::os::raw::c_char,
        __size: size_t,
        __format: *const ::std::os::raw::c_char,
        __f: f32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfroml(
        __dest: *mut ::std::os::raw::c_char,
        __size: size_t,
        __format: *const ::std::os::raw::c_char,
        __f: u128,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf32(
        __dest: *mut ::std::os::raw::c_char,
        __size: size_t,
        __format: *const ::std::os::raw::c_char,
        __f: _Float32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf64(
        __dest: *mut ::std::os::raw::c_char,
        __size: size_t,
        __format: *const ::std::os::raw::c_char,
        __f: _Float64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf32x(
        __dest: *mut ::std::os::raw::c_char,
        __size: size_t,
        __format: *const ::std::os::raw::c_char,
        __f: _Float32x,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf64x(
        __dest: *mut ::std::os::raw::c_char,
        __size: size_t,
        __format: *const ::std::os::raw::c_char,
        __f: _Float64x,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__locale_struct>())).__names as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strtol_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> u64;
}
extern "C" {
    pub fn strtoul_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoll_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtod_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> f64;
}
extern "C" {
    pub fn strtof_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> f32;
}
extern "C" {
    pub fn strtold_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> u128;
}
extern "C" {
    pub fn strtof32_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float32;
}
extern "C" {
    pub fn strtof64_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float64;
}
extern "C" {
    pub fn strtof32x_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float32x;
}
extern "C" {
    pub fn strtof64x_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float64x;
}
extern "C" {
    pub fn l64a(__n: u64) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> u64;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type ino64_t = __ino64_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type off64_t = __off64_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type ssize_t = __ssize_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type useconds_t = __useconds_t;
pub type suseconds_t = __suseconds_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulong;
pub type register_t = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type __fd_mask = u64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gnu_dev_major(__dev: __dev_t) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_minor(__dev: __dev_t) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_makedev(
        __major: ::std::os::raw::c_uint,
        __minor: ::std::os::raw::c_uint,
    ) -> __dev_t;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type blkcnt64_t = __blkcnt64_t;
pub type fsblkcnt64_t = __fsblkcnt64_t;
pub type fsfilcnt64_t = __fsfilcnt64_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: u64,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: u64,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: u64,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: u64,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: u64,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn random() -> u64;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: size_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).fptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rptr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).state as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_type as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_deg as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).rand_sep as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<random_data>())).end_ptr as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: size_t,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> u64;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> u64;
}
extern "C" {
    pub fn mrand48() -> u64;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> u64;
}
extern "C" {
    pub fn srand48(__seedval: u64);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__old_x as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__c as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__init as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<drand48_data>())).__a as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut u64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: u64,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: size_t, __size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn alloca(__size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: size_t,
        __size: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: size_t, __size: size_t) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn secure_getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemp64(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps64(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkostemp(
        __template: *mut ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemp64(
        __template: *mut ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemps64(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn canonicalize_file_name(
        __name: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type comparison_fn_t = __compar_fn_t;
pub type __compar_d_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn qsort_r(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: size_t,
        __size: size_t,
        __compar: __compar_d_fn_t,
        __arg: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: u64) -> u64;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: u64, __denom: u64) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: size_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut u32,
        __s: *const ::std::os::raw::c_char,
        __n: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut u32, __s: *const ::std::os::raw::c_char, __n: size_t) -> size_t;
}
extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const u32, __n: size_t) -> size_t;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setkey(__key: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn posix_openpt(__oflag: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn grantpt(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unlockpt(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ptsname(__fd: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ptsname_r(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: size_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpt() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
pub const BNPluginLoadOrder_EarlyPluginLoadOrder: BNPluginLoadOrder = 0;
pub const BNPluginLoadOrder_NormalPluginLoadOrder: BNPluginLoadOrder = 1;
pub const BNPluginLoadOrder_LatePluginLoadOrder: BNPluginLoadOrder = 2;
pub type BNPluginLoadOrder = ::std::os::raw::c_uint;
pub const PluginLoadStatus_NotAttemptedStatus: PluginLoadStatus = 0;
pub const PluginLoadStatus_LoadSucceededStatus: PluginLoadStatus = 1;
pub const PluginLoadStatus_LoadFaildStatus: PluginLoadStatus = 2;
pub type PluginLoadStatus = ::std::os::raw::c_uint;
pub type BNCorePluginInitFunction = ::std::option::Option<unsafe extern "C" fn() -> bool>;
pub type BNCorePluginDependencyFunction = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDataBuffer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBinaryView {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBinaryViewType {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBinaryReader {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBinaryWriter {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFileMetadata {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTransform {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNArchitecture {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFunction {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBasicBlock {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDownloadProvider {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDownloadInstance {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFlowGraph {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFlowGraphNode {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFlowGraphLayoutRequest {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNSymbol {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTemporaryFile {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLowLevelILFunction {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNMediumLevelILFunction {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNHighLevelILFunction {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNType {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeBuilder {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeLibrary {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeLibraryMapping {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNStructure {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNStructureBuilder {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTagType {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTag {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNUser {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNNamedTypeReference {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNEnumeration {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNEnumerationBuilder {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCallingConvention {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNPlatform {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNAnalysisCompletionEvent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDisassemblySettings {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNSaveSettings {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNScriptingProvider {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNScriptingInstance {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNMainThreadAction {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBackgroundTask {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRepository {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRepoPlugin {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRepositoryManager {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNSettings {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNMetadata {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNReportCollection {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRelocation {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNSegment {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNSection {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRelocationHandler {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDataRenderer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDataRendererContainer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDisassemblyTextRenderer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLinearViewObject {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLinearViewCursor {
    _unused: [u8; 0],
}
pub type BNLoadPluginCallback = ::std::option::Option<
    unsafe extern "C" fn(
        repoPath: *const ::std::os::raw::c_char,
        pluginPath: *const ::std::os::raw::c_char,
        force: bool,
        ctx: *mut ::std::os::raw::c_void,
    ) -> bool,
>;
pub const BNLogLevel_DebugLog: BNLogLevel = 0;
#[doc = "! Debug logging level, most verbose logging level"]
pub const BNLogLevel_InfoLog: BNLogLevel = 1;
#[doc = "! Information logging level, default logging level"]
pub const BNLogLevel_WarningLog: BNLogLevel = 2;
#[doc = "! Warning logging level, messages show with warning icon in the UI"]
pub const BNLogLevel_ErrorLog: BNLogLevel = 3;
#[doc = "! Error logging level, messages show with error icon in the UI"]
pub const BNLogLevel_AlertLog: BNLogLevel = 4;
#[doc = "! Console log levels"]
pub type BNLogLevel = ::std::os::raw::c_uint;
pub const BNEndianness_LittleEndian: BNEndianness = 0;
pub const BNEndianness_BigEndian: BNEndianness = 1;
pub type BNEndianness = ::std::os::raw::c_uint;
pub const BNModificationStatus_Original: BNModificationStatus = 0;
pub const BNModificationStatus_Changed: BNModificationStatus = 1;
pub const BNModificationStatus_Inserted: BNModificationStatus = 2;
pub type BNModificationStatus = ::std::os::raw::c_uint;
pub const BNTransformType_BinaryCodecTransform: BNTransformType = 0;
pub const BNTransformType_TextCodecTransform: BNTransformType = 1;
pub const BNTransformType_UnicodeCodecTransform: BNTransformType = 2;
pub const BNTransformType_DecodeTransform: BNTransformType = 3;
pub const BNTransformType_BinaryEncodeTransform: BNTransformType = 4;
pub const BNTransformType_TextEncodeTransform: BNTransformType = 5;
pub const BNTransformType_EncryptTransform: BNTransformType = 6;
pub const BNTransformType_InvertingTransform: BNTransformType = 7;
pub const BNTransformType_HashTransform: BNTransformType = 8;
pub type BNTransformType = ::std::os::raw::c_uint;
pub const BNBranchType_UnconditionalBranch: BNBranchType = 0;
pub const BNBranchType_FalseBranch: BNBranchType = 1;
pub const BNBranchType_TrueBranch: BNBranchType = 2;
pub const BNBranchType_CallDestination: BNBranchType = 3;
pub const BNBranchType_FunctionReturn: BNBranchType = 4;
pub const BNBranchType_SystemCall: BNBranchType = 5;
pub const BNBranchType_IndirectBranch: BNBranchType = 6;
pub const BNBranchType_ExceptionBranch: BNBranchType = 7;
pub const BNBranchType_UnresolvedBranch: BNBranchType = 127;
pub const BNBranchType_UserDefinedBranch: BNBranchType = 128;
pub type BNBranchType = ::std::os::raw::c_uint;
pub const BNInstructionTextTokenType_TextToken: BNInstructionTextTokenType = 0;
pub const BNInstructionTextTokenType_InstructionToken: BNInstructionTextTokenType = 1;
pub const BNInstructionTextTokenType_OperandSeparatorToken: BNInstructionTextTokenType = 2;
pub const BNInstructionTextTokenType_RegisterToken: BNInstructionTextTokenType = 3;
pub const BNInstructionTextTokenType_IntegerToken: BNInstructionTextTokenType = 4;
pub const BNInstructionTextTokenType_PossibleAddressToken: BNInstructionTextTokenType = 5;
pub const BNInstructionTextTokenType_BeginMemoryOperandToken: BNInstructionTextTokenType = 6;
pub const BNInstructionTextTokenType_EndMemoryOperandToken: BNInstructionTextTokenType = 7;
pub const BNInstructionTextTokenType_FloatingPointToken: BNInstructionTextTokenType = 8;
pub const BNInstructionTextTokenType_AnnotationToken: BNInstructionTextTokenType = 9;
pub const BNInstructionTextTokenType_CodeRelativeAddressToken: BNInstructionTextTokenType = 10;
pub const BNInstructionTextTokenType_ArgumentNameToken: BNInstructionTextTokenType = 11;
pub const BNInstructionTextTokenType_HexDumpByteValueToken: BNInstructionTextTokenType = 12;
pub const BNInstructionTextTokenType_HexDumpSkippedByteToken: BNInstructionTextTokenType = 13;
pub const BNInstructionTextTokenType_HexDumpInvalidByteToken: BNInstructionTextTokenType = 14;
pub const BNInstructionTextTokenType_HexDumpTextToken: BNInstructionTextTokenType = 15;
pub const BNInstructionTextTokenType_OpcodeToken: BNInstructionTextTokenType = 16;
pub const BNInstructionTextTokenType_StringToken: BNInstructionTextTokenType = 17;
pub const BNInstructionTextTokenType_CharacterConstantToken: BNInstructionTextTokenType = 18;
pub const BNInstructionTextTokenType_KeywordToken: BNInstructionTextTokenType = 19;
pub const BNInstructionTextTokenType_TypeNameToken: BNInstructionTextTokenType = 20;
pub const BNInstructionTextTokenType_FieldNameToken: BNInstructionTextTokenType = 21;
pub const BNInstructionTextTokenType_NameSpaceToken: BNInstructionTextTokenType = 22;
pub const BNInstructionTextTokenType_NameSpaceSeparatorToken: BNInstructionTextTokenType = 23;
pub const BNInstructionTextTokenType_TagToken: BNInstructionTextTokenType = 24;
pub const BNInstructionTextTokenType_StructOffsetToken: BNInstructionTextTokenType = 25;
pub const BNInstructionTextTokenType_StructOffsetByteValueToken: BNInstructionTextTokenType = 26;
pub const BNInstructionTextTokenType_StructureHexDumpTextToken: BNInstructionTextTokenType = 27;
pub const BNInstructionTextTokenType_GotoLabelToken: BNInstructionTextTokenType = 28;
pub const BNInstructionTextTokenType_CommentToken: BNInstructionTextTokenType = 29;
pub const BNInstructionTextTokenType_PossibleValueToken: BNInstructionTextTokenType = 30;
pub const BNInstructionTextTokenType_PossibleValueTypeToken: BNInstructionTextTokenType = 31;
pub const BNInstructionTextTokenType_ArrayIndexToken: BNInstructionTextTokenType = 32;
pub const BNInstructionTextTokenType_IndentationToken: BNInstructionTextTokenType = 33;
pub const BNInstructionTextTokenType_CodeSymbolToken: BNInstructionTextTokenType = 64;
pub const BNInstructionTextTokenType_DataSymbolToken: BNInstructionTextTokenType = 65;
pub const BNInstructionTextTokenType_LocalVariableToken: BNInstructionTextTokenType = 66;
pub const BNInstructionTextTokenType_ImportToken: BNInstructionTextTokenType = 67;
pub const BNInstructionTextTokenType_AddressDisplayToken: BNInstructionTextTokenType = 68;
pub const BNInstructionTextTokenType_IndirectImportToken: BNInstructionTextTokenType = 69;
pub const BNInstructionTextTokenType_ExternalSymbolToken: BNInstructionTextTokenType = 70;
pub type BNInstructionTextTokenType = ::std::os::raw::c_uint;
pub const BNInstructionTextTokenContext_NoTokenContext: BNInstructionTextTokenContext = 0;
pub const BNInstructionTextTokenContext_LocalVariableTokenContext: BNInstructionTextTokenContext =
    1;
pub const BNInstructionTextTokenContext_DataVariableTokenContext: BNInstructionTextTokenContext = 2;
pub const BNInstructionTextTokenContext_FunctionReturnTokenContext: BNInstructionTextTokenContext =
    3;
pub const BNInstructionTextTokenContext_InstructionAddressTokenContext:
    BNInstructionTextTokenContext = 4;
pub const BNInstructionTextTokenContext_ILInstructionIndexTokenContext:
    BNInstructionTextTokenContext = 5;
pub type BNInstructionTextTokenContext = ::std::os::raw::c_uint;
pub const BNLinearDisassemblyLineType_BlankLineType: BNLinearDisassemblyLineType = 0;
pub const BNLinearDisassemblyLineType_BasicLineType: BNLinearDisassemblyLineType = 1;
pub const BNLinearDisassemblyLineType_CodeDisassemblyLineType: BNLinearDisassemblyLineType = 2;
pub const BNLinearDisassemblyLineType_DataVariableLineType: BNLinearDisassemblyLineType = 3;
pub const BNLinearDisassemblyLineType_HexDumpLineType: BNLinearDisassemblyLineType = 4;
pub const BNLinearDisassemblyLineType_FunctionHeaderLineType: BNLinearDisassemblyLineType = 5;
pub const BNLinearDisassemblyLineType_FunctionHeaderStartLineType: BNLinearDisassemblyLineType = 6;
pub const BNLinearDisassemblyLineType_FunctionHeaderEndLineType: BNLinearDisassemblyLineType = 7;
pub const BNLinearDisassemblyLineType_FunctionContinuationLineType: BNLinearDisassemblyLineType = 8;
pub const BNLinearDisassemblyLineType_LocalVariableLineType: BNLinearDisassemblyLineType = 9;
pub const BNLinearDisassemblyLineType_LocalVariableListEndLineType: BNLinearDisassemblyLineType =
    10;
pub const BNLinearDisassemblyLineType_FunctionEndLineType: BNLinearDisassemblyLineType = 11;
pub const BNLinearDisassemblyLineType_NoteStartLineType: BNLinearDisassemblyLineType = 12;
pub const BNLinearDisassemblyLineType_NoteLineType: BNLinearDisassemblyLineType = 13;
pub const BNLinearDisassemblyLineType_NoteEndLineType: BNLinearDisassemblyLineType = 14;
pub const BNLinearDisassemblyLineType_SectionStartLineType: BNLinearDisassemblyLineType = 15;
pub const BNLinearDisassemblyLineType_SectionEndLineType: BNLinearDisassemblyLineType = 16;
pub const BNLinearDisassemblyLineType_SectionSeparatorLineType: BNLinearDisassemblyLineType = 17;
pub const BNLinearDisassemblyLineType_NonContiguousSeparatorLineType: BNLinearDisassemblyLineType =
    18;
pub const BNLinearDisassemblyLineType_AnalysisWarningLineType: BNLinearDisassemblyLineType = 19;
pub type BNLinearDisassemblyLineType = ::std::os::raw::c_uint;
pub const BNAnalysisWarningActionType_NoAnalysisWarningAction: BNAnalysisWarningActionType = 0;
pub const BNAnalysisWarningActionType_ForceAnalysisWarningAction: BNAnalysisWarningActionType = 1;
pub const BNAnalysisWarningActionType_ShowStackGraphWarningAction: BNAnalysisWarningActionType = 2;
pub type BNAnalysisWarningActionType = ::std::os::raw::c_uint;
pub const BNSymbolType_FunctionSymbol: BNSymbolType = 0;
pub const BNSymbolType_ImportAddressSymbol: BNSymbolType = 1;
pub const BNSymbolType_ImportedFunctionSymbol: BNSymbolType = 2;
pub const BNSymbolType_DataSymbol: BNSymbolType = 3;
pub const BNSymbolType_ImportedDataSymbol: BNSymbolType = 4;
pub const BNSymbolType_ExternalSymbol: BNSymbolType = 5;
pub const BNSymbolType_LibraryFunctionSymbol: BNSymbolType = 6;
pub type BNSymbolType = ::std::os::raw::c_uint;
pub const BNSymbolBinding_NoBinding: BNSymbolBinding = 0;
pub const BNSymbolBinding_LocalBinding: BNSymbolBinding = 1;
pub const BNSymbolBinding_GlobalBinding: BNSymbolBinding = 2;
pub const BNSymbolBinding_WeakBinding: BNSymbolBinding = 3;
pub type BNSymbolBinding = ::std::os::raw::c_uint;
pub const BNActionType_TemporaryAction: BNActionType = 0;
pub const BNActionType_DataModificationAction: BNActionType = 1;
pub const BNActionType_AnalysisAction: BNActionType = 2;
pub const BNActionType_DataModificationAndAnalysisAction: BNActionType = 3;
pub type BNActionType = ::std::os::raw::c_uint;
pub const BNLowLevelILOperation_LLIL_NOP: BNLowLevelILOperation = 0;
pub const BNLowLevelILOperation_LLIL_SET_REG: BNLowLevelILOperation = 1;
pub const BNLowLevelILOperation_LLIL_SET_REG_SPLIT: BNLowLevelILOperation = 2;
pub const BNLowLevelILOperation_LLIL_SET_FLAG: BNLowLevelILOperation = 3;
pub const BNLowLevelILOperation_LLIL_SET_REG_STACK_REL: BNLowLevelILOperation = 4;
pub const BNLowLevelILOperation_LLIL_REG_STACK_PUSH: BNLowLevelILOperation = 5;
pub const BNLowLevelILOperation_LLIL_LOAD: BNLowLevelILOperation = 6;
pub const BNLowLevelILOperation_LLIL_STORE: BNLowLevelILOperation = 7;
pub const BNLowLevelILOperation_LLIL_PUSH: BNLowLevelILOperation = 8;
pub const BNLowLevelILOperation_LLIL_POP: BNLowLevelILOperation = 9;
pub const BNLowLevelILOperation_LLIL_REG: BNLowLevelILOperation = 10;
pub const BNLowLevelILOperation_LLIL_REG_SPLIT: BNLowLevelILOperation = 11;
pub const BNLowLevelILOperation_LLIL_REG_STACK_REL: BNLowLevelILOperation = 12;
pub const BNLowLevelILOperation_LLIL_REG_STACK_POP: BNLowLevelILOperation = 13;
pub const BNLowLevelILOperation_LLIL_REG_STACK_FREE_REG: BNLowLevelILOperation = 14;
pub const BNLowLevelILOperation_LLIL_REG_STACK_FREE_REL: BNLowLevelILOperation = 15;
pub const BNLowLevelILOperation_LLIL_CONST: BNLowLevelILOperation = 16;
pub const BNLowLevelILOperation_LLIL_CONST_PTR: BNLowLevelILOperation = 17;
pub const BNLowLevelILOperation_LLIL_EXTERN_PTR: BNLowLevelILOperation = 18;
pub const BNLowLevelILOperation_LLIL_FLOAT_CONST: BNLowLevelILOperation = 19;
pub const BNLowLevelILOperation_LLIL_FLAG: BNLowLevelILOperation = 20;
pub const BNLowLevelILOperation_LLIL_FLAG_BIT: BNLowLevelILOperation = 21;
pub const BNLowLevelILOperation_LLIL_ADD: BNLowLevelILOperation = 22;
pub const BNLowLevelILOperation_LLIL_ADC: BNLowLevelILOperation = 23;
pub const BNLowLevelILOperation_LLIL_SUB: BNLowLevelILOperation = 24;
pub const BNLowLevelILOperation_LLIL_SBB: BNLowLevelILOperation = 25;
pub const BNLowLevelILOperation_LLIL_AND: BNLowLevelILOperation = 26;
pub const BNLowLevelILOperation_LLIL_OR: BNLowLevelILOperation = 27;
pub const BNLowLevelILOperation_LLIL_XOR: BNLowLevelILOperation = 28;
pub const BNLowLevelILOperation_LLIL_LSL: BNLowLevelILOperation = 29;
pub const BNLowLevelILOperation_LLIL_LSR: BNLowLevelILOperation = 30;
pub const BNLowLevelILOperation_LLIL_ASR: BNLowLevelILOperation = 31;
pub const BNLowLevelILOperation_LLIL_ROL: BNLowLevelILOperation = 32;
pub const BNLowLevelILOperation_LLIL_RLC: BNLowLevelILOperation = 33;
pub const BNLowLevelILOperation_LLIL_ROR: BNLowLevelILOperation = 34;
pub const BNLowLevelILOperation_LLIL_RRC: BNLowLevelILOperation = 35;
pub const BNLowLevelILOperation_LLIL_MUL: BNLowLevelILOperation = 36;
pub const BNLowLevelILOperation_LLIL_MULU_DP: BNLowLevelILOperation = 37;
pub const BNLowLevelILOperation_LLIL_MULS_DP: BNLowLevelILOperation = 38;
pub const BNLowLevelILOperation_LLIL_DIVU: BNLowLevelILOperation = 39;
pub const BNLowLevelILOperation_LLIL_DIVU_DP: BNLowLevelILOperation = 40;
pub const BNLowLevelILOperation_LLIL_DIVS: BNLowLevelILOperation = 41;
pub const BNLowLevelILOperation_LLIL_DIVS_DP: BNLowLevelILOperation = 42;
pub const BNLowLevelILOperation_LLIL_MODU: BNLowLevelILOperation = 43;
pub const BNLowLevelILOperation_LLIL_MODU_DP: BNLowLevelILOperation = 44;
pub const BNLowLevelILOperation_LLIL_MODS: BNLowLevelILOperation = 45;
pub const BNLowLevelILOperation_LLIL_MODS_DP: BNLowLevelILOperation = 46;
pub const BNLowLevelILOperation_LLIL_NEG: BNLowLevelILOperation = 47;
pub const BNLowLevelILOperation_LLIL_NOT: BNLowLevelILOperation = 48;
pub const BNLowLevelILOperation_LLIL_SX: BNLowLevelILOperation = 49;
pub const BNLowLevelILOperation_LLIL_ZX: BNLowLevelILOperation = 50;
pub const BNLowLevelILOperation_LLIL_LOW_PART: BNLowLevelILOperation = 51;
pub const BNLowLevelILOperation_LLIL_JUMP: BNLowLevelILOperation = 52;
pub const BNLowLevelILOperation_LLIL_JUMP_TO: BNLowLevelILOperation = 53;
pub const BNLowLevelILOperation_LLIL_CALL: BNLowLevelILOperation = 54;
pub const BNLowLevelILOperation_LLIL_CALL_STACK_ADJUST: BNLowLevelILOperation = 55;
pub const BNLowLevelILOperation_LLIL_TAILCALL: BNLowLevelILOperation = 56;
pub const BNLowLevelILOperation_LLIL_RET: BNLowLevelILOperation = 57;
pub const BNLowLevelILOperation_LLIL_NORET: BNLowLevelILOperation = 58;
pub const BNLowLevelILOperation_LLIL_IF: BNLowLevelILOperation = 59;
pub const BNLowLevelILOperation_LLIL_GOTO: BNLowLevelILOperation = 60;
pub const BNLowLevelILOperation_LLIL_FLAG_COND: BNLowLevelILOperation = 61;
pub const BNLowLevelILOperation_LLIL_FLAG_GROUP: BNLowLevelILOperation = 62;
pub const BNLowLevelILOperation_LLIL_CMP_E: BNLowLevelILOperation = 63;
pub const BNLowLevelILOperation_LLIL_CMP_NE: BNLowLevelILOperation = 64;
pub const BNLowLevelILOperation_LLIL_CMP_SLT: BNLowLevelILOperation = 65;
pub const BNLowLevelILOperation_LLIL_CMP_ULT: BNLowLevelILOperation = 66;
pub const BNLowLevelILOperation_LLIL_CMP_SLE: BNLowLevelILOperation = 67;
pub const BNLowLevelILOperation_LLIL_CMP_ULE: BNLowLevelILOperation = 68;
pub const BNLowLevelILOperation_LLIL_CMP_SGE: BNLowLevelILOperation = 69;
pub const BNLowLevelILOperation_LLIL_CMP_UGE: BNLowLevelILOperation = 70;
pub const BNLowLevelILOperation_LLIL_CMP_SGT: BNLowLevelILOperation = 71;
pub const BNLowLevelILOperation_LLIL_CMP_UGT: BNLowLevelILOperation = 72;
pub const BNLowLevelILOperation_LLIL_TEST_BIT: BNLowLevelILOperation = 73;
pub const BNLowLevelILOperation_LLIL_BOOL_TO_INT: BNLowLevelILOperation = 74;
pub const BNLowLevelILOperation_LLIL_ADD_OVERFLOW: BNLowLevelILOperation = 75;
pub const BNLowLevelILOperation_LLIL_SYSCALL: BNLowLevelILOperation = 76;
pub const BNLowLevelILOperation_LLIL_BP: BNLowLevelILOperation = 77;
pub const BNLowLevelILOperation_LLIL_TRAP: BNLowLevelILOperation = 78;
pub const BNLowLevelILOperation_LLIL_INTRINSIC: BNLowLevelILOperation = 79;
pub const BNLowLevelILOperation_LLIL_UNDEF: BNLowLevelILOperation = 80;
pub const BNLowLevelILOperation_LLIL_UNIMPL: BNLowLevelILOperation = 81;
pub const BNLowLevelILOperation_LLIL_UNIMPL_MEM: BNLowLevelILOperation = 82;
pub const BNLowLevelILOperation_LLIL_FADD: BNLowLevelILOperation = 83;
pub const BNLowLevelILOperation_LLIL_FSUB: BNLowLevelILOperation = 84;
pub const BNLowLevelILOperation_LLIL_FMUL: BNLowLevelILOperation = 85;
pub const BNLowLevelILOperation_LLIL_FDIV: BNLowLevelILOperation = 86;
pub const BNLowLevelILOperation_LLIL_FSQRT: BNLowLevelILOperation = 87;
pub const BNLowLevelILOperation_LLIL_FNEG: BNLowLevelILOperation = 88;
pub const BNLowLevelILOperation_LLIL_FABS: BNLowLevelILOperation = 89;
pub const BNLowLevelILOperation_LLIL_FLOAT_TO_INT: BNLowLevelILOperation = 90;
pub const BNLowLevelILOperation_LLIL_INT_TO_FLOAT: BNLowLevelILOperation = 91;
pub const BNLowLevelILOperation_LLIL_FLOAT_CONV: BNLowLevelILOperation = 92;
pub const BNLowLevelILOperation_LLIL_ROUND_TO_INT: BNLowLevelILOperation = 93;
pub const BNLowLevelILOperation_LLIL_FLOOR: BNLowLevelILOperation = 94;
pub const BNLowLevelILOperation_LLIL_CEIL: BNLowLevelILOperation = 95;
pub const BNLowLevelILOperation_LLIL_FTRUNC: BNLowLevelILOperation = 96;
pub const BNLowLevelILOperation_LLIL_FCMP_E: BNLowLevelILOperation = 97;
pub const BNLowLevelILOperation_LLIL_FCMP_NE: BNLowLevelILOperation = 98;
pub const BNLowLevelILOperation_LLIL_FCMP_LT: BNLowLevelILOperation = 99;
pub const BNLowLevelILOperation_LLIL_FCMP_LE: BNLowLevelILOperation = 100;
pub const BNLowLevelILOperation_LLIL_FCMP_GE: BNLowLevelILOperation = 101;
pub const BNLowLevelILOperation_LLIL_FCMP_GT: BNLowLevelILOperation = 102;
pub const BNLowLevelILOperation_LLIL_FCMP_O: BNLowLevelILOperation = 103;
pub const BNLowLevelILOperation_LLIL_FCMP_UO: BNLowLevelILOperation = 104;
pub const BNLowLevelILOperation_LLIL_SET_REG_SSA: BNLowLevelILOperation = 105;
pub const BNLowLevelILOperation_LLIL_SET_REG_SSA_PARTIAL: BNLowLevelILOperation = 106;
pub const BNLowLevelILOperation_LLIL_SET_REG_SPLIT_SSA: BNLowLevelILOperation = 107;
pub const BNLowLevelILOperation_LLIL_SET_REG_STACK_REL_SSA: BNLowLevelILOperation = 108;
pub const BNLowLevelILOperation_LLIL_SET_REG_STACK_ABS_SSA: BNLowLevelILOperation = 109;
pub const BNLowLevelILOperation_LLIL_REG_SPLIT_DEST_SSA: BNLowLevelILOperation = 110;
pub const BNLowLevelILOperation_LLIL_REG_STACK_DEST_SSA: BNLowLevelILOperation = 111;
pub const BNLowLevelILOperation_LLIL_REG_SSA: BNLowLevelILOperation = 112;
pub const BNLowLevelILOperation_LLIL_REG_SSA_PARTIAL: BNLowLevelILOperation = 113;
pub const BNLowLevelILOperation_LLIL_REG_SPLIT_SSA: BNLowLevelILOperation = 114;
pub const BNLowLevelILOperation_LLIL_REG_STACK_REL_SSA: BNLowLevelILOperation = 115;
pub const BNLowLevelILOperation_LLIL_REG_STACK_ABS_SSA: BNLowLevelILOperation = 116;
pub const BNLowLevelILOperation_LLIL_REG_STACK_FREE_REL_SSA: BNLowLevelILOperation = 117;
pub const BNLowLevelILOperation_LLIL_REG_STACK_FREE_ABS_SSA: BNLowLevelILOperation = 118;
pub const BNLowLevelILOperation_LLIL_SET_FLAG_SSA: BNLowLevelILOperation = 119;
pub const BNLowLevelILOperation_LLIL_FLAG_SSA: BNLowLevelILOperation = 120;
pub const BNLowLevelILOperation_LLIL_FLAG_BIT_SSA: BNLowLevelILOperation = 121;
pub const BNLowLevelILOperation_LLIL_CALL_SSA: BNLowLevelILOperation = 122;
pub const BNLowLevelILOperation_LLIL_SYSCALL_SSA: BNLowLevelILOperation = 123;
pub const BNLowLevelILOperation_LLIL_TAILCALL_SSA: BNLowLevelILOperation = 124;
pub const BNLowLevelILOperation_LLIL_CALL_PARAM: BNLowLevelILOperation = 125;
pub const BNLowLevelILOperation_LLIL_CALL_STACK_SSA: BNLowLevelILOperation = 126;
pub const BNLowLevelILOperation_LLIL_CALL_OUTPUT_SSA: BNLowLevelILOperation = 127;
pub const BNLowLevelILOperation_LLIL_LOAD_SSA: BNLowLevelILOperation = 128;
pub const BNLowLevelILOperation_LLIL_STORE_SSA: BNLowLevelILOperation = 129;
pub const BNLowLevelILOperation_LLIL_INTRINSIC_SSA: BNLowLevelILOperation = 130;
pub const BNLowLevelILOperation_LLIL_REG_PHI: BNLowLevelILOperation = 131;
pub const BNLowLevelILOperation_LLIL_REG_STACK_PHI: BNLowLevelILOperation = 132;
pub const BNLowLevelILOperation_LLIL_FLAG_PHI: BNLowLevelILOperation = 133;
pub const BNLowLevelILOperation_LLIL_MEM_PHI: BNLowLevelILOperation = 134;
pub type BNLowLevelILOperation = ::std::os::raw::c_uint;
pub const BNLowLevelILFlagCondition_LLFC_E: BNLowLevelILFlagCondition = 0;
pub const BNLowLevelILFlagCondition_LLFC_NE: BNLowLevelILFlagCondition = 1;
pub const BNLowLevelILFlagCondition_LLFC_SLT: BNLowLevelILFlagCondition = 2;
pub const BNLowLevelILFlagCondition_LLFC_ULT: BNLowLevelILFlagCondition = 3;
pub const BNLowLevelILFlagCondition_LLFC_SLE: BNLowLevelILFlagCondition = 4;
pub const BNLowLevelILFlagCondition_LLFC_ULE: BNLowLevelILFlagCondition = 5;
pub const BNLowLevelILFlagCondition_LLFC_SGE: BNLowLevelILFlagCondition = 6;
pub const BNLowLevelILFlagCondition_LLFC_UGE: BNLowLevelILFlagCondition = 7;
pub const BNLowLevelILFlagCondition_LLFC_SGT: BNLowLevelILFlagCondition = 8;
pub const BNLowLevelILFlagCondition_LLFC_UGT: BNLowLevelILFlagCondition = 9;
pub const BNLowLevelILFlagCondition_LLFC_NEG: BNLowLevelILFlagCondition = 10;
pub const BNLowLevelILFlagCondition_LLFC_POS: BNLowLevelILFlagCondition = 11;
pub const BNLowLevelILFlagCondition_LLFC_O: BNLowLevelILFlagCondition = 12;
pub const BNLowLevelILFlagCondition_LLFC_NO: BNLowLevelILFlagCondition = 13;
pub const BNLowLevelILFlagCondition_LLFC_FE: BNLowLevelILFlagCondition = 14;
pub const BNLowLevelILFlagCondition_LLFC_FNE: BNLowLevelILFlagCondition = 15;
pub const BNLowLevelILFlagCondition_LLFC_FLT: BNLowLevelILFlagCondition = 16;
pub const BNLowLevelILFlagCondition_LLFC_FLE: BNLowLevelILFlagCondition = 17;
pub const BNLowLevelILFlagCondition_LLFC_FGE: BNLowLevelILFlagCondition = 18;
pub const BNLowLevelILFlagCondition_LLFC_FGT: BNLowLevelILFlagCondition = 19;
pub const BNLowLevelILFlagCondition_LLFC_FO: BNLowLevelILFlagCondition = 20;
pub const BNLowLevelILFlagCondition_LLFC_FUO: BNLowLevelILFlagCondition = 21;
pub type BNLowLevelILFlagCondition = ::std::os::raw::c_uint;
pub const BNFlagRole_SpecialFlagRole: BNFlagRole = 0;
pub const BNFlagRole_ZeroFlagRole: BNFlagRole = 1;
pub const BNFlagRole_PositiveSignFlagRole: BNFlagRole = 2;
pub const BNFlagRole_NegativeSignFlagRole: BNFlagRole = 3;
pub const BNFlagRole_CarryFlagRole: BNFlagRole = 4;
pub const BNFlagRole_OverflowFlagRole: BNFlagRole = 5;
pub const BNFlagRole_HalfCarryFlagRole: BNFlagRole = 6;
pub const BNFlagRole_EvenParityFlagRole: BNFlagRole = 7;
pub const BNFlagRole_OddParityFlagRole: BNFlagRole = 8;
pub const BNFlagRole_OrderedFlagRole: BNFlagRole = 9;
pub const BNFlagRole_UnorderedFlagRole: BNFlagRole = 10;
pub type BNFlagRole = ::std::os::raw::c_uint;
pub const BNFunctionGraphType_NormalFunctionGraph: BNFunctionGraphType = 0;
pub const BNFunctionGraphType_LowLevelILFunctionGraph: BNFunctionGraphType = 1;
pub const BNFunctionGraphType_LiftedILFunctionGraph: BNFunctionGraphType = 2;
pub const BNFunctionGraphType_LowLevelILSSAFormFunctionGraph: BNFunctionGraphType = 3;
pub const BNFunctionGraphType_MediumLevelILFunctionGraph: BNFunctionGraphType = 4;
pub const BNFunctionGraphType_MediumLevelILSSAFormFunctionGraph: BNFunctionGraphType = 5;
pub const BNFunctionGraphType_MappedMediumLevelILFunctionGraph: BNFunctionGraphType = 6;
pub const BNFunctionGraphType_MappedMediumLevelILSSAFormFunctionGraph: BNFunctionGraphType = 7;
pub const BNFunctionGraphType_HighLevelILFunctionGraph: BNFunctionGraphType = 8;
pub const BNFunctionGraphType_HighLevelILSSAFormFunctionGraph: BNFunctionGraphType = 9;
pub type BNFunctionGraphType = ::std::os::raw::c_uint;
pub const BNDisassemblyOption_ShowAddress: BNDisassemblyOption = 0;
pub const BNDisassemblyOption_ShowOpcode: BNDisassemblyOption = 1;
pub const BNDisassemblyOption_ExpandLongOpcode: BNDisassemblyOption = 2;
pub const BNDisassemblyOption_ShowVariablesAtTopOfGraph: BNDisassemblyOption = 3;
pub const BNDisassemblyOption_ShowVariableTypesWhenAssigned: BNDisassemblyOption = 4;
pub const BNDisassemblyOption_ShowDefaultRegisterTypes: BNDisassemblyOption = 5;
pub const BNDisassemblyOption_ShowCallParameterNames: BNDisassemblyOption = 6;
pub const BNDisassemblyOption_ShowRegisterHighlight: BNDisassemblyOption = 7;
pub const BNDisassemblyOption_GroupLinearDisassemblyFunctions: BNDisassemblyOption = 64;
pub const BNDisassemblyOption_HighLevelILLinearDisassembly: BNDisassemblyOption = 65;
pub const BNDisassemblyOption_WaitForIL: BNDisassemblyOption = 66;
pub const BNDisassemblyOption_ShowFlagUsage: BNDisassemblyOption = 128;
pub type BNDisassemblyOption = ::std::os::raw::c_uint;
pub const BNTypeClass_VoidTypeClass: BNTypeClass = 0;
pub const BNTypeClass_BoolTypeClass: BNTypeClass = 1;
pub const BNTypeClass_IntegerTypeClass: BNTypeClass = 2;
pub const BNTypeClass_FloatTypeClass: BNTypeClass = 3;
pub const BNTypeClass_StructureTypeClass: BNTypeClass = 4;
pub const BNTypeClass_EnumerationTypeClass: BNTypeClass = 5;
pub const BNTypeClass_PointerTypeClass: BNTypeClass = 6;
pub const BNTypeClass_ArrayTypeClass: BNTypeClass = 7;
pub const BNTypeClass_FunctionTypeClass: BNTypeClass = 8;
pub const BNTypeClass_VarArgsTypeClass: BNTypeClass = 9;
pub const BNTypeClass_ValueTypeClass: BNTypeClass = 10;
pub const BNTypeClass_NamedTypeReferenceClass: BNTypeClass = 11;
pub const BNTypeClass_WideCharTypeClass: BNTypeClass = 12;
pub type BNTypeClass = ::std::os::raw::c_uint;
pub const BNNamedTypeReferenceClass_UnknownNamedTypeClass: BNNamedTypeReferenceClass = 0;
pub const BNNamedTypeReferenceClass_TypedefNamedTypeClass: BNNamedTypeReferenceClass = 1;
pub const BNNamedTypeReferenceClass_ClassNamedTypeClass: BNNamedTypeReferenceClass = 2;
pub const BNNamedTypeReferenceClass_StructNamedTypeClass: BNNamedTypeReferenceClass = 3;
pub const BNNamedTypeReferenceClass_UnionNamedTypeClass: BNNamedTypeReferenceClass = 4;
pub const BNNamedTypeReferenceClass_EnumNamedTypeClass: BNNamedTypeReferenceClass = 5;
pub type BNNamedTypeReferenceClass = ::std::os::raw::c_uint;
pub const BNStructureType_ClassStructureType: BNStructureType = 0;
pub const BNStructureType_StructStructureType: BNStructureType = 1;
pub const BNStructureType_UnionStructureType: BNStructureType = 2;
pub type BNStructureType = ::std::os::raw::c_uint;
pub const BNMemberScope_NoScope: BNMemberScope = 0;
pub const BNMemberScope_StaticScope: BNMemberScope = 1;
pub const BNMemberScope_VirtualScope: BNMemberScope = 2;
pub const BNMemberScope_ThunkScope: BNMemberScope = 3;
pub const BNMemberScope_FriendScope: BNMemberScope = 4;
pub type BNMemberScope = ::std::os::raw::c_uint;
pub const BNMemberAccess_NoAccess: BNMemberAccess = 0;
pub const BNMemberAccess_PrivateAccess: BNMemberAccess = 1;
pub const BNMemberAccess_ProtectedAccess: BNMemberAccess = 2;
pub const BNMemberAccess_PublicAccess: BNMemberAccess = 3;
pub type BNMemberAccess = ::std::os::raw::c_uint;
pub const BNReferenceType_PointerReferenceType: BNReferenceType = 0;
pub const BNReferenceType_ReferenceReferenceType: BNReferenceType = 1;
pub const BNReferenceType_RValueReferenceType: BNReferenceType = 2;
pub const BNReferenceType_NoReference: BNReferenceType = 3;
pub type BNReferenceType = ::std::os::raw::c_uint;
pub const BNPointerSuffix_Ptr64Suffix: BNPointerSuffix = 0;
pub const BNPointerSuffix_UnalignedSuffix: BNPointerSuffix = 1;
pub const BNPointerSuffix_RestrictSuffix: BNPointerSuffix = 2;
pub const BNPointerSuffix_ReferenceSuffix: BNPointerSuffix = 3;
pub const BNPointerSuffix_LvalueSuffix: BNPointerSuffix = 4;
pub type BNPointerSuffix = ::std::os::raw::c_uint;
pub const BNNameType_NoNameType: BNNameType = 0;
pub const BNNameType_ConstructorNameType: BNNameType = 1;
pub const BNNameType_DestructorNameType: BNNameType = 2;
pub const BNNameType_OperatorNewNameType: BNNameType = 3;
pub const BNNameType_OperatorDeleteNameType: BNNameType = 4;
pub const BNNameType_OperatorAssignNameType: BNNameType = 5;
pub const BNNameType_OperatorRightShiftNameType: BNNameType = 6;
pub const BNNameType_OperatorLeftShiftNameType: BNNameType = 7;
pub const BNNameType_OperatorNotNameType: BNNameType = 8;
pub const BNNameType_OperatorEqualNameType: BNNameType = 9;
pub const BNNameType_OperatorNotEqualNameType: BNNameType = 10;
pub const BNNameType_OperatorArrayNameType: BNNameType = 11;
pub const BNNameType_OperatorArrowNameType: BNNameType = 12;
pub const BNNameType_OperatorStarNameType: BNNameType = 13;
pub const BNNameType_OperatorIncrementNameType: BNNameType = 14;
pub const BNNameType_OperatorDecrementNameType: BNNameType = 15;
pub const BNNameType_OperatorMinusNameType: BNNameType = 16;
pub const BNNameType_OperatorPlusNameType: BNNameType = 17;
pub const BNNameType_OperatorBitAndNameType: BNNameType = 18;
pub const BNNameType_OperatorArrowStarNameType: BNNameType = 19;
pub const BNNameType_OperatorDivideNameType: BNNameType = 20;
pub const BNNameType_OperatorModulusNameType: BNNameType = 21;
pub const BNNameType_OperatorLessThanNameType: BNNameType = 22;
pub const BNNameType_OperatorLessThanEqualNameType: BNNameType = 23;
pub const BNNameType_OperatorGreaterThanNameType: BNNameType = 24;
pub const BNNameType_OperatorGreaterThanEqualNameType: BNNameType = 25;
pub const BNNameType_OperatorCommaNameType: BNNameType = 26;
pub const BNNameType_OperatorParenthesesNameType: BNNameType = 27;
pub const BNNameType_OperatorTildeNameType: BNNameType = 28;
pub const BNNameType_OperatorXorNameType: BNNameType = 29;
pub const BNNameType_OperatorBitOrNameType: BNNameType = 30;
pub const BNNameType_OperatorLogicalAndNameType: BNNameType = 31;
pub const BNNameType_OperatorLogicalOrNameType: BNNameType = 32;
pub const BNNameType_OperatorStarEqualNameType: BNNameType = 33;
pub const BNNameType_OperatorPlusEqualNameType: BNNameType = 34;
pub const BNNameType_OperatorMinusEqualNameType: BNNameType = 35;
pub const BNNameType_OperatorDivideEqualNameType: BNNameType = 36;
pub const BNNameType_OperatorModulusEqualNameType: BNNameType = 37;
pub const BNNameType_OperatorRightShiftEqualNameType: BNNameType = 38;
pub const BNNameType_OperatorLeftShiftEqualNameType: BNNameType = 39;
pub const BNNameType_OperatorAndEqualNameType: BNNameType = 40;
pub const BNNameType_OperatorOrEqualNameType: BNNameType = 41;
pub const BNNameType_OperatorXorEqualNameType: BNNameType = 42;
pub const BNNameType_VFTableNameType: BNNameType = 43;
pub const BNNameType_VBTableNameType: BNNameType = 44;
pub const BNNameType_VCallNameType: BNNameType = 45;
pub const BNNameType_TypeofNameType: BNNameType = 46;
pub const BNNameType_LocalStaticGuardNameType: BNNameType = 47;
pub const BNNameType_StringNameType: BNNameType = 48;
pub const BNNameType_VBaseDestructorNameType: BNNameType = 49;
pub const BNNameType_VectorDeletingDestructorNameType: BNNameType = 50;
pub const BNNameType_DefaultConstructorClosureNameType: BNNameType = 51;
pub const BNNameType_ScalarDeletingDestructorNameType: BNNameType = 52;
pub const BNNameType_VectorConstructorIteratorNameType: BNNameType = 53;
pub const BNNameType_VectorDestructorIteratorNameType: BNNameType = 54;
pub const BNNameType_VectorVBaseConstructorIteratoreNameType: BNNameType = 55;
pub const BNNameType_VirtualDisplacementMapNameType: BNNameType = 56;
pub const BNNameType_EHVectorConstructorIteratorNameType: BNNameType = 57;
pub const BNNameType_EHVectorDestructorIteratorNameType: BNNameType = 58;
pub const BNNameType_EHVectorVBaseConstructorIteratorNameType: BNNameType = 59;
pub const BNNameType_CopyConstructorClosureNameType: BNNameType = 60;
pub const BNNameType_UDTReturningNameType: BNNameType = 61;
pub const BNNameType_LocalVFTableNameType: BNNameType = 62;
pub const BNNameType_LocalVFTableConstructorClosureNameType: BNNameType = 63;
pub const BNNameType_OperatorNewArrayNameType: BNNameType = 64;
pub const BNNameType_OperatorDeleteArrayNameType: BNNameType = 65;
pub const BNNameType_PlacementDeleteClosureNameType: BNNameType = 66;
pub const BNNameType_PlacementDeleteClosureArrayNameType: BNNameType = 67;
pub const BNNameType_OperatorReturnTypeNameType: BNNameType = 68;
pub const BNNameType_RttiTypeDescriptor: BNNameType = 69;
pub const BNNameType_RttiBaseClassDescriptor: BNNameType = 70;
pub const BNNameType_RttiBaseClassArray: BNNameType = 71;
pub const BNNameType_RttiClassHeirarchyDescriptor: BNNameType = 72;
pub const BNNameType_RttiCompleteObjectLocator: BNNameType = 73;
pub const BNNameType_OperatorUnaryMinusNameType: BNNameType = 74;
pub const BNNameType_OperatorUnaryPlusNameType: BNNameType = 75;
pub const BNNameType_OperatorUnaryBitAndNameType: BNNameType = 76;
pub const BNNameType_OperatorUnaryStarNameType: BNNameType = 77;
pub type BNNameType = ::std::os::raw::c_uint;
pub const BNCallingConventionName_NoCallingConvention: BNCallingConventionName = 0;
pub const BNCallingConventionName_CdeclCallingConvention: BNCallingConventionName = 1;
pub const BNCallingConventionName_PascalCallingConvention: BNCallingConventionName = 2;
pub const BNCallingConventionName_ThisCallCallingConvention: BNCallingConventionName = 3;
pub const BNCallingConventionName_STDCallCallingConvention: BNCallingConventionName = 4;
pub const BNCallingConventionName_FastcallCallingConvention: BNCallingConventionName = 5;
pub const BNCallingConventionName_CLRCallCallingConvention: BNCallingConventionName = 6;
pub const BNCallingConventionName_EabiCallCallingConvention: BNCallingConventionName = 7;
pub const BNCallingConventionName_VectorCallCallingConvention: BNCallingConventionName = 8;
pub type BNCallingConventionName = ::std::os::raw::c_uint;
pub const BNStringType_AsciiString: BNStringType = 0;
pub const BNStringType_Utf16String: BNStringType = 1;
pub const BNStringType_Utf32String: BNStringType = 2;
pub const BNStringType_Utf8String: BNStringType = 3;
pub type BNStringType = ::std::os::raw::c_uint;
pub const BNIntegerDisplayType_DefaultIntegerDisplayType: BNIntegerDisplayType = 0;
pub const BNIntegerDisplayType_BinaryDisplayType: BNIntegerDisplayType = 1;
pub const BNIntegerDisplayType_SignedOctalDisplayType: BNIntegerDisplayType = 2;
pub const BNIntegerDisplayType_UnsignedOctalDisplayType: BNIntegerDisplayType = 3;
pub const BNIntegerDisplayType_SignedDecimalDisplayType: BNIntegerDisplayType = 4;
pub const BNIntegerDisplayType_UnsignedDecimalDisplayType: BNIntegerDisplayType = 5;
pub const BNIntegerDisplayType_SignedHexadecimalDisplayType: BNIntegerDisplayType = 6;
pub const BNIntegerDisplayType_UnsignedHexadecimalDisplayType: BNIntegerDisplayType = 7;
pub const BNIntegerDisplayType_CharacterConstantDisplayType: BNIntegerDisplayType = 8;
pub const BNIntegerDisplayType_PointerDisplayType: BNIntegerDisplayType = 9;
pub const BNIntegerDisplayType_FloatDisplayType: BNIntegerDisplayType = 10;
pub const BNIntegerDisplayType_DoubleDisplayType: BNIntegerDisplayType = 11;
pub type BNIntegerDisplayType = ::std::os::raw::c_uint;
pub const BNFlowGraphOption_FlowGraphUsesBlockHighlights: BNFlowGraphOption = 0;
pub const BNFlowGraphOption_FlowGraphUsesInstructionHighlights: BNFlowGraphOption = 1;
pub const BNFlowGraphOption_FlowGraphIncludesUserComments: BNFlowGraphOption = 2;
pub const BNFlowGraphOption_FlowGraphAllowsPatching: BNFlowGraphOption = 3;
pub const BNFlowGraphOption_FlowGraphAllowsInlineInstructionEditing: BNFlowGraphOption = 4;
pub const BNFlowGraphOption_FlowGraphShowsSecondaryRegisterHighlighting: BNFlowGraphOption = 5;
pub type BNFlowGraphOption = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLowLevelILInstruction {
    pub operation: BNLowLevelILOperation,
    pub size: size_t,
    pub flags: u32,
    pub sourceOperand: u32,
    pub operands: [u64; 4usize],
    pub address: u64,
}
#[test]
fn bindgen_test_layout_BNLowLevelILInstruction() {
    assert_eq!(
        ::std::mem::size_of::<BNLowLevelILInstruction>(),
        64usize,
        concat!("Size of: ", stringify!(BNLowLevelILInstruction))
    );
    assert_eq!(
        ::std::mem::align_of::<BNLowLevelILInstruction>(),
        8usize,
        concat!("Alignment of ", stringify!(BNLowLevelILInstruction))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNLowLevelILInstruction>())).operation as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILInstruction),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNLowLevelILInstruction>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILInstruction),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNLowLevelILInstruction>())).flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILInstruction),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNLowLevelILInstruction>())).sourceOperand as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILInstruction),
            "::",
            stringify!(sourceOperand)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNLowLevelILInstruction>())).operands as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILInstruction),
            "::",
            stringify!(operands)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNLowLevelILInstruction>())).address as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILInstruction),
            "::",
            stringify!(address)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLowLevelILLabel {
    pub resolved: bool,
    pub ref_: size_t,
    pub operand: size_t,
}
#[test]
fn bindgen_test_layout_BNLowLevelILLabel() {
    assert_eq!(
        ::std::mem::size_of::<BNLowLevelILLabel>(),
        24usize,
        concat!("Size of: ", stringify!(BNLowLevelILLabel))
    );
    assert_eq!(
        ::std::mem::align_of::<BNLowLevelILLabel>(),
        8usize,
        concat!("Alignment of ", stringify!(BNLowLevelILLabel))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNLowLevelILLabel>())).resolved as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILLabel),
            "::",
            stringify!(resolved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNLowLevelILLabel>())).ref_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILLabel),
            "::",
            stringify!(ref_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNLowLevelILLabel>())).operand as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILLabel),
            "::",
            stringify!(operand)
        )
    );
}
pub const BNImplicitRegisterExtend_NoExtend: BNImplicitRegisterExtend = 0;
pub const BNImplicitRegisterExtend_ZeroExtendToFullWidth: BNImplicitRegisterExtend = 1;
pub const BNImplicitRegisterExtend_SignExtendToFullWidth: BNImplicitRegisterExtend = 2;
pub type BNImplicitRegisterExtend = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRegisterInfo {
    pub fullWidthRegister: u32,
    pub offset: size_t,
    pub size: size_t,
    pub extend: BNImplicitRegisterExtend,
}
#[test]
fn bindgen_test_layout_BNRegisterInfo() {
    assert_eq!(
        ::std::mem::size_of::<BNRegisterInfo>(),
        32usize,
        concat!("Size of: ", stringify!(BNRegisterInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<BNRegisterInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(BNRegisterInfo))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNRegisterInfo>())).fullWidthRegister as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterInfo),
            "::",
            stringify!(fullWidthRegister)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRegisterInfo>())).offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterInfo),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRegisterInfo>())).size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterInfo),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRegisterInfo>())).extend as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterInfo),
            "::",
            stringify!(extend)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRegisterStackInfo {
    pub firstStorageReg: u32,
    pub firstTopRelativeReg: u32,
    pub storageCount: u32,
    pub topRelativeCount: u32,
    pub stackTopReg: u32,
}
#[test]
fn bindgen_test_layout_BNRegisterStackInfo() {
    assert_eq!(
        ::std::mem::size_of::<BNRegisterStackInfo>(),
        20usize,
        concat!("Size of: ", stringify!(BNRegisterStackInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<BNRegisterStackInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(BNRegisterStackInfo))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNRegisterStackInfo>())).firstStorageReg as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterStackInfo),
            "::",
            stringify!(firstStorageReg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNRegisterStackInfo>())).firstTopRelativeReg as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterStackInfo),
            "::",
            stringify!(firstTopRelativeReg)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNRegisterStackInfo>())).storageCount as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterStackInfo),
            "::",
            stringify!(storageCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNRegisterStackInfo>())).topRelativeCount as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterStackInfo),
            "::",
            stringify!(topRelativeCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRegisterStackInfo>())).stackTopReg as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterStackInfo),
            "::",
            stringify!(stackTopReg)
        )
    );
}
pub const BNRegisterValueType_UndeterminedValue: BNRegisterValueType = 0;
pub const BNRegisterValueType_EntryValue: BNRegisterValueType = 1;
pub const BNRegisterValueType_ConstantValue: BNRegisterValueType = 2;
pub const BNRegisterValueType_ConstantPointerValue: BNRegisterValueType = 3;
pub const BNRegisterValueType_ExternalPointerValue: BNRegisterValueType = 4;
pub const BNRegisterValueType_StackFrameOffset: BNRegisterValueType = 5;
pub const BNRegisterValueType_ReturnAddressValue: BNRegisterValueType = 6;
pub const BNRegisterValueType_ImportedAddressValue: BNRegisterValueType = 7;
pub const BNRegisterValueType_SignedRangeValue: BNRegisterValueType = 8;
pub const BNRegisterValueType_UnsignedRangeValue: BNRegisterValueType = 9;
pub const BNRegisterValueType_LookupTableValue: BNRegisterValueType = 10;
pub const BNRegisterValueType_InSetOfValues: BNRegisterValueType = 11;
pub const BNRegisterValueType_NotInSetOfValues: BNRegisterValueType = 12;
pub type BNRegisterValueType = ::std::os::raw::c_uint;
pub const BNDataFlowQueryOption_FromAddressesInLookupTableQueryOption: BNDataFlowQueryOption = 0;
pub type BNDataFlowQueryOption = ::std::os::raw::c_uint;
pub const BNPluginOrigin_OfficialPluginOrigin: BNPluginOrigin = 0;
pub const BNPluginOrigin_CommunityPluginOrigin: BNPluginOrigin = 1;
pub const BNPluginOrigin_OtherPluginOrigin: BNPluginOrigin = 2;
pub type BNPluginOrigin = ::std::os::raw::c_uint;
pub const BNPluginStatus_NotInstalledPluginStatus: BNPluginStatus = 0;
pub const BNPluginStatus_InstalledPluginStatus: BNPluginStatus = 1;
pub const BNPluginStatus_EnabledPluginStatus: BNPluginStatus = 2;
pub const BNPluginStatus_UpdateAvailablePluginStatus: BNPluginStatus = 16;
pub const BNPluginStatus_DeletePendingPluginStatus: BNPluginStatus = 32;
pub const BNPluginStatus_UpdatePendingPluginStatus: BNPluginStatus = 64;
pub const BNPluginStatus_DisablePendingPluginStatus: BNPluginStatus = 128;
pub const BNPluginStatus_PendingRestartPluginStatus: BNPluginStatus = 512;
pub const BNPluginStatus_BeingUpdatedPluginStatus: BNPluginStatus = 1024;
pub const BNPluginStatus_BeingDeletedPluginStatus: BNPluginStatus = 2048;
pub type BNPluginStatus = ::std::os::raw::c_uint;
pub const BNPluginType_CorePluginType: BNPluginType = 0;
pub const BNPluginType_UiPluginType: BNPluginType = 1;
pub const BNPluginType_ArchitecturePluginType: BNPluginType = 2;
pub const BNPluginType_BinaryViewPluginType: BNPluginType = 3;
pub const BNPluginType_HelperPluginType: BNPluginType = 4;
pub type BNPluginType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLookupTableEntry {
    pub fromValues: *mut i64,
    pub fromCount: size_t,
    pub toValue: i64,
}
#[test]
fn bindgen_test_layout_BNLookupTableEntry() {
    assert_eq!(
        ::std::mem::size_of::<BNLookupTableEntry>(),
        24usize,
        concat!("Size of: ", stringify!(BNLookupTableEntry))
    );
    assert_eq!(
        ::std::mem::align_of::<BNLookupTableEntry>(),
        8usize,
        concat!("Alignment of ", stringify!(BNLookupTableEntry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNLookupTableEntry>())).fromValues as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLookupTableEntry),
            "::",
            stringify!(fromValues)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNLookupTableEntry>())).fromCount as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLookupTableEntry),
            "::",
            stringify!(fromCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNLookupTableEntry>())).toValue as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLookupTableEntry),
            "::",
            stringify!(toValue)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRegisterValue {
    pub state: BNRegisterValueType,
    pub value: i64,
    pub offset: i64,
}
#[test]
fn bindgen_test_layout_BNRegisterValue() {
    assert_eq!(
        ::std::mem::size_of::<BNRegisterValue>(),
        24usize,
        concat!("Size of: ", stringify!(BNRegisterValue))
    );
    assert_eq!(
        ::std::mem::align_of::<BNRegisterValue>(),
        8usize,
        concat!("Alignment of ", stringify!(BNRegisterValue))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRegisterValue>())).state as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterValue),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRegisterValue>())).value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterValue),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRegisterValue>())).offset as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterValue),
            "::",
            stringify!(offset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRegisterValueWithConfidence {
    pub value: BNRegisterValue,
    pub confidence: u8,
}
#[test]
fn bindgen_test_layout_BNRegisterValueWithConfidence() {
    assert_eq!(
        ::std::mem::size_of::<BNRegisterValueWithConfidence>(),
        32usize,
        concat!("Size of: ", stringify!(BNRegisterValueWithConfidence))
    );
    assert_eq!(
        ::std::mem::align_of::<BNRegisterValueWithConfidence>(),
        8usize,
        concat!("Alignment of ", stringify!(BNRegisterValueWithConfidence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNRegisterValueWithConfidence>())).value as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterValueWithConfidence),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNRegisterValueWithConfidence>())).confidence as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterValueWithConfidence),
            "::",
            stringify!(confidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNValueRange {
    pub start: u64,
    pub end: u64,
    pub step: u64,
}
#[test]
fn bindgen_test_layout_BNValueRange() {
    assert_eq!(
        ::std::mem::size_of::<BNValueRange>(),
        24usize,
        concat!("Size of: ", stringify!(BNValueRange))
    );
    assert_eq!(
        ::std::mem::align_of::<BNValueRange>(),
        8usize,
        concat!("Alignment of ", stringify!(BNValueRange))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNValueRange>())).start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNValueRange),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNValueRange>())).end as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNValueRange),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNValueRange>())).step as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNValueRange),
            "::",
            stringify!(step)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNPossibleValueSet {
    pub state: BNRegisterValueType,
    pub value: i64,
    pub offset: i64,
    pub ranges: *mut BNValueRange,
    pub valueSet: *mut i64,
    pub table: *mut BNLookupTableEntry,
    pub count: size_t,
}
#[test]
fn bindgen_test_layout_BNPossibleValueSet() {
    assert_eq!(
        ::std::mem::size_of::<BNPossibleValueSet>(),
        56usize,
        concat!("Size of: ", stringify!(BNPossibleValueSet))
    );
    assert_eq!(
        ::std::mem::align_of::<BNPossibleValueSet>(),
        8usize,
        concat!("Alignment of ", stringify!(BNPossibleValueSet))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNPossibleValueSet>())).state as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPossibleValueSet),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNPossibleValueSet>())).value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPossibleValueSet),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNPossibleValueSet>())).offset as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPossibleValueSet),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNPossibleValueSet>())).ranges as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPossibleValueSet),
            "::",
            stringify!(ranges)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNPossibleValueSet>())).valueSet as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPossibleValueSet),
            "::",
            stringify!(valueSet)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNPossibleValueSet>())).table as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPossibleValueSet),
            "::",
            stringify!(table)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNPossibleValueSet>())).count as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPossibleValueSet),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRegisterOrConstant {
    pub constant: bool,
    pub reg: u32,
    pub value: u64,
}
#[test]
fn bindgen_test_layout_BNRegisterOrConstant() {
    assert_eq!(
        ::std::mem::size_of::<BNRegisterOrConstant>(),
        16usize,
        concat!("Size of: ", stringify!(BNRegisterOrConstant))
    );
    assert_eq!(
        ::std::mem::align_of::<BNRegisterOrConstant>(),
        8usize,
        concat!("Alignment of ", stringify!(BNRegisterOrConstant))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRegisterOrConstant>())).constant as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterOrConstant),
            "::",
            stringify!(constant)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRegisterOrConstant>())).reg as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterOrConstant),
            "::",
            stringify!(reg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRegisterOrConstant>())).value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterOrConstant),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDataVariable {
    pub address: u64,
    pub type_: *mut BNType,
    pub autoDiscovered: bool,
    pub typeConfidence: u8,
}
#[test]
fn bindgen_test_layout_BNDataVariable() {
    assert_eq!(
        ::std::mem::size_of::<BNDataVariable>(),
        24usize,
        concat!("Size of: ", stringify!(BNDataVariable))
    );
    assert_eq!(
        ::std::mem::align_of::<BNDataVariable>(),
        8usize,
        concat!("Alignment of ", stringify!(BNDataVariable))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNDataVariable>())).address as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariable),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNDataVariable>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariable),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNDataVariable>())).autoDiscovered as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariable),
            "::",
            stringify!(autoDiscovered)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNDataVariable>())).typeConfidence as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariable),
            "::",
            stringify!(typeConfidence)
        )
    );
}
pub const BNMediumLevelILOperation_MLIL_NOP: BNMediumLevelILOperation = 0;
pub const BNMediumLevelILOperation_MLIL_SET_VAR: BNMediumLevelILOperation = 1;
pub const BNMediumLevelILOperation_MLIL_SET_VAR_FIELD: BNMediumLevelILOperation = 2;
pub const BNMediumLevelILOperation_MLIL_SET_VAR_SPLIT: BNMediumLevelILOperation = 3;
pub const BNMediumLevelILOperation_MLIL_LOAD: BNMediumLevelILOperation = 4;
pub const BNMediumLevelILOperation_MLIL_LOAD_STRUCT: BNMediumLevelILOperation = 5;
pub const BNMediumLevelILOperation_MLIL_STORE: BNMediumLevelILOperation = 6;
pub const BNMediumLevelILOperation_MLIL_STORE_STRUCT: BNMediumLevelILOperation = 7;
pub const BNMediumLevelILOperation_MLIL_VAR: BNMediumLevelILOperation = 8;
pub const BNMediumLevelILOperation_MLIL_VAR_FIELD: BNMediumLevelILOperation = 9;
pub const BNMediumLevelILOperation_MLIL_VAR_SPLIT: BNMediumLevelILOperation = 10;
pub const BNMediumLevelILOperation_MLIL_ADDRESS_OF: BNMediumLevelILOperation = 11;
pub const BNMediumLevelILOperation_MLIL_ADDRESS_OF_FIELD: BNMediumLevelILOperation = 12;
pub const BNMediumLevelILOperation_MLIL_CONST: BNMediumLevelILOperation = 13;
pub const BNMediumLevelILOperation_MLIL_CONST_PTR: BNMediumLevelILOperation = 14;
pub const BNMediumLevelILOperation_MLIL_EXTERN_PTR: BNMediumLevelILOperation = 15;
pub const BNMediumLevelILOperation_MLIL_FLOAT_CONST: BNMediumLevelILOperation = 16;
pub const BNMediumLevelILOperation_MLIL_IMPORT: BNMediumLevelILOperation = 17;
pub const BNMediumLevelILOperation_MLIL_ADD: BNMediumLevelILOperation = 18;
pub const BNMediumLevelILOperation_MLIL_ADC: BNMediumLevelILOperation = 19;
pub const BNMediumLevelILOperation_MLIL_SUB: BNMediumLevelILOperation = 20;
pub const BNMediumLevelILOperation_MLIL_SBB: BNMediumLevelILOperation = 21;
pub const BNMediumLevelILOperation_MLIL_AND: BNMediumLevelILOperation = 22;
pub const BNMediumLevelILOperation_MLIL_OR: BNMediumLevelILOperation = 23;
pub const BNMediumLevelILOperation_MLIL_XOR: BNMediumLevelILOperation = 24;
pub const BNMediumLevelILOperation_MLIL_LSL: BNMediumLevelILOperation = 25;
pub const BNMediumLevelILOperation_MLIL_LSR: BNMediumLevelILOperation = 26;
pub const BNMediumLevelILOperation_MLIL_ASR: BNMediumLevelILOperation = 27;
pub const BNMediumLevelILOperation_MLIL_ROL: BNMediumLevelILOperation = 28;
pub const BNMediumLevelILOperation_MLIL_RLC: BNMediumLevelILOperation = 29;
pub const BNMediumLevelILOperation_MLIL_ROR: BNMediumLevelILOperation = 30;
pub const BNMediumLevelILOperation_MLIL_RRC: BNMediumLevelILOperation = 31;
pub const BNMediumLevelILOperation_MLIL_MUL: BNMediumLevelILOperation = 32;
pub const BNMediumLevelILOperation_MLIL_MULU_DP: BNMediumLevelILOperation = 33;
pub const BNMediumLevelILOperation_MLIL_MULS_DP: BNMediumLevelILOperation = 34;
pub const BNMediumLevelILOperation_MLIL_DIVU: BNMediumLevelILOperation = 35;
pub const BNMediumLevelILOperation_MLIL_DIVU_DP: BNMediumLevelILOperation = 36;
pub const BNMediumLevelILOperation_MLIL_DIVS: BNMediumLevelILOperation = 37;
pub const BNMediumLevelILOperation_MLIL_DIVS_DP: BNMediumLevelILOperation = 38;
pub const BNMediumLevelILOperation_MLIL_MODU: BNMediumLevelILOperation = 39;
pub const BNMediumLevelILOperation_MLIL_MODU_DP: BNMediumLevelILOperation = 40;
pub const BNMediumLevelILOperation_MLIL_MODS: BNMediumLevelILOperation = 41;
pub const BNMediumLevelILOperation_MLIL_MODS_DP: BNMediumLevelILOperation = 42;
pub const BNMediumLevelILOperation_MLIL_NEG: BNMediumLevelILOperation = 43;
pub const BNMediumLevelILOperation_MLIL_NOT: BNMediumLevelILOperation = 44;
pub const BNMediumLevelILOperation_MLIL_SX: BNMediumLevelILOperation = 45;
pub const BNMediumLevelILOperation_MLIL_ZX: BNMediumLevelILOperation = 46;
pub const BNMediumLevelILOperation_MLIL_LOW_PART: BNMediumLevelILOperation = 47;
pub const BNMediumLevelILOperation_MLIL_JUMP: BNMediumLevelILOperation = 48;
pub const BNMediumLevelILOperation_MLIL_JUMP_TO: BNMediumLevelILOperation = 49;
pub const BNMediumLevelILOperation_MLIL_RET_HINT: BNMediumLevelILOperation = 50;
pub const BNMediumLevelILOperation_MLIL_CALL: BNMediumLevelILOperation = 51;
pub const BNMediumLevelILOperation_MLIL_CALL_UNTYPED: BNMediumLevelILOperation = 52;
pub const BNMediumLevelILOperation_MLIL_CALL_OUTPUT: BNMediumLevelILOperation = 53;
pub const BNMediumLevelILOperation_MLIL_CALL_PARAM: BNMediumLevelILOperation = 54;
pub const BNMediumLevelILOperation_MLIL_RET: BNMediumLevelILOperation = 55;
pub const BNMediumLevelILOperation_MLIL_NORET: BNMediumLevelILOperation = 56;
pub const BNMediumLevelILOperation_MLIL_IF: BNMediumLevelILOperation = 57;
pub const BNMediumLevelILOperation_MLIL_GOTO: BNMediumLevelILOperation = 58;
pub const BNMediumLevelILOperation_MLIL_CMP_E: BNMediumLevelILOperation = 59;
pub const BNMediumLevelILOperation_MLIL_CMP_NE: BNMediumLevelILOperation = 60;
pub const BNMediumLevelILOperation_MLIL_CMP_SLT: BNMediumLevelILOperation = 61;
pub const BNMediumLevelILOperation_MLIL_CMP_ULT: BNMediumLevelILOperation = 62;
pub const BNMediumLevelILOperation_MLIL_CMP_SLE: BNMediumLevelILOperation = 63;
pub const BNMediumLevelILOperation_MLIL_CMP_ULE: BNMediumLevelILOperation = 64;
pub const BNMediumLevelILOperation_MLIL_CMP_SGE: BNMediumLevelILOperation = 65;
pub const BNMediumLevelILOperation_MLIL_CMP_UGE: BNMediumLevelILOperation = 66;
pub const BNMediumLevelILOperation_MLIL_CMP_SGT: BNMediumLevelILOperation = 67;
pub const BNMediumLevelILOperation_MLIL_CMP_UGT: BNMediumLevelILOperation = 68;
pub const BNMediumLevelILOperation_MLIL_TEST_BIT: BNMediumLevelILOperation = 69;
pub const BNMediumLevelILOperation_MLIL_BOOL_TO_INT: BNMediumLevelILOperation = 70;
pub const BNMediumLevelILOperation_MLIL_ADD_OVERFLOW: BNMediumLevelILOperation = 71;
pub const BNMediumLevelILOperation_MLIL_SYSCALL: BNMediumLevelILOperation = 72;
pub const BNMediumLevelILOperation_MLIL_SYSCALL_UNTYPED: BNMediumLevelILOperation = 73;
pub const BNMediumLevelILOperation_MLIL_TAILCALL: BNMediumLevelILOperation = 74;
pub const BNMediumLevelILOperation_MLIL_TAILCALL_UNTYPED: BNMediumLevelILOperation = 75;
pub const BNMediumLevelILOperation_MLIL_INTRINSIC: BNMediumLevelILOperation = 76;
pub const BNMediumLevelILOperation_MLIL_FREE_VAR_SLOT: BNMediumLevelILOperation = 77;
pub const BNMediumLevelILOperation_MLIL_BP: BNMediumLevelILOperation = 78;
pub const BNMediumLevelILOperation_MLIL_TRAP: BNMediumLevelILOperation = 79;
pub const BNMediumLevelILOperation_MLIL_UNDEF: BNMediumLevelILOperation = 80;
pub const BNMediumLevelILOperation_MLIL_UNIMPL: BNMediumLevelILOperation = 81;
pub const BNMediumLevelILOperation_MLIL_UNIMPL_MEM: BNMediumLevelILOperation = 82;
pub const BNMediumLevelILOperation_MLIL_FADD: BNMediumLevelILOperation = 83;
pub const BNMediumLevelILOperation_MLIL_FSUB: BNMediumLevelILOperation = 84;
pub const BNMediumLevelILOperation_MLIL_FMUL: BNMediumLevelILOperation = 85;
pub const BNMediumLevelILOperation_MLIL_FDIV: BNMediumLevelILOperation = 86;
pub const BNMediumLevelILOperation_MLIL_FSQRT: BNMediumLevelILOperation = 87;
pub const BNMediumLevelILOperation_MLIL_FNEG: BNMediumLevelILOperation = 88;
pub const BNMediumLevelILOperation_MLIL_FABS: BNMediumLevelILOperation = 89;
pub const BNMediumLevelILOperation_MLIL_FLOAT_TO_INT: BNMediumLevelILOperation = 90;
pub const BNMediumLevelILOperation_MLIL_INT_TO_FLOAT: BNMediumLevelILOperation = 91;
pub const BNMediumLevelILOperation_MLIL_FLOAT_CONV: BNMediumLevelILOperation = 92;
pub const BNMediumLevelILOperation_MLIL_ROUND_TO_INT: BNMediumLevelILOperation = 93;
pub const BNMediumLevelILOperation_MLIL_FLOOR: BNMediumLevelILOperation = 94;
pub const BNMediumLevelILOperation_MLIL_CEIL: BNMediumLevelILOperation = 95;
pub const BNMediumLevelILOperation_MLIL_FTRUNC: BNMediumLevelILOperation = 96;
pub const BNMediumLevelILOperation_MLIL_FCMP_E: BNMediumLevelILOperation = 97;
pub const BNMediumLevelILOperation_MLIL_FCMP_NE: BNMediumLevelILOperation = 98;
pub const BNMediumLevelILOperation_MLIL_FCMP_LT: BNMediumLevelILOperation = 99;
pub const BNMediumLevelILOperation_MLIL_FCMP_LE: BNMediumLevelILOperation = 100;
pub const BNMediumLevelILOperation_MLIL_FCMP_GE: BNMediumLevelILOperation = 101;
pub const BNMediumLevelILOperation_MLIL_FCMP_GT: BNMediumLevelILOperation = 102;
pub const BNMediumLevelILOperation_MLIL_FCMP_O: BNMediumLevelILOperation = 103;
pub const BNMediumLevelILOperation_MLIL_FCMP_UO: BNMediumLevelILOperation = 104;
pub const BNMediumLevelILOperation_MLIL_SET_VAR_SSA: BNMediumLevelILOperation = 105;
pub const BNMediumLevelILOperation_MLIL_SET_VAR_SSA_FIELD: BNMediumLevelILOperation = 106;
pub const BNMediumLevelILOperation_MLIL_SET_VAR_SPLIT_SSA: BNMediumLevelILOperation = 107;
pub const BNMediumLevelILOperation_MLIL_SET_VAR_ALIASED: BNMediumLevelILOperation = 108;
pub const BNMediumLevelILOperation_MLIL_SET_VAR_ALIASED_FIELD: BNMediumLevelILOperation = 109;
pub const BNMediumLevelILOperation_MLIL_VAR_SSA: BNMediumLevelILOperation = 110;
pub const BNMediumLevelILOperation_MLIL_VAR_SSA_FIELD: BNMediumLevelILOperation = 111;
pub const BNMediumLevelILOperation_MLIL_VAR_ALIASED: BNMediumLevelILOperation = 112;
pub const BNMediumLevelILOperation_MLIL_VAR_ALIASED_FIELD: BNMediumLevelILOperation = 113;
pub const BNMediumLevelILOperation_MLIL_VAR_SPLIT_SSA: BNMediumLevelILOperation = 114;
pub const BNMediumLevelILOperation_MLIL_CALL_SSA: BNMediumLevelILOperation = 115;
pub const BNMediumLevelILOperation_MLIL_CALL_UNTYPED_SSA: BNMediumLevelILOperation = 116;
pub const BNMediumLevelILOperation_MLIL_SYSCALL_SSA: BNMediumLevelILOperation = 117;
pub const BNMediumLevelILOperation_MLIL_SYSCALL_UNTYPED_SSA: BNMediumLevelILOperation = 118;
pub const BNMediumLevelILOperation_MLIL_TAILCALL_SSA: BNMediumLevelILOperation = 119;
pub const BNMediumLevelILOperation_MLIL_TAILCALL_UNTYPED_SSA: BNMediumLevelILOperation = 120;
pub const BNMediumLevelILOperation_MLIL_CALL_PARAM_SSA: BNMediumLevelILOperation = 121;
pub const BNMediumLevelILOperation_MLIL_CALL_OUTPUT_SSA: BNMediumLevelILOperation = 122;
pub const BNMediumLevelILOperation_MLIL_LOAD_SSA: BNMediumLevelILOperation = 123;
pub const BNMediumLevelILOperation_MLIL_LOAD_STRUCT_SSA: BNMediumLevelILOperation = 124;
pub const BNMediumLevelILOperation_MLIL_STORE_SSA: BNMediumLevelILOperation = 125;
pub const BNMediumLevelILOperation_MLIL_STORE_STRUCT_SSA: BNMediumLevelILOperation = 126;
pub const BNMediumLevelILOperation_MLIL_INTRINSIC_SSA: BNMediumLevelILOperation = 127;
pub const BNMediumLevelILOperation_MLIL_FREE_VAR_SLOT_SSA: BNMediumLevelILOperation = 128;
pub const BNMediumLevelILOperation_MLIL_VAR_PHI: BNMediumLevelILOperation = 129;
pub const BNMediumLevelILOperation_MLIL_MEM_PHI: BNMediumLevelILOperation = 130;
pub type BNMediumLevelILOperation = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNMediumLevelILInstruction {
    pub operation: BNMediumLevelILOperation,
    pub sourceOperand: u32,
    pub size: size_t,
    pub operands: [u64; 5usize],
    pub address: u64,
}
#[test]
fn bindgen_test_layout_BNMediumLevelILInstruction() {
    assert_eq!(
        ::std::mem::size_of::<BNMediumLevelILInstruction>(),
        64usize,
        concat!("Size of: ", stringify!(BNMediumLevelILInstruction))
    );
    assert_eq!(
        ::std::mem::align_of::<BNMediumLevelILInstruction>(),
        8usize,
        concat!("Alignment of ", stringify!(BNMediumLevelILInstruction))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNMediumLevelILInstruction>())).operation as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILInstruction),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNMediumLevelILInstruction>())).sourceOperand as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILInstruction),
            "::",
            stringify!(sourceOperand)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNMediumLevelILInstruction>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILInstruction),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNMediumLevelILInstruction>())).operands as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILInstruction),
            "::",
            stringify!(operands)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNMediumLevelILInstruction>())).address as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILInstruction),
            "::",
            stringify!(address)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNMediumLevelILLabel {
    pub resolved: bool,
    pub ref_: size_t,
    pub operand: size_t,
}
#[test]
fn bindgen_test_layout_BNMediumLevelILLabel() {
    assert_eq!(
        ::std::mem::size_of::<BNMediumLevelILLabel>(),
        24usize,
        concat!("Size of: ", stringify!(BNMediumLevelILLabel))
    );
    assert_eq!(
        ::std::mem::align_of::<BNMediumLevelILLabel>(),
        8usize,
        concat!("Alignment of ", stringify!(BNMediumLevelILLabel))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNMediumLevelILLabel>())).resolved as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILLabel),
            "::",
            stringify!(resolved)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNMediumLevelILLabel>())).ref_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILLabel),
            "::",
            stringify!(ref_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNMediumLevelILLabel>())).operand as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILLabel),
            "::",
            stringify!(operand)
        )
    );
}
pub const BNVariableSourceType_StackVariableSourceType: BNVariableSourceType = 0;
pub const BNVariableSourceType_RegisterVariableSourceType: BNVariableSourceType = 1;
pub const BNVariableSourceType_FlagVariableSourceType: BNVariableSourceType = 2;
pub type BNVariableSourceType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNVariable {
    pub type_: BNVariableSourceType,
    pub index: u32,
    pub storage: i64,
}
#[test]
fn bindgen_test_layout_BNVariable() {
    assert_eq!(
        ::std::mem::size_of::<BNVariable>(),
        16usize,
        concat!("Size of: ", stringify!(BNVariable))
    );
    assert_eq!(
        ::std::mem::align_of::<BNVariable>(),
        8usize,
        concat!("Alignment of ", stringify!(BNVariable))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNVariable>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNVariable),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNVariable>())).index as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNVariable),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNVariable>())).storage as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNVariable),
            "::",
            stringify!(storage)
        )
    );
}
pub const BNHighLevelILOperation_HLIL_NOP: BNHighLevelILOperation = 0;
pub const BNHighLevelILOperation_HLIL_BLOCK: BNHighLevelILOperation = 1;
pub const BNHighLevelILOperation_HLIL_IF: BNHighLevelILOperation = 2;
pub const BNHighLevelILOperation_HLIL_WHILE: BNHighLevelILOperation = 3;
pub const BNHighLevelILOperation_HLIL_DO_WHILE: BNHighLevelILOperation = 4;
pub const BNHighLevelILOperation_HLIL_FOR: BNHighLevelILOperation = 5;
pub const BNHighLevelILOperation_HLIL_SWITCH: BNHighLevelILOperation = 6;
pub const BNHighLevelILOperation_HLIL_CASE: BNHighLevelILOperation = 7;
pub const BNHighLevelILOperation_HLIL_BREAK: BNHighLevelILOperation = 8;
pub const BNHighLevelILOperation_HLIL_CONTINUE: BNHighLevelILOperation = 9;
pub const BNHighLevelILOperation_HLIL_JUMP: BNHighLevelILOperation = 10;
pub const BNHighLevelILOperation_HLIL_RET: BNHighLevelILOperation = 11;
pub const BNHighLevelILOperation_HLIL_NORET: BNHighLevelILOperation = 12;
pub const BNHighLevelILOperation_HLIL_GOTO: BNHighLevelILOperation = 13;
pub const BNHighLevelILOperation_HLIL_LABEL: BNHighLevelILOperation = 14;
pub const BNHighLevelILOperation_HLIL_VAR_DECLARE: BNHighLevelILOperation = 15;
pub const BNHighLevelILOperation_HLIL_VAR_INIT: BNHighLevelILOperation = 16;
pub const BNHighLevelILOperation_HLIL_ASSIGN: BNHighLevelILOperation = 17;
pub const BNHighLevelILOperation_HLIL_ASSIGN_UNPACK: BNHighLevelILOperation = 18;
pub const BNHighLevelILOperation_HLIL_VAR: BNHighLevelILOperation = 19;
pub const BNHighLevelILOperation_HLIL_STRUCT_FIELD: BNHighLevelILOperation = 20;
pub const BNHighLevelILOperation_HLIL_ARRAY_INDEX: BNHighLevelILOperation = 21;
pub const BNHighLevelILOperation_HLIL_SPLIT: BNHighLevelILOperation = 22;
pub const BNHighLevelILOperation_HLIL_DEREF: BNHighLevelILOperation = 23;
pub const BNHighLevelILOperation_HLIL_DEREF_FIELD: BNHighLevelILOperation = 24;
pub const BNHighLevelILOperation_HLIL_ADDRESS_OF: BNHighLevelILOperation = 25;
pub const BNHighLevelILOperation_HLIL_CONST: BNHighLevelILOperation = 26;
pub const BNHighLevelILOperation_HLIL_CONST_PTR: BNHighLevelILOperation = 27;
pub const BNHighLevelILOperation_HLIL_EXTERN_PTR: BNHighLevelILOperation = 28;
pub const BNHighLevelILOperation_HLIL_FLOAT_CONST: BNHighLevelILOperation = 29;
pub const BNHighLevelILOperation_HLIL_IMPORT: BNHighLevelILOperation = 30;
pub const BNHighLevelILOperation_HLIL_ADD: BNHighLevelILOperation = 31;
pub const BNHighLevelILOperation_HLIL_ADC: BNHighLevelILOperation = 32;
pub const BNHighLevelILOperation_HLIL_SUB: BNHighLevelILOperation = 33;
pub const BNHighLevelILOperation_HLIL_SBB: BNHighLevelILOperation = 34;
pub const BNHighLevelILOperation_HLIL_AND: BNHighLevelILOperation = 35;
pub const BNHighLevelILOperation_HLIL_OR: BNHighLevelILOperation = 36;
pub const BNHighLevelILOperation_HLIL_XOR: BNHighLevelILOperation = 37;
pub const BNHighLevelILOperation_HLIL_LSL: BNHighLevelILOperation = 38;
pub const BNHighLevelILOperation_HLIL_LSR: BNHighLevelILOperation = 39;
pub const BNHighLevelILOperation_HLIL_ASR: BNHighLevelILOperation = 40;
pub const BNHighLevelILOperation_HLIL_ROL: BNHighLevelILOperation = 41;
pub const BNHighLevelILOperation_HLIL_RLC: BNHighLevelILOperation = 42;
pub const BNHighLevelILOperation_HLIL_ROR: BNHighLevelILOperation = 43;
pub const BNHighLevelILOperation_HLIL_RRC: BNHighLevelILOperation = 44;
pub const BNHighLevelILOperation_HLIL_MUL: BNHighLevelILOperation = 45;
pub const BNHighLevelILOperation_HLIL_MULU_DP: BNHighLevelILOperation = 46;
pub const BNHighLevelILOperation_HLIL_MULS_DP: BNHighLevelILOperation = 47;
pub const BNHighLevelILOperation_HLIL_DIVU: BNHighLevelILOperation = 48;
pub const BNHighLevelILOperation_HLIL_DIVU_DP: BNHighLevelILOperation = 49;
pub const BNHighLevelILOperation_HLIL_DIVS: BNHighLevelILOperation = 50;
pub const BNHighLevelILOperation_HLIL_DIVS_DP: BNHighLevelILOperation = 51;
pub const BNHighLevelILOperation_HLIL_MODU: BNHighLevelILOperation = 52;
pub const BNHighLevelILOperation_HLIL_MODU_DP: BNHighLevelILOperation = 53;
pub const BNHighLevelILOperation_HLIL_MODS: BNHighLevelILOperation = 54;
pub const BNHighLevelILOperation_HLIL_MODS_DP: BNHighLevelILOperation = 55;
pub const BNHighLevelILOperation_HLIL_NEG: BNHighLevelILOperation = 56;
pub const BNHighLevelILOperation_HLIL_NOT: BNHighLevelILOperation = 57;
pub const BNHighLevelILOperation_HLIL_SX: BNHighLevelILOperation = 58;
pub const BNHighLevelILOperation_HLIL_ZX: BNHighLevelILOperation = 59;
pub const BNHighLevelILOperation_HLIL_LOW_PART: BNHighLevelILOperation = 60;
pub const BNHighLevelILOperation_HLIL_CALL: BNHighLevelILOperation = 61;
pub const BNHighLevelILOperation_HLIL_CMP_E: BNHighLevelILOperation = 62;
pub const BNHighLevelILOperation_HLIL_CMP_NE: BNHighLevelILOperation = 63;
pub const BNHighLevelILOperation_HLIL_CMP_SLT: BNHighLevelILOperation = 64;
pub const BNHighLevelILOperation_HLIL_CMP_ULT: BNHighLevelILOperation = 65;
pub const BNHighLevelILOperation_HLIL_CMP_SLE: BNHighLevelILOperation = 66;
pub const BNHighLevelILOperation_HLIL_CMP_ULE: BNHighLevelILOperation = 67;
pub const BNHighLevelILOperation_HLIL_CMP_SGE: BNHighLevelILOperation = 68;
pub const BNHighLevelILOperation_HLIL_CMP_UGE: BNHighLevelILOperation = 69;
pub const BNHighLevelILOperation_HLIL_CMP_SGT: BNHighLevelILOperation = 70;
pub const BNHighLevelILOperation_HLIL_CMP_UGT: BNHighLevelILOperation = 71;
pub const BNHighLevelILOperation_HLIL_TEST_BIT: BNHighLevelILOperation = 72;
pub const BNHighLevelILOperation_HLIL_BOOL_TO_INT: BNHighLevelILOperation = 73;
pub const BNHighLevelILOperation_HLIL_ADD_OVERFLOW: BNHighLevelILOperation = 74;
pub const BNHighLevelILOperation_HLIL_SYSCALL: BNHighLevelILOperation = 75;
pub const BNHighLevelILOperation_HLIL_TAILCALL: BNHighLevelILOperation = 76;
pub const BNHighLevelILOperation_HLIL_INTRINSIC: BNHighLevelILOperation = 77;
pub const BNHighLevelILOperation_HLIL_BP: BNHighLevelILOperation = 78;
pub const BNHighLevelILOperation_HLIL_TRAP: BNHighLevelILOperation = 79;
pub const BNHighLevelILOperation_HLIL_UNDEF: BNHighLevelILOperation = 80;
pub const BNHighLevelILOperation_HLIL_UNIMPL: BNHighLevelILOperation = 81;
pub const BNHighLevelILOperation_HLIL_UNIMPL_MEM: BNHighLevelILOperation = 82;
pub const BNHighLevelILOperation_HLIL_FADD: BNHighLevelILOperation = 83;
pub const BNHighLevelILOperation_HLIL_FSUB: BNHighLevelILOperation = 84;
pub const BNHighLevelILOperation_HLIL_FMUL: BNHighLevelILOperation = 85;
pub const BNHighLevelILOperation_HLIL_FDIV: BNHighLevelILOperation = 86;
pub const BNHighLevelILOperation_HLIL_FSQRT: BNHighLevelILOperation = 87;
pub const BNHighLevelILOperation_HLIL_FNEG: BNHighLevelILOperation = 88;
pub const BNHighLevelILOperation_HLIL_FABS: BNHighLevelILOperation = 89;
pub const BNHighLevelILOperation_HLIL_FLOAT_TO_INT: BNHighLevelILOperation = 90;
pub const BNHighLevelILOperation_HLIL_INT_TO_FLOAT: BNHighLevelILOperation = 91;
pub const BNHighLevelILOperation_HLIL_FLOAT_CONV: BNHighLevelILOperation = 92;
pub const BNHighLevelILOperation_HLIL_ROUND_TO_INT: BNHighLevelILOperation = 93;
pub const BNHighLevelILOperation_HLIL_FLOOR: BNHighLevelILOperation = 94;
pub const BNHighLevelILOperation_HLIL_CEIL: BNHighLevelILOperation = 95;
pub const BNHighLevelILOperation_HLIL_FTRUNC: BNHighLevelILOperation = 96;
pub const BNHighLevelILOperation_HLIL_FCMP_E: BNHighLevelILOperation = 97;
pub const BNHighLevelILOperation_HLIL_FCMP_NE: BNHighLevelILOperation = 98;
pub const BNHighLevelILOperation_HLIL_FCMP_LT: BNHighLevelILOperation = 99;
pub const BNHighLevelILOperation_HLIL_FCMP_LE: BNHighLevelILOperation = 100;
pub const BNHighLevelILOperation_HLIL_FCMP_GE: BNHighLevelILOperation = 101;
pub const BNHighLevelILOperation_HLIL_FCMP_GT: BNHighLevelILOperation = 102;
pub const BNHighLevelILOperation_HLIL_FCMP_O: BNHighLevelILOperation = 103;
pub const BNHighLevelILOperation_HLIL_FCMP_UO: BNHighLevelILOperation = 104;
pub const BNHighLevelILOperation_HLIL_WHILE_SSA: BNHighLevelILOperation = 105;
pub const BNHighLevelILOperation_HLIL_DO_WHILE_SSA: BNHighLevelILOperation = 106;
pub const BNHighLevelILOperation_HLIL_FOR_SSA: BNHighLevelILOperation = 107;
pub const BNHighLevelILOperation_HLIL_VAR_INIT_SSA: BNHighLevelILOperation = 108;
pub const BNHighLevelILOperation_HLIL_ASSIGN_MEM_SSA: BNHighLevelILOperation = 109;
pub const BNHighLevelILOperation_HLIL_ASSIGN_UNPACK_MEM_SSA: BNHighLevelILOperation = 110;
pub const BNHighLevelILOperation_HLIL_VAR_SSA: BNHighLevelILOperation = 111;
pub const BNHighLevelILOperation_HLIL_ARRAY_INDEX_SSA: BNHighLevelILOperation = 112;
pub const BNHighLevelILOperation_HLIL_DEREF_SSA: BNHighLevelILOperation = 113;
pub const BNHighLevelILOperation_HLIL_DEREF_FIELD_SSA: BNHighLevelILOperation = 114;
pub const BNHighLevelILOperation_HLIL_CALL_SSA: BNHighLevelILOperation = 115;
pub const BNHighLevelILOperation_HLIL_SYSCALL_SSA: BNHighLevelILOperation = 116;
pub const BNHighLevelILOperation_HLIL_INTRINSIC_SSA: BNHighLevelILOperation = 117;
pub const BNHighLevelILOperation_HLIL_VAR_PHI: BNHighLevelILOperation = 118;
pub const BNHighLevelILOperation_HLIL_MEM_PHI: BNHighLevelILOperation = 119;
pub type BNHighLevelILOperation = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNHighLevelILInstruction {
    pub operation: BNHighLevelILOperation,
    pub sourceOperand: u32,
    pub size: size_t,
    pub operands: [u64; 5usize],
    pub address: u64,
    pub parent: size_t,
}
#[test]
fn bindgen_test_layout_BNHighLevelILInstruction() {
    assert_eq!(
        ::std::mem::size_of::<BNHighLevelILInstruction>(),
        72usize,
        concat!("Size of: ", stringify!(BNHighLevelILInstruction))
    );
    assert_eq!(
        ::std::mem::align_of::<BNHighLevelILInstruction>(),
        8usize,
        concat!("Alignment of ", stringify!(BNHighLevelILInstruction))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNHighLevelILInstruction>())).operation as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighLevelILInstruction),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNHighLevelILInstruction>())).sourceOperand as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighLevelILInstruction),
            "::",
            stringify!(sourceOperand)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNHighLevelILInstruction>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighLevelILInstruction),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNHighLevelILInstruction>())).operands as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighLevelILInstruction),
            "::",
            stringify!(operands)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNHighLevelILInstruction>())).address as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighLevelILInstruction),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNHighLevelILInstruction>())).parent as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighLevelILInstruction),
            "::",
            stringify!(parent)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLogListener {
    pub context: *mut ::std::os::raw::c_void,
    pub log: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            level: BNLogLevel,
            msg: *const ::std::os::raw::c_char,
        ),
    >,
    pub close: ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub getLogLevel: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> BNLogLevel,
    >,
}
#[test]
fn bindgen_test_layout_BNLogListener() {
    assert_eq!(
        ::std::mem::size_of::<BNLogListener>(),
        32usize,
        concat!("Size of: ", stringify!(BNLogListener))
    );
    assert_eq!(
        ::std::mem::align_of::<BNLogListener>(),
        8usize,
        concat!("Alignment of ", stringify!(BNLogListener))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNLogListener>())).context as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLogListener),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNLogListener>())).log as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLogListener),
            "::",
            stringify!(log)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNLogListener>())).close as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLogListener),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNLogListener>())).getLogLevel as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLogListener),
            "::",
            stringify!(getLogLevel)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNNavigationHandler {
    pub context: *mut ::std::os::raw::c_void,
    pub getCurrentView: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_char,
    >,
    pub getCurrentOffset:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u64>,
    pub navigate: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *const ::std::os::raw::c_char,
            offset: u64,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_BNNavigationHandler() {
    assert_eq!(
        ::std::mem::size_of::<BNNavigationHandler>(),
        32usize,
        concat!("Size of: ", stringify!(BNNavigationHandler))
    );
    assert_eq!(
        ::std::mem::align_of::<BNNavigationHandler>(),
        8usize,
        concat!("Alignment of ", stringify!(BNNavigationHandler))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNNavigationHandler>())).context as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNavigationHandler),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNNavigationHandler>())).getCurrentView as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNavigationHandler),
            "::",
            stringify!(getCurrentView)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNNavigationHandler>())).getCurrentOffset as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNavigationHandler),
            "::",
            stringify!(getCurrentOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNNavigationHandler>())).navigate as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNavigationHandler),
            "::",
            stringify!(navigate)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNNameList {
    pub name: *mut *mut ::std::os::raw::c_char,
    pub join: *mut ::std::os::raw::c_char,
    pub nameCount: size_t,
}
#[test]
fn bindgen_test_layout_BNNameList() {
    assert_eq!(
        ::std::mem::size_of::<BNNameList>(),
        24usize,
        concat!("Size of: ", stringify!(BNNameList))
    );
    assert_eq!(
        ::std::mem::align_of::<BNNameList>(),
        8usize,
        concat!("Alignment of ", stringify!(BNNameList))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNNameList>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameList),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNNameList>())).join as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameList),
            "::",
            stringify!(join)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNNameList>())).nameCount as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameList),
            "::",
            stringify!(nameCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNNameSpace {
    pub name: *mut *mut ::std::os::raw::c_char,
    pub join: *mut ::std::os::raw::c_char,
    pub nameCount: size_t,
}
#[test]
fn bindgen_test_layout_BNNameSpace() {
    assert_eq!(
        ::std::mem::size_of::<BNNameSpace>(),
        24usize,
        concat!("Size of: ", stringify!(BNNameSpace))
    );
    assert_eq!(
        ::std::mem::align_of::<BNNameSpace>(),
        8usize,
        concat!("Alignment of ", stringify!(BNNameSpace))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNNameSpace>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameSpace),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNNameSpace>())).join as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameSpace),
            "::",
            stringify!(join)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNNameSpace>())).nameCount as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameSpace),
            "::",
            stringify!(nameCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNQualifiedName {
    pub name: *mut *mut ::std::os::raw::c_char,
    pub join: *mut ::std::os::raw::c_char,
    pub nameCount: size_t,
}
#[test]
fn bindgen_test_layout_BNQualifiedName() {
    assert_eq!(
        ::std::mem::size_of::<BNQualifiedName>(),
        24usize,
        concat!("Size of: ", stringify!(BNQualifiedName))
    );
    assert_eq!(
        ::std::mem::align_of::<BNQualifiedName>(),
        8usize,
        concat!("Alignment of ", stringify!(BNQualifiedName))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNQualifiedName>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNQualifiedName),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNQualifiedName>())).join as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNQualifiedName),
            "::",
            stringify!(join)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNQualifiedName>())).nameCount as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNQualifiedName),
            "::",
            stringify!(nameCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBinaryDataNotification {
    pub context: *mut ::std::os::raw::c_void,
    pub dataWritten: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            offset: u64,
            len: size_t,
        ),
    >,
    pub dataInserted: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            offset: u64,
            len: size_t,
        ),
    >,
    pub dataRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            offset: u64,
            len: u64,
        ),
    >,
    pub functionAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNFunction,
        ),
    >,
    pub functionRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNFunction,
        ),
    >,
    pub functionUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNFunction,
        ),
    >,
    pub functionUpdateRequested: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNFunction,
        ),
    >,
    pub dataVariableAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            var: *mut BNDataVariable,
        ),
    >,
    pub dataVariableRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            var: *mut BNDataVariable,
        ),
    >,
    pub dataVariableUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            var: *mut BNDataVariable,
        ),
    >,
    pub dataMetadataUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            offset: u64,
        ),
    >,
    pub tagTypeUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            tagType: *mut BNTagType,
        ),
    >,
    pub tagAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            tagRef: *mut BNTagReference,
        ),
    >,
    pub tagUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            tagRef: *mut BNTagReference,
        ),
    >,
    pub tagRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            tagRef: *mut BNTagReference,
        ),
    >,
    pub symbolAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            sym: *mut BNSymbol,
        ),
    >,
    pub symbolUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            sym: *mut BNSymbol,
        ),
    >,
    pub symbolRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            sym: *mut BNSymbol,
        ),
    >,
    pub stringFound: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            type_: BNStringType,
            offset: u64,
            len: size_t,
        ),
    >,
    pub stringRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            type_: BNStringType,
            offset: u64,
            len: size_t,
        ),
    >,
    pub typeDefined: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            name: *mut BNQualifiedName,
            type_: *mut BNType,
        ),
    >,
    pub typeUndefined: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            name: *mut BNQualifiedName,
            type_: *mut BNType,
        ),
    >,
}
#[test]
fn bindgen_test_layout_BNBinaryDataNotification() {
    assert_eq!(
        ::std::mem::size_of::<BNBinaryDataNotification>(),
        184usize,
        concat!("Size of: ", stringify!(BNBinaryDataNotification))
    );
    assert_eq!(
        ::std::mem::align_of::<BNBinaryDataNotification>(),
        8usize,
        concat!("Alignment of ", stringify!(BNBinaryDataNotification))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).context as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).dataWritten as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(dataWritten)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).dataInserted as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(dataInserted)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).dataRemoved as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(dataRemoved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).functionAdded as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(functionAdded)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).functionRemoved as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(functionRemoved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).functionUpdated as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(functionUpdated)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).functionUpdateRequested as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(functionUpdateRequested)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).dataVariableAdded as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(dataVariableAdded)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).dataVariableRemoved as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(dataVariableRemoved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).dataVariableUpdated as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(dataVariableUpdated)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).dataMetadataUpdated as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(dataMetadataUpdated)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).tagTypeUpdated as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(tagTypeUpdated)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).tagAdded as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(tagAdded)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).tagUpdated as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(tagUpdated)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).tagRemoved as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(tagRemoved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).symbolAdded as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(symbolAdded)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).symbolUpdated as *const _ as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(symbolUpdated)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).symbolRemoved as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(symbolRemoved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).stringFound as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(stringFound)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).stringRemoved as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(stringRemoved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).typeDefined as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(typeDefined)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNBinaryDataNotification>())).typeUndefined as *const _ as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(typeUndefined)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFileAccessor {
    pub context: *mut ::std::os::raw::c_void,
    pub getLength:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u64>,
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            dest: *mut ::std::os::raw::c_void,
            offset: u64,
            len: size_t,
        ) -> size_t,
    >,
    pub write: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            offset: u64,
            src: *const ::std::os::raw::c_void,
            len: size_t,
        ) -> size_t,
    >,
}
#[test]
fn bindgen_test_layout_BNFileAccessor() {
    assert_eq!(
        ::std::mem::size_of::<BNFileAccessor>(),
        32usize,
        concat!("Size of: ", stringify!(BNFileAccessor))
    );
    assert_eq!(
        ::std::mem::align_of::<BNFileAccessor>(),
        8usize,
        concat!("Alignment of ", stringify!(BNFileAccessor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNFileAccessor>())).context as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFileAccessor),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNFileAccessor>())).getLength as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFileAccessor),
            "::",
            stringify!(getLength)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNFileAccessor>())).read as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFileAccessor),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNFileAccessor>())).write as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFileAccessor),
            "::",
            stringify!(write)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomBinaryView {
    pub context: *mut ::std::os::raw::c_void,
    pub init:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub freeObject: ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub externalRefTaken:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub externalRefReleased:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            dest: *mut ::std::os::raw::c_void,
            offset: u64,
            len: size_t,
        ) -> size_t,
    >,
    pub write: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            offset: u64,
            src: *const ::std::os::raw::c_void,
            len: size_t,
        ) -> size_t,
    >,
    pub insert: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            offset: u64,
            src: *const ::std::os::raw::c_void,
            len: size_t,
        ) -> size_t,
    >,
    pub remove: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64, len: u64) -> size_t,
    >,
    pub getModification: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            offset: u64,
        ) -> BNModificationStatus,
    >,
    pub isValidOffset: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> bool,
    >,
    pub isOffsetReadable: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> bool,
    >,
    pub isOffsetWritable: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> bool,
    >,
    pub isOffsetExecutable: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> bool,
    >,
    pub isOffsetBackedByFile: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> bool,
    >,
    pub getNextValidOffset: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> u64,
    >,
    pub getStart:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u64>,
    pub getLength:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u64>,
    pub getEntryPoint:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u64>,
    pub isExecutable:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub getDefaultEndianness: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> BNEndianness,
    >,
    pub isRelocatable:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub getAddressSize:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> size_t>,
    pub save: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            accessor: *mut BNFileAccessor,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_BNCustomBinaryView() {
    assert_eq!(
        ::std::mem::size_of::<BNCustomBinaryView>(),
        192usize,
        concat!("Size of: ", stringify!(BNCustomBinaryView))
    );
    assert_eq!(
        ::std::mem::align_of::<BNCustomBinaryView>(),
        8usize,
        concat!("Alignment of ", stringify!(BNCustomBinaryView))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomBinaryView>())).context as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomBinaryView>())).init as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomBinaryView>())).freeObject as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(freeObject)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomBinaryView>())).externalRefTaken as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(externalRefTaken)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomBinaryView>())).externalRefReleased as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(externalRefReleased)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomBinaryView>())).read as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomBinaryView>())).write as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomBinaryView>())).insert as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(insert)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomBinaryView>())).remove as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(remove)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomBinaryView>())).getModification as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(getModification)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomBinaryView>())).isValidOffset as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(isValidOffset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomBinaryView>())).isOffsetReadable as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(isOffsetReadable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomBinaryView>())).isOffsetWritable as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(isOffsetWritable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomBinaryView>())).isOffsetExecutable as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(isOffsetExecutable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomBinaryView>())).isOffsetBackedByFile as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(isOffsetBackedByFile)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomBinaryView>())).getNextValidOffset as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(getNextValidOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomBinaryView>())).getStart as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(getStart)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomBinaryView>())).getLength as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(getLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomBinaryView>())).getEntryPoint as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(getEntryPoint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomBinaryView>())).isExecutable as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(isExecutable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomBinaryView>())).getDefaultEndianness as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(getDefaultEndianness)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomBinaryView>())).isRelocatable as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(isRelocatable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomBinaryView>())).getAddressSize as *const _ as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(getAddressSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomBinaryView>())).save as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(save)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomBinaryViewType {
    pub context: *mut ::std::os::raw::c_void,
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
        ) -> *mut BNBinaryView,
    >,
    pub parse: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
        ) -> *mut BNBinaryView,
    >,
    pub isValidForData: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, data: *mut BNBinaryView) -> bool,
    >,
    pub getLoadSettingsForData: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
        ) -> *mut BNSettings,
    >,
}
#[test]
fn bindgen_test_layout_BNCustomBinaryViewType() {
    assert_eq!(
        ::std::mem::size_of::<BNCustomBinaryViewType>(),
        40usize,
        concat!("Size of: ", stringify!(BNCustomBinaryViewType))
    );
    assert_eq!(
        ::std::mem::align_of::<BNCustomBinaryViewType>(),
        8usize,
        concat!("Alignment of ", stringify!(BNCustomBinaryViewType))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomBinaryViewType>())).context as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryViewType),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomBinaryViewType>())).create as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryViewType),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomBinaryViewType>())).parse as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryViewType),
            "::",
            stringify!(parse)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomBinaryViewType>())).isValidForData as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryViewType),
            "::",
            stringify!(isValidForData)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomBinaryViewType>())).getLoadSettingsForData as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryViewType),
            "::",
            stringify!(getLoadSettingsForData)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTransformParameterInfo {
    pub name: *mut ::std::os::raw::c_char,
    pub longName: *mut ::std::os::raw::c_char,
    pub fixedLength: size_t,
}
#[test]
fn bindgen_test_layout_BNTransformParameterInfo() {
    assert_eq!(
        ::std::mem::size_of::<BNTransformParameterInfo>(),
        24usize,
        concat!("Size of: ", stringify!(BNTransformParameterInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<BNTransformParameterInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(BNTransformParameterInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNTransformParameterInfo>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTransformParameterInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNTransformParameterInfo>())).longName as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTransformParameterInfo),
            "::",
            stringify!(longName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNTransformParameterInfo>())).fixedLength as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTransformParameterInfo),
            "::",
            stringify!(fixedLength)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTransformParameter {
    pub name: *const ::std::os::raw::c_char,
    pub value: *mut BNDataBuffer,
}
#[test]
fn bindgen_test_layout_BNTransformParameter() {
    assert_eq!(
        ::std::mem::size_of::<BNTransformParameter>(),
        16usize,
        concat!("Size of: ", stringify!(BNTransformParameter))
    );
    assert_eq!(
        ::std::mem::align_of::<BNTransformParameter>(),
        8usize,
        concat!("Alignment of ", stringify!(BNTransformParameter))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNTransformParameter>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTransformParameter),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNTransformParameter>())).value as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTransformParameter),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomTransform {
    pub context: *mut ::std::os::raw::c_void,
    pub getParameters: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            count: *mut size_t,
        ) -> *mut BNTransformParameterInfo,
    >,
    pub freeParameters: ::std::option::Option<
        unsafe extern "C" fn(params: *mut BNTransformParameterInfo, count: size_t),
    >,
    pub decode: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            input: *mut BNDataBuffer,
            output: *mut BNDataBuffer,
            params: *mut BNTransformParameter,
            paramCount: size_t,
        ) -> bool,
    >,
    pub encode: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            input: *mut BNDataBuffer,
            output: *mut BNDataBuffer,
            params: *mut BNTransformParameter,
            paramCount: size_t,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_BNCustomTransform() {
    assert_eq!(
        ::std::mem::size_of::<BNCustomTransform>(),
        40usize,
        concat!("Size of: ", stringify!(BNCustomTransform))
    );
    assert_eq!(
        ::std::mem::align_of::<BNCustomTransform>(),
        8usize,
        concat!("Alignment of ", stringify!(BNCustomTransform))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomTransform>())).context as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomTransform),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomTransform>())).getParameters as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomTransform),
            "::",
            stringify!(getParameters)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomTransform>())).freeParameters as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomTransform),
            "::",
            stringify!(freeParameters)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomTransform>())).decode as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomTransform),
            "::",
            stringify!(decode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomTransform>())).encode as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomTransform),
            "::",
            stringify!(encode)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNInstructionInfo {
    pub length: size_t,
    pub branchCount: size_t,
    pub archTransitionByTargetAddr: bool,
    pub branchDelay: bool,
    pub branchType: [BNBranchType; 3usize],
    pub branchTarget: [u64; 3usize],
    pub branchArch: [*mut BNArchitecture; 3usize],
}
#[test]
fn bindgen_test_layout_BNInstructionInfo() {
    assert_eq!(
        ::std::mem::size_of::<BNInstructionInfo>(),
        80usize,
        concat!("Size of: ", stringify!(BNInstructionInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<BNInstructionInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(BNInstructionInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionInfo>())).length as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionInfo),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionInfo>())).branchCount as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionInfo),
            "::",
            stringify!(branchCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNInstructionInfo>())).archTransitionByTargetAddr as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionInfo),
            "::",
            stringify!(archTransitionByTargetAddr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionInfo>())).branchDelay as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionInfo),
            "::",
            stringify!(branchDelay)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionInfo>())).branchType as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionInfo),
            "::",
            stringify!(branchType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionInfo>())).branchTarget as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionInfo),
            "::",
            stringify!(branchTarget)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionInfo>())).branchArch as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionInfo),
            "::",
            stringify!(branchArch)
        )
    );
}
pub const BNRelocationType_ELFGlobalRelocationType: BNRelocationType = 0;
pub const BNRelocationType_ELFCopyRelocationType: BNRelocationType = 1;
pub const BNRelocationType_ELFJumpSlotRelocationType: BNRelocationType = 2;
pub const BNRelocationType_StandardRelocationType: BNRelocationType = 3;
pub const BNRelocationType_IgnoredRelocation: BNRelocationType = 4;
pub const BNRelocationType_UnhandledRelocation: BNRelocationType = 5;
pub type BNRelocationType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRelocationInfo {
    pub type_: BNRelocationType,
    pub pcRelative: bool,
    pub baseRelative: bool,
    pub base: u64,
    pub size: size_t,
    pub truncateSize: size_t,
    pub nativeType: u64,
    pub addend: size_t,
    pub hasSign: bool,
    pub implicitAddend: bool,
    pub external: bool,
    pub symbolIndex: size_t,
    pub sectionIndex: size_t,
    pub address: u64,
    pub target: u64,
    pub dataRelocation: bool,
    pub relocationDataCache: [u8; 8usize],
    pub prev: *mut BNRelocationInfo,
    pub next: *mut BNRelocationInfo,
}
#[test]
fn bindgen_test_layout_BNRelocationInfo() {
    assert_eq!(
        ::std::mem::size_of::<BNRelocationInfo>(),
        120usize,
        concat!("Size of: ", stringify!(BNRelocationInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<BNRelocationInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(BNRelocationInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).pcRelative as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(pcRelative)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).baseRelative as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(baseRelative)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).base as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).truncateSize as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(truncateSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).nativeType as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(nativeType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).addend as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(addend)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).hasSign as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(hasSign)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).implicitAddend as *const _ as usize },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(implicitAddend)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).external as *const _ as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(external)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).symbolIndex as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(symbolIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).sectionIndex as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(sectionIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).address as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).target as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(target)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).dataRelocation as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(dataRelocation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNRelocationInfo>())).relocationDataCache as *const _ as usize
        },
        89usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(relocationDataCache)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).prev as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNRelocationInfo>())).next as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNInstructionTextToken {
    pub type_: BNInstructionTextTokenType,
    pub text: *mut ::std::os::raw::c_char,
    pub value: u64,
    pub width: u64,
    pub size: size_t,
    pub operand: size_t,
    pub context: BNInstructionTextTokenContext,
    pub confidence: u8,
    pub address: u64,
    pub typeNames: *mut *mut ::std::os::raw::c_char,
    pub namesCount: size_t,
}
#[test]
fn bindgen_test_layout_BNInstructionTextToken() {
    assert_eq!(
        ::std::mem::size_of::<BNInstructionTextToken>(),
        80usize,
        concat!("Size of: ", stringify!(BNInstructionTextToken))
    );
    assert_eq!(
        ::std::mem::align_of::<BNInstructionTextToken>(),
        8usize,
        concat!("Alignment of ", stringify!(BNInstructionTextToken))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionTextToken>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionTextToken>())).text as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(text)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionTextToken>())).value as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionTextToken>())).width as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionTextToken>())).size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionTextToken>())).operand as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(operand)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionTextToken>())).context as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNInstructionTextToken>())).confidence as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(confidence)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionTextToken>())).address as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNInstructionTextToken>())).typeNames as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(typeNames)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNInstructionTextToken>())).namesCount as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(namesCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNInstructionTextLine {
    pub tokens: *mut BNInstructionTextToken,
    pub count: size_t,
}
#[test]
fn bindgen_test_layout_BNInstructionTextLine() {
    assert_eq!(
        ::std::mem::size_of::<BNInstructionTextLine>(),
        16usize,
        concat!("Size of: ", stringify!(BNInstructionTextLine))
    );
    assert_eq!(
        ::std::mem::align_of::<BNInstructionTextLine>(),
        8usize,
        concat!("Alignment of ", stringify!(BNInstructionTextLine))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionTextLine>())).tokens as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextLine),
            "::",
            stringify!(tokens)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNInstructionTextLine>())).count as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextLine),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFlagConditionForSemanticClass {
    pub semanticClass: u32,
    pub condition: BNLowLevelILFlagCondition,
}
#[test]
fn bindgen_test_layout_BNFlagConditionForSemanticClass() {
    assert_eq!(
        ::std::mem::size_of::<BNFlagConditionForSemanticClass>(),
        8usize,
        concat!("Size of: ", stringify!(BNFlagConditionForSemanticClass))
    );
    assert_eq!(
        ::std::mem::align_of::<BNFlagConditionForSemanticClass>(),
        4usize,
        concat!("Alignment of ", stringify!(BNFlagConditionForSemanticClass))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNFlagConditionForSemanticClass>())).semanticClass as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlagConditionForSemanticClass),
            "::",
            stringify!(semanticClass)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNFlagConditionForSemanticClass>())).condition as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlagConditionForSemanticClass),
            "::",
            stringify!(condition)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNNameAndType {
    pub name: *mut ::std::os::raw::c_char,
    pub type_: *mut BNType,
    pub typeConfidence: u8,
}
#[test]
fn bindgen_test_layout_BNNameAndType() {
    assert_eq!(
        ::std::mem::size_of::<BNNameAndType>(),
        24usize,
        concat!("Size of: ", stringify!(BNNameAndType))
    );
    assert_eq!(
        ::std::mem::align_of::<BNNameAndType>(),
        8usize,
        concat!("Alignment of ", stringify!(BNNameAndType))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNNameAndType>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameAndType),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNNameAndType>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameAndType),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNNameAndType>())).typeConfidence as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameAndType),
            "::",
            stringify!(typeConfidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeWithConfidence {
    pub type_: *mut BNType,
    pub confidence: u8,
}
#[test]
fn bindgen_test_layout_BNTypeWithConfidence() {
    assert_eq!(
        ::std::mem::size_of::<BNTypeWithConfidence>(),
        16usize,
        concat!("Size of: ", stringify!(BNTypeWithConfidence))
    );
    assert_eq!(
        ::std::mem::align_of::<BNTypeWithConfidence>(),
        8usize,
        concat!("Alignment of ", stringify!(BNTypeWithConfidence))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNTypeWithConfidence>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTypeWithConfidence),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNTypeWithConfidence>())).confidence as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTypeWithConfidence),
            "::",
            stringify!(confidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomArchitecture {
    pub context: *mut ::std::os::raw::c_void,
    pub init: ::std::option::Option<
        unsafe extern "C" fn(context: *mut ::std::os::raw::c_void, obj: *mut BNArchitecture),
    >,
    pub getEndianness: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> BNEndianness,
    >,
    pub getAddressSize:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> size_t>,
    pub getDefaultIntegerSize:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> size_t>,
    pub getInstructionAlignment:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> size_t>,
    pub getMaxInstructionLength:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> size_t>,
    pub getOpcodeDisplayLength:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> size_t>,
    pub getAssociatedArchitectureByAddress: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            addr: *mut u64,
        ) -> *mut BNArchitecture,
    >,
    pub getInstructionInfo: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            maxLen: size_t,
            result: *mut BNInstructionInfo,
        ) -> bool,
    >,
    pub getInstructionText: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: *mut size_t,
            result: *mut *mut BNInstructionTextToken,
            count: *mut size_t,
        ) -> bool,
    >,
    pub freeInstructionText: ::std::option::Option<
        unsafe extern "C" fn(tokens: *mut BNInstructionTextToken, count: size_t),
    >,
    pub getInstructionLowLevelIL: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: *mut size_t,
            il: *mut BNLowLevelILFunction,
        ) -> bool,
    >,
    pub getRegisterName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            reg: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getFlagName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            flag: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getFlagWriteTypeName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            flags: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getSemanticFlagClassName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            semClass: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getSemanticFlagGroupName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            semGroup: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getFullWidthRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut size_t) -> *mut u32,
    >,
    pub getAllRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut size_t) -> *mut u32,
    >,
    pub getAllFlags: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut size_t) -> *mut u32,
    >,
    pub getAllFlagWriteTypes: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut size_t) -> *mut u32,
    >,
    pub getAllSemanticFlagClasses: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut size_t) -> *mut u32,
    >,
    pub getAllSemanticFlagGroups: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut size_t) -> *mut u32,
    >,
    pub getFlagRole: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            flag: u32,
            semClass: u32,
        ) -> BNFlagRole,
    >,
    pub getFlagsRequiredForFlagCondition: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            cond: BNLowLevelILFlagCondition,
            semClass: u32,
            count: *mut size_t,
        ) -> *mut u32,
    >,
    pub getFlagsRequiredForSemanticFlagGroup: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            semGroup: u32,
            count: *mut size_t,
        ) -> *mut u32,
    >,
    pub getFlagConditionsForSemanticFlagGroup: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            semGroup: u32,
            count: *mut size_t,
        ) -> *mut BNFlagConditionForSemanticClass,
    >,
    pub freeFlagConditionsForSemanticFlagGroup: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            conditions: *mut BNFlagConditionForSemanticClass,
        ),
    >,
    pub getFlagsWrittenByFlagWriteType: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            writeType: u32,
            count: *mut size_t,
        ) -> *mut u32,
    >,
    pub getSemanticClassForFlagWriteType: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, writeType: u32) -> u32,
    >,
    pub getFlagWriteLowLevelIL: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            op: BNLowLevelILOperation,
            size: size_t,
            flagWriteType: u32,
            flag: u32,
            operands: *mut BNRegisterOrConstant,
            operandCount: size_t,
            il: *mut BNLowLevelILFunction,
        ) -> size_t,
    >,
    pub getFlagConditionLowLevelIL: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            cond: BNLowLevelILFlagCondition,
            semClass: u32,
            il: *mut BNLowLevelILFunction,
        ) -> size_t,
    >,
    pub getSemanticFlagGroupLowLevelIL: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            semGroup: u32,
            il: *mut BNLowLevelILFunction,
        ) -> size_t,
    >,
    pub freeRegisterList: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, regs: *mut u32),
    >,
    pub getRegisterInfo: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            reg: u32,
            result: *mut BNRegisterInfo,
        ),
    >,
    pub getStackPointerRegister:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u32>,
    pub getLinkRegister:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u32>,
    pub getGlobalRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut size_t) -> *mut u32,
    >,
    pub getSystemRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut size_t) -> *mut u32,
    >,
    pub getRegisterStackName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            regStack: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getAllRegisterStacks: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut size_t) -> *mut u32,
    >,
    pub getRegisterStackInfo: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            regStack: u32,
            result: *mut BNRegisterStackInfo,
        ),
    >,
    pub getIntrinsicName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            intrinsic: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getAllIntrinsics: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut size_t) -> *mut u32,
    >,
    pub getIntrinsicInputs: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            intrinsic: u32,
            count: *mut size_t,
        ) -> *mut BNNameAndType,
    >,
    pub freeNameAndTypeList: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            nt: *mut BNNameAndType,
            count: size_t,
        ),
    >,
    pub getIntrinsicOutputs: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            intrinsic: u32,
            count: *mut size_t,
        ) -> *mut BNTypeWithConfidence,
    >,
    pub freeTypeList: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            types: *mut BNTypeWithConfidence,
            count: size_t,
        ),
    >,
    pub canAssemble:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub assemble: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            code: *const ::std::os::raw::c_char,
            addr: u64,
            result: *mut BNDataBuffer,
            errors: *mut *mut ::std::os::raw::c_char,
        ) -> bool,
    >,
    pub isNeverBranchPatchAvailable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: size_t,
        ) -> bool,
    >,
    pub isAlwaysBranchPatchAvailable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: size_t,
        ) -> bool,
    >,
    pub isInvertBranchPatchAvailable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: size_t,
        ) -> bool,
    >,
    pub isSkipAndReturnZeroPatchAvailable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: size_t,
        ) -> bool,
    >,
    pub isSkipAndReturnValuePatchAvailable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: size_t,
        ) -> bool,
    >,
    pub convertToNop: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut u8,
            addr: u64,
            len: size_t,
        ) -> bool,
    >,
    pub alwaysBranch: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut u8,
            addr: u64,
            len: size_t,
        ) -> bool,
    >,
    pub invertBranch: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut u8,
            addr: u64,
            len: size_t,
        ) -> bool,
    >,
    pub skipAndReturnValue: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut u8,
            addr: u64,
            len: size_t,
            value: u64,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_BNCustomArchitecture() {
    assert_eq!(
        ::std::mem::size_of::<BNCustomArchitecture>(),
        480usize,
        concat!("Size of: ", stringify!(BNCustomArchitecture))
    );
    assert_eq!(
        ::std::mem::align_of::<BNCustomArchitecture>(),
        8usize,
        concat!("Alignment of ", stringify!(BNCustomArchitecture))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomArchitecture>())).context as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomArchitecture>())).init as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getEndianness as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getEndianness)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getAddressSize as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAddressSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getDefaultIntegerSize as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getDefaultIntegerSize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getInstructionAlignment as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getInstructionAlignment)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getMaxInstructionLength as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getMaxInstructionLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getOpcodeDisplayLength as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getOpcodeDisplayLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getAssociatedArchitectureByAddress
                as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAssociatedArchitectureByAddress)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getInstructionInfo as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getInstructionInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getInstructionText as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getInstructionText)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).freeInstructionText as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(freeInstructionText)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getInstructionLowLevelIL as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getInstructionLowLevelIL)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getRegisterName as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getRegisterName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getFlagName as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getFlagWriteTypeName as *const _
                as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagWriteTypeName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getSemanticFlagClassName as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getSemanticFlagClassName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getSemanticFlagGroupName as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getSemanticFlagGroupName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getFullWidthRegisters as *const _
                as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFullWidthRegisters)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getAllRegisters as *const _ as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAllRegisters)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getAllFlags as *const _ as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAllFlags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getAllFlagWriteTypes as *const _
                as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAllFlagWriteTypes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getAllSemanticFlagClasses as *const _
                as usize
        },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAllSemanticFlagClasses)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getAllSemanticFlagGroups as *const _
                as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAllSemanticFlagGroups)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getFlagRole as *const _ as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagRole)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getFlagsRequiredForFlagCondition
                as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagsRequiredForFlagCondition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getFlagsRequiredForSemanticFlagGroup
                as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagsRequiredForSemanticFlagGroup)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getFlagConditionsForSemanticFlagGroup
                as *const _ as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagConditionsForSemanticFlagGroup)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).freeFlagConditionsForSemanticFlagGroup
                as *const _ as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(freeFlagConditionsForSemanticFlagGroup)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getFlagsWrittenByFlagWriteType
                as *const _ as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagsWrittenByFlagWriteType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getSemanticClassForFlagWriteType
                as *const _ as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getSemanticClassForFlagWriteType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getFlagWriteLowLevelIL as *const _
                as usize
        },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagWriteLowLevelIL)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getFlagConditionLowLevelIL as *const _
                as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagConditionLowLevelIL)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getSemanticFlagGroupLowLevelIL
                as *const _ as usize
        },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getSemanticFlagGroupLowLevelIL)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).freeRegisterList as *const _ as usize
        },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(freeRegisterList)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getRegisterInfo as *const _ as usize
        },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getRegisterInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getStackPointerRegister as *const _
                as usize
        },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getStackPointerRegister)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getLinkRegister as *const _ as usize
        },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getLinkRegister)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getGlobalRegisters as *const _ as usize
        },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getGlobalRegisters)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getSystemRegisters as *const _ as usize
        },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getSystemRegisters)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getRegisterStackName as *const _
                as usize
        },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getRegisterStackName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getAllRegisterStacks as *const _
                as usize
        },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAllRegisterStacks)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getRegisterStackInfo as *const _
                as usize
        },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getRegisterStackInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getIntrinsicName as *const _ as usize
        },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getIntrinsicName)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getAllIntrinsics as *const _ as usize
        },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAllIntrinsics)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getIntrinsicInputs as *const _ as usize
        },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getIntrinsicInputs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).freeNameAndTypeList as *const _
                as usize
        },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(freeNameAndTypeList)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).getIntrinsicOutputs as *const _
                as usize
        },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getIntrinsicOutputs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).freeTypeList as *const _ as usize
        },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(freeTypeList)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).canAssemble as *const _ as usize
        },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(canAssemble)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNCustomArchitecture>())).assemble as *const _ as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(assemble)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).isNeverBranchPatchAvailable as *const _
                as usize
        },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(isNeverBranchPatchAvailable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).isAlwaysBranchPatchAvailable
                as *const _ as usize
        },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(isAlwaysBranchPatchAvailable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).isInvertBranchPatchAvailable
                as *const _ as usize
        },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(isInvertBranchPatchAvailable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).isSkipAndReturnZeroPatchAvailable
                as *const _ as usize
        },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(isSkipAndReturnZeroPatchAvailable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).isSkipAndReturnValuePatchAvailable
                as *const _ as usize
        },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(isSkipAndReturnValuePatchAvailable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).convertToNop as *const _ as usize
        },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(convertToNop)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).alwaysBranch as *const _ as usize
        },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(alwaysBranch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).invertBranch as *const _ as usize
        },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(invertBranch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCustomArchitecture>())).skipAndReturnValue as *const _ as usize
        },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(skipAndReturnValue)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBasicBlockEdge {
    pub type_: BNBranchType,
    pub target: *mut BNBasicBlock,
    pub backEdge: bool,
    pub fallThrough: bool,
}
#[test]
fn bindgen_test_layout_BNBasicBlockEdge() {
    assert_eq!(
        ::std::mem::size_of::<BNBasicBlockEdge>(),
        24usize,
        concat!("Size of: ", stringify!(BNBasicBlockEdge))
    );
    assert_eq!(
        ::std::mem::align_of::<BNBasicBlockEdge>(),
        8usize,
        concat!("Alignment of ", stringify!(BNBasicBlockEdge))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNBasicBlockEdge>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBasicBlockEdge),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNBasicBlockEdge>())).target as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBasicBlockEdge),
            "::",
            stringify!(target)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNBasicBlockEdge>())).backEdge as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBasicBlockEdge),
            "::",
            stringify!(backEdge)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNBasicBlockEdge>())).fallThrough as *const _ as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBasicBlockEdge),
            "::",
            stringify!(fallThrough)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNPoint {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_BNPoint() {
    assert_eq!(
        ::std::mem::size_of::<BNPoint>(),
        8usize,
        concat!("Size of: ", stringify!(BNPoint))
    );
    assert_eq!(
        ::std::mem::align_of::<BNPoint>(),
        4usize,
        concat!("Alignment of ", stringify!(BNPoint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNPoint>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPoint),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNPoint>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPoint),
            "::",
            stringify!(y)
        )
    );
}
pub const BNThemeColor_AddressColor: BNThemeColor = 0;
pub const BNThemeColor_ModifiedColor: BNThemeColor = 1;
pub const BNThemeColor_InsertedColor: BNThemeColor = 2;
pub const BNThemeColor_NotPresentColor: BNThemeColor = 3;
pub const BNThemeColor_SelectionColor: BNThemeColor = 4;
pub const BNThemeColor_OutlineColor: BNThemeColor = 5;
pub const BNThemeColor_BackgroundHighlightDarkColor: BNThemeColor = 6;
pub const BNThemeColor_BackgroundHighlightLightColor: BNThemeColor = 7;
pub const BNThemeColor_BoldBackgroundHighlightDarkColor: BNThemeColor = 8;
pub const BNThemeColor_BoldBackgroundHighlightLightColor: BNThemeColor = 9;
pub const BNThemeColor_AlphanumericHighlightColor: BNThemeColor = 10;
pub const BNThemeColor_PrintableHighlightColor: BNThemeColor = 11;
pub const BNThemeColor_GraphBackgroundDarkColor: BNThemeColor = 12;
pub const BNThemeColor_GraphBackgroundLightColor: BNThemeColor = 13;
pub const BNThemeColor_GraphNodeDarkColor: BNThemeColor = 14;
pub const BNThemeColor_GraphNodeLightColor: BNThemeColor = 15;
pub const BNThemeColor_GraphNodeOutlineColor: BNThemeColor = 16;
pub const BNThemeColor_TrueBranchColor: BNThemeColor = 17;
pub const BNThemeColor_FalseBranchColor: BNThemeColor = 18;
pub const BNThemeColor_UnconditionalBranchColor: BNThemeColor = 19;
pub const BNThemeColor_AltTrueBranchColor: BNThemeColor = 20;
pub const BNThemeColor_AltFalseBranchColor: BNThemeColor = 21;
pub const BNThemeColor_AltUnconditionalBranchColor: BNThemeColor = 22;
pub const BNThemeColor_RegisterColor: BNThemeColor = 23;
pub const BNThemeColor_NumberColor: BNThemeColor = 24;
pub const BNThemeColor_CodeSymbolColor: BNThemeColor = 25;
pub const BNThemeColor_DataSymbolColor: BNThemeColor = 26;
pub const BNThemeColor_StackVariableColor: BNThemeColor = 27;
pub const BNThemeColor_ImportColor: BNThemeColor = 28;
pub const BNThemeColor_InstructionHighlightColor: BNThemeColor = 29;
pub const BNThemeColor_TokenHighlightColor: BNThemeColor = 30;
pub const BNThemeColor_TokenSelectionColor: BNThemeColor = 31;
pub const BNThemeColor_AnnotationColor: BNThemeColor = 32;
pub const BNThemeColor_OpcodeColor: BNThemeColor = 33;
pub const BNThemeColor_LinearDisassemblyFunctionHeaderColor: BNThemeColor = 34;
pub const BNThemeColor_LinearDisassemblyBlockColor: BNThemeColor = 35;
pub const BNThemeColor_LinearDisassemblyNoteColor: BNThemeColor = 36;
pub const BNThemeColor_LinearDisassemblySeparatorColor: BNThemeColor = 37;
pub const BNThemeColor_StringColor: BNThemeColor = 38;
pub const BNThemeColor_TypeNameColor: BNThemeColor = 39;
pub const BNThemeColor_FieldNameColor: BNThemeColor = 40;
pub const BNThemeColor_KeywordColor: BNThemeColor = 41;
pub const BNThemeColor_UncertainColor: BNThemeColor = 42;
pub const BNThemeColor_NameSpaceColor: BNThemeColor = 43;
pub const BNThemeColor_NameSpaceSeparatorColor: BNThemeColor = 44;
pub const BNThemeColor_GotoLabelColor: BNThemeColor = 45;
pub const BNThemeColor_CommentColor: BNThemeColor = 46;
pub const BNThemeColor_ScriptConsoleOutputColor: BNThemeColor = 47;
pub const BNThemeColor_ScriptConsoleErrorColor: BNThemeColor = 48;
pub const BNThemeColor_ScriptConsoleEchoColor: BNThemeColor = 49;
pub const BNThemeColor_BlueStandardHighlightColor: BNThemeColor = 50;
pub const BNThemeColor_GreenStandardHighlightColor: BNThemeColor = 51;
pub const BNThemeColor_CyanStandardHighlightColor: BNThemeColor = 52;
pub const BNThemeColor_RedStandardHighlightColor: BNThemeColor = 53;
pub const BNThemeColor_MagentaStandardHighlightColor: BNThemeColor = 54;
pub const BNThemeColor_YellowStandardHighlightColor: BNThemeColor = 55;
pub const BNThemeColor_OrangeStandardHighlightColor: BNThemeColor = 56;
pub const BNThemeColor_WhiteStandardHighlightColor: BNThemeColor = 57;
pub const BNThemeColor_BlackStandardHighlightColor: BNThemeColor = 58;
pub const BNThemeColor_MiniGraphOverlayColor: BNThemeColor = 59;
pub const BNThemeColor_FeatureMapBaseColor: BNThemeColor = 60;
pub const BNThemeColor_FeatureMapNavLineColor: BNThemeColor = 61;
pub const BNThemeColor_FeatureMapNavHighlightColor: BNThemeColor = 62;
pub const BNThemeColor_FeatureMapDataVariableColor: BNThemeColor = 63;
pub const BNThemeColor_FeatureMapAsciiStringColor: BNThemeColor = 64;
pub const BNThemeColor_FeatureMapUnicodeStringColor: BNThemeColor = 65;
pub const BNThemeColor_FeatureMapFunctionColor: BNThemeColor = 66;
pub const BNThemeColor_FeatureMapImportColor: BNThemeColor = 67;
pub const BNThemeColor_FeatureMapExternColor: BNThemeColor = 68;
pub const BNThemeColor_FeatureMapLibraryColor: BNThemeColor = 69;
pub type BNThemeColor = ::std::os::raw::c_uint;
pub const BNEdgePenStyle_NoPen: BNEdgePenStyle = 0;
pub const BNEdgePenStyle_SolidLine: BNEdgePenStyle = 1;
pub const BNEdgePenStyle_DashLine: BNEdgePenStyle = 2;
pub const BNEdgePenStyle_DotLine: BNEdgePenStyle = 3;
pub const BNEdgePenStyle_DashDotLine: BNEdgePenStyle = 4;
pub const BNEdgePenStyle_DashDotDotLine: BNEdgePenStyle = 5;
pub type BNEdgePenStyle = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNEdgeStyle {
    pub style: BNEdgePenStyle,
    pub width: size_t,
    pub color: BNThemeColor,
}
#[test]
fn bindgen_test_layout_BNEdgeStyle() {
    assert_eq!(
        ::std::mem::size_of::<BNEdgeStyle>(),
        24usize,
        concat!("Size of: ", stringify!(BNEdgeStyle))
    );
    assert_eq!(
        ::std::mem::align_of::<BNEdgeStyle>(),
        8usize,
        concat!("Alignment of ", stringify!(BNEdgeStyle))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNEdgeStyle>())).style as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNEdgeStyle),
            "::",
            stringify!(style)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNEdgeStyle>())).width as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNEdgeStyle),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNEdgeStyle>())).color as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNEdgeStyle),
            "::",
            stringify!(color)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFlowGraphEdge {
    pub type_: BNBranchType,
    pub target: *mut BNFlowGraphNode,
    pub points: *mut BNPoint,
    pub pointCount: size_t,
    pub backEdge: bool,
    pub style: BNEdgeStyle,
}
#[test]
fn bindgen_test_layout_BNFlowGraphEdge() {
    assert_eq!(
        ::std::mem::size_of::<BNFlowGraphEdge>(),
        64usize,
        concat!("Size of: ", stringify!(BNFlowGraphEdge))
    );
    assert_eq!(
        ::std::mem::align_of::<BNFlowGraphEdge>(),
        8usize,
        concat!("Alignment of ", stringify!(BNFlowGraphEdge))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNFlowGraphEdge>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlowGraphEdge),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNFlowGraphEdge>())).target as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlowGraphEdge),
            "::",
            stringify!(target)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNFlowGraphEdge>())).points as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlowGraphEdge),
            "::",
            stringify!(points)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNFlowGraphEdge>())).pointCount as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlowGraphEdge),
            "::",
            stringify!(pointCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNFlowGraphEdge>())).backEdge as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlowGraphEdge),
            "::",
            stringify!(backEdge)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNFlowGraphEdge>())).style as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlowGraphEdge),
            "::",
            stringify!(style)
        )
    );
}
pub const BNHighlightColorStyle_StandardHighlightColor: BNHighlightColorStyle = 0;
pub const BNHighlightColorStyle_MixedHighlightColor: BNHighlightColorStyle = 1;
pub const BNHighlightColorStyle_CustomHighlightColor: BNHighlightColorStyle = 2;
pub type BNHighlightColorStyle = ::std::os::raw::c_uint;
pub const BNHighlightStandardColor_NoHighlightColor: BNHighlightStandardColor = 0;
pub const BNHighlightStandardColor_BlueHighlightColor: BNHighlightStandardColor = 1;
pub const BNHighlightStandardColor_GreenHighlightColor: BNHighlightStandardColor = 2;
pub const BNHighlightStandardColor_CyanHighlightColor: BNHighlightStandardColor = 3;
pub const BNHighlightStandardColor_RedHighlightColor: BNHighlightStandardColor = 4;
pub const BNHighlightStandardColor_MagentaHighlightColor: BNHighlightStandardColor = 5;
pub const BNHighlightStandardColor_YellowHighlightColor: BNHighlightStandardColor = 6;
pub const BNHighlightStandardColor_OrangeHighlightColor: BNHighlightStandardColor = 7;
pub const BNHighlightStandardColor_WhiteHighlightColor: BNHighlightStandardColor = 8;
pub const BNHighlightStandardColor_BlackHighlightColor: BNHighlightStandardColor = 9;
pub type BNHighlightStandardColor = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNHighlightColor {
    pub style: BNHighlightColorStyle,
    pub color: BNHighlightStandardColor,
    pub mixColor: BNHighlightStandardColor,
    pub mix: u8,
    pub r: u8,
    pub g: u8,
    pub b: u8,
    pub alpha: u8,
}
#[test]
fn bindgen_test_layout_BNHighlightColor() {
    assert_eq!(
        ::std::mem::size_of::<BNHighlightColor>(),
        20usize,
        concat!("Size of: ", stringify!(BNHighlightColor))
    );
    assert_eq!(
        ::std::mem::align_of::<BNHighlightColor>(),
        4usize,
        concat!("Alignment of ", stringify!(BNHighlightColor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNHighlightColor>())).style as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighlightColor),
            "::",
            stringify!(style)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNHighlightColor>())).color as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighlightColor),
            "::",
            stringify!(color)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNHighlightColor>())).mixColor as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighlightColor),
            "::",
            stringify!(mixColor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNHighlightColor>())).mix as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighlightColor),
            "::",
            stringify!(mix)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNHighlightColor>())).r as *const _ as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighlightColor),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNHighlightColor>())).g as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighlightColor),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNHighlightColor>())).b as *const _ as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighlightColor),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNHighlightColor>())).alpha as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighlightColor),
            "::",
            stringify!(alpha)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDisassemblyTextLineTypeInfo {
    pub hasTypeInfo: bool,
    pub parentType: *mut BNType,
    pub fieldIndex: size_t,
}
#[test]
fn bindgen_test_layout_BNDisassemblyTextLineTypeInfo() {
    assert_eq!(
        ::std::mem::size_of::<BNDisassemblyTextLineTypeInfo>(),
        24usize,
        concat!("Size of: ", stringify!(BNDisassemblyTextLineTypeInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<BNDisassemblyTextLineTypeInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(BNDisassemblyTextLineTypeInfo))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNDisassemblyTextLineTypeInfo>())).hasTypeInfo as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDisassemblyTextLineTypeInfo),
            "::",
            stringify!(hasTypeInfo)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNDisassemblyTextLineTypeInfo>())).parentType as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDisassemblyTextLineTypeInfo),
            "::",
            stringify!(parentType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNDisassemblyTextLineTypeInfo>())).fieldIndex as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDisassemblyTextLineTypeInfo),
            "::",
            stringify!(fieldIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDisassemblyTextLine {
    pub addr: u64,
    pub instrIndex: size_t,
    pub tokens: *mut BNInstructionTextToken,
    pub count: size_t,
    pub highlight: BNHighlightColor,
    pub tags: *mut *mut BNTag,
    pub tagCount: size_t,
    pub typeInfo: BNDisassemblyTextLineTypeInfo,
}
#[test]
fn bindgen_test_layout_BNDisassemblyTextLine() {
    assert_eq!(
        ::std::mem::size_of::<BNDisassemblyTextLine>(),
        96usize,
        concat!("Size of: ", stringify!(BNDisassemblyTextLine))
    );
    assert_eq!(
        ::std::mem::align_of::<BNDisassemblyTextLine>(),
        8usize,
        concat!("Alignment of ", stringify!(BNDisassemblyTextLine))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNDisassemblyTextLine>())).addr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDisassemblyTextLine),
            "::",
            stringify!(addr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNDisassemblyTextLine>())).instrIndex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDisassemblyTextLine),
            "::",
            stringify!(instrIndex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNDisassemblyTextLine>())).tokens as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDisassemblyTextLine),
            "::",
            stringify!(tokens)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNDisassemblyTextLine>())).count as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDisassemblyTextLine),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNDisassemblyTextLine>())).highlight as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDisassemblyTextLine),
            "::",
            stringify!(highlight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNDisassemblyTextLine>())).tags as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDisassemblyTextLine),
            "::",
            stringify!(tags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNDisassemblyTextLine>())).tagCount as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDisassemblyTextLine),
            "::",
            stringify!(tagCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNDisassemblyTextLine>())).typeInfo as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDisassemblyTextLine),
            "::",
            stringify!(typeInfo)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLinearDisassemblyLine {
    pub type_: BNLinearDisassemblyLineType,
    pub function: *mut BNFunction,
    pub block: *mut BNBasicBlock,
    pub contents: BNDisassemblyTextLine,
}
#[test]
fn bindgen_test_layout_BNLinearDisassemblyLine() {
    assert_eq!(
        ::std::mem::size_of::<BNLinearDisassemblyLine>(),
        120usize,
        concat!("Size of: ", stringify!(BNLinearDisassemblyLine))
    );
    assert_eq!(
        ::std::mem::align_of::<BNLinearDisassemblyLine>(),
        8usize,
        concat!("Alignment of ", stringify!(BNLinearDisassemblyLine))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNLinearDisassemblyLine>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLinearDisassemblyLine),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNLinearDisassemblyLine>())).function as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLinearDisassemblyLine),
            "::",
            stringify!(function)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNLinearDisassemblyLine>())).block as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLinearDisassemblyLine),
            "::",
            stringify!(block)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNLinearDisassemblyLine>())).contents as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLinearDisassemblyLine),
            "::",
            stringify!(contents)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNReferenceSource {
    pub func: *mut BNFunction,
    pub arch: *mut BNArchitecture,
    pub addr: u64,
}
#[test]
fn bindgen_test_layout_BNReferenceSource() {
    assert_eq!(
        ::std::mem::size_of::<BNReferenceSource>(),
        24usize,
        concat!("Size of: ", stringify!(BNReferenceSource))
    );
    assert_eq!(
        ::std::mem::align_of::<BNReferenceSource>(),
        8usize,
        concat!("Alignment of ", stringify!(BNReferenceSource))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNReferenceSource>())).func as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNReferenceSource),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNReferenceSource>())).arch as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNReferenceSource),
            "::",
            stringify!(arch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNReferenceSource>())).addr as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNReferenceSource),
            "::",
            stringify!(addr)
        )
    );
}
pub const BNTagTypeType_UserTagType: BNTagTypeType = 0;
pub const BNTagTypeType_NotificationTagType: BNTagTypeType = 1;
pub const BNTagTypeType_BookmarksTagType: BNTagTypeType = 2;
pub type BNTagTypeType = ::std::os::raw::c_uint;
pub const BNTagReferenceType_AddressTagReference: BNTagReferenceType = 0;
pub const BNTagReferenceType_FunctionTagReference: BNTagReferenceType = 1;
pub const BNTagReferenceType_DataTagReference: BNTagReferenceType = 2;
pub type BNTagReferenceType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTagReference {
    pub refType: BNTagReferenceType,
    pub autoDefined: bool,
    pub tag: *mut BNTag,
    pub arch: *mut BNArchitecture,
    pub func: *mut BNFunction,
    pub addr: u64,
}
#[test]
fn bindgen_test_layout_BNTagReference() {
    assert_eq!(
        ::std::mem::size_of::<BNTagReference>(),
        40usize,
        concat!("Size of: ", stringify!(BNTagReference))
    );
    assert_eq!(
        ::std::mem::align_of::<BNTagReference>(),
        8usize,
        concat!("Alignment of ", stringify!(BNTagReference))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNTagReference>())).refType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTagReference),
            "::",
            stringify!(refType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNTagReference>())).autoDefined as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTagReference),
            "::",
            stringify!(autoDefined)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNTagReference>())).tag as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTagReference),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNTagReference>())).arch as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTagReference),
            "::",
            stringify!(arch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNTagReference>())).func as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTagReference),
            "::",
            stringify!(func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNTagReference>())).addr as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTagReference),
            "::",
            stringify!(addr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNUndoAction {
    pub actionType: BNActionType,
    pub summaryText: *mut ::std::os::raw::c_char,
    pub summaryTokens: *mut BNInstructionTextToken,
    pub summaryTokenCount: size_t,
}
#[test]
fn bindgen_test_layout_BNUndoAction() {
    assert_eq!(
        ::std::mem::size_of::<BNUndoAction>(),
        32usize,
        concat!("Size of: ", stringify!(BNUndoAction))
    );
    assert_eq!(
        ::std::mem::align_of::<BNUndoAction>(),
        8usize,
        concat!("Alignment of ", stringify!(BNUndoAction))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNUndoAction>())).actionType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNUndoAction),
            "::",
            stringify!(actionType)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNUndoAction>())).summaryText as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNUndoAction),
            "::",
            stringify!(summaryText)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNUndoAction>())).summaryTokens as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNUndoAction),
            "::",
            stringify!(summaryTokens)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNUndoAction>())).summaryTokenCount as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNUndoAction),
            "::",
            stringify!(summaryTokenCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNUndoEntry {
    pub user: *mut BNUser,
    pub hash: *mut ::std::os::raw::c_char,
    pub actions: *mut BNUndoAction,
    pub actionCount: u64,
    pub timestamp: u64,
}
#[test]
fn bindgen_test_layout_BNUndoEntry() {
    assert_eq!(
        ::std::mem::size_of::<BNUndoEntry>(),
        40usize,
        concat!("Size of: ", stringify!(BNUndoEntry))
    );
    assert_eq!(
        ::std::mem::align_of::<BNUndoEntry>(),
        8usize,
        concat!("Alignment of ", stringify!(BNUndoEntry))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNUndoEntry>())).user as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNUndoEntry),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNUndoEntry>())).hash as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNUndoEntry),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNUndoEntry>())).actions as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNUndoEntry),
            "::",
            stringify!(actions)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNUndoEntry>())).actionCount as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNUndoEntry),
            "::",
            stringify!(actionCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNUndoEntry>())).timestamp as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNUndoEntry),
            "::",
            stringify!(timestamp)
        )
    );
}
pub const BNMergeStatus_NOT_APPLICABLE: BNMergeStatus = 0;
pub const BNMergeStatus_OK: BNMergeStatus = 1;
pub const BNMergeStatus_CONFLICT: BNMergeStatus = 2;
pub type BNMergeStatus = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNMergeResult {
    pub status: BNMergeStatus,
    pub action: BNUndoAction,
    pub hash: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_BNMergeResult() {
    assert_eq!(
        ::std::mem::size_of::<BNMergeResult>(),
        48usize,
        concat!("Size of: ", stringify!(BNMergeResult))
    );
    assert_eq!(
        ::std::mem::align_of::<BNMergeResult>(),
        8usize,
        concat!("Alignment of ", stringify!(BNMergeResult))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNMergeResult>())).status as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMergeResult),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNMergeResult>())).action as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMergeResult),
            "::",
            stringify!(action)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNMergeResult>())).hash as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMergeResult),
            "::",
            stringify!(hash)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCallingConventionWithConfidence {
    pub convention: *mut BNCallingConvention,
    pub confidence: u8,
}
#[test]
fn bindgen_test_layout_BNCallingConventionWithConfidence() {
    assert_eq!(
        ::std::mem::size_of::<BNCallingConventionWithConfidence>(),
        16usize,
        concat!("Size of: ", stringify!(BNCallingConventionWithConfidence))
    );
    assert_eq!(
        ::std::mem::align_of::<BNCallingConventionWithConfidence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(BNCallingConventionWithConfidence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCallingConventionWithConfidence>())).convention as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCallingConventionWithConfidence),
            "::",
            stringify!(convention)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNCallingConventionWithConfidence>())).confidence as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCallingConventionWithConfidence),
            "::",
            stringify!(confidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBoolWithConfidence {
    pub value: bool,
    pub confidence: u8,
}
#[test]
fn bindgen_test_layout_BNBoolWithConfidence() {
    assert_eq!(
        ::std::mem::size_of::<BNBoolWithConfidence>(),
        2usize,
        concat!("Size of: ", stringify!(BNBoolWithConfidence))
    );
    assert_eq!(
        ::std::mem::align_of::<BNBoolWithConfidence>(),
        1usize,
        concat!("Alignment of ", stringify!(BNBoolWithConfidence))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNBoolWithConfidence>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBoolWithConfidence),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNBoolWithConfidence>())).confidence as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBoolWithConfidence),
            "::",
            stringify!(confidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNSizeWithConfidence {
    pub value: size_t,
    pub confidence: u8,
}
#[test]
fn bindgen_test_layout_BNSizeWithConfidence() {
    assert_eq!(
        ::std::mem::size_of::<BNSizeWithConfidence>(),
        16usize,
        concat!("Size of: ", stringify!(BNSizeWithConfidence))
    );
    assert_eq!(
        ::std::mem::align_of::<BNSizeWithConfidence>(),
        8usize,
        concat!("Alignment of ", stringify!(BNSizeWithConfidence))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNSizeWithConfidence>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNSizeWithConfidence),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNSizeWithConfidence>())).confidence as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNSizeWithConfidence),
            "::",
            stringify!(confidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNOffsetWithConfidence {
    pub value: i64,
    pub confidence: u8,
}
#[test]
fn bindgen_test_layout_BNOffsetWithConfidence() {
    assert_eq!(
        ::std::mem::size_of::<BNOffsetWithConfidence>(),
        16usize,
        concat!("Size of: ", stringify!(BNOffsetWithConfidence))
    );
    assert_eq!(
        ::std::mem::align_of::<BNOffsetWithConfidence>(),
        8usize,
        concat!("Alignment of ", stringify!(BNOffsetWithConfidence))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<BNOffsetWithConfidence>())).value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNOffsetWithConfidence),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNOffsetWithConfidence>())).confidence as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNOffsetWithConfidence),
            "::",
            stringify!(confidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNMemberScopeWithConfidence {
    pub value: BNMemberScope,
    pub confidence: u8,
}
#[test]
fn bindgen_test_layout_BNMemberScopeWithConfidence() {
    assert_eq!(
        ::std::mem::size_of::<BNMemberScopeWithConfidence>(),
        8usize,
        concat!("Size of: ", stringify!(BNMemberScopeWithConfidence))
    );
    assert_eq!(
        ::std::mem::align_of::<BNMemberScopeWithConfidence>(),
        4usize,
        concat!("Alignment of ", stringify!(BNMemberScopeWithConfidence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNMemberScopeWithConfidence>())).value as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMemberScopeWithConfidence),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNMemberScopeWithConfidence>())).confidence as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMemberScopeWithConfidence),
            "::",
            stringify!(confidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNMemberAccessWithConfidence {
    pub value: BNMemberAccess,
    pub confidence: u8,
}
#[test]
fn bindgen_test_layout_BNMemberAccessWithConfidence() {
    assert_eq!(
        ::std::mem::size_of::<BNMemberAccessWithConfidence>(),
        8usize,
        concat!("Size of: ", stringify!(BNMemberAccessWithConfidence))
    );
    assert_eq!(
        ::std::mem::align_of::<BNMemberAccessWithConfidence>(),
        4usize,
        concat!("Alignment of ", stringify!(BNMemberAccessWithConfidence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNMemberAccessWithConfidence>())).value as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMemberAccessWithConfidence),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNMemberAccessWithConfidence>())).confidence as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMemberAccessWithConfidence),
            "::",
            stringify!(confidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNParameterVariablesWithConfidence {
    pub vars: *mut BNVariable,
    pub count: size_t,
    pub confidence: u8,
}
#[test]
fn bindgen_test_layout_BNParameterVariablesWithConfidence() {
    assert_eq!(
        ::std::mem::size_of::<BNParameterVariablesWithConfidence>(),
        24usize,
        concat!("Size of: ", stringify!(BNParameterVariablesWithConfidence))
    );
    assert_eq!(
        ::std::mem::align_of::<BNParameterVariablesWithConfidence>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(BNParameterVariablesWithConfidence)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNParameterVariablesWithConfidence>())).vars as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNParameterVariablesWithConfidence),
            "::",
            stringify!(vars)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNParameterVariablesWithConfidence>())).count as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNParameterVariablesWithConfidence),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNParameterVariablesWithConfidence>())).confidence as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNParameterVariablesWithConfidence),
            "::",
            stringify!(confidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRegisterSetWithConfidence {
    pub regs: *mut u32,
    pub count: size_t,
    pub confidence: u8,
}
#[test]
fn bindgen_test_layout_BNRegisterSetWithConfidence() {
    assert_eq!(
        ::std::mem::size_of::<BNRegisterSetWithConfidence>(),
        24usize,
        concat!("Size of: ", stringify!(BNRegisterSetWithConfidence))
    );
    assert_eq!(
        ::std::mem::align_of::<BNRegisterSetWithConfidence>(),
        8usize,
        concat!("Alignment of ", stringify!(BNRegisterSetWithConfidence))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNRegisterSetWithConfidence>())).regs as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterSetWithConfidence),
            "::",
            stringify!(regs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNRegisterSetWithConfidence>())).count as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterSetWithConfidence),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<BNRegisterSetWithConfidence>())).confidence as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterSetWithConfidence),
            "::",
            stringify!(confidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFunctionParameter {
    pub name: *mut ::std::os::raw::c_char,
    pub type_: *mut BNType,
    pub typeConfidence: u8,
    pub defaultLocation: bool,
