#![allow(non_upper_case_globals)]
#![allow(non_snake_case)]
#![allow(non_camel_case_types)]
#![allow(improper_ctypes)]
/* automatically generated by rust-bindgen 0.68.1 */

pub const _GLIBCXX_CSTDINT: u32 = 1;
pub const _GLIBCXX_CXX_CONFIG_H: u32 = 1;
pub const _GLIBCXX_RELEASE: u32 = 13;
pub const __GLIBCXX__: u32 = 20230711;
pub const _GLIBCXX_HAVE_ATTRIBUTE_VISIBILITY: u32 = 1;
pub const _GLIBCXX_USE_DEPRECATED: u32 = 1;
pub const _GLIBCXX_EXTERN_TEMPLATE: u32 = 1;
pub const _GLIBCXX_USE_DUAL_ABI: u32 = 1;
pub const _GLIBCXX_USE_CXX11_ABI: u32 = 1;
pub const _GLIBCXX_INLINE_VERSION: u32 = 0;
pub const _GLIBCXX_HAVE_IS_CONSTANT_EVALUATED: u32 = 1;
pub const _GLIBCXX_VERBOSE_ASSERT: u32 = 1;
pub const _GLIBCXX_USE_ALLOCATOR_NEW: u32 = 1;
pub const _GLIBCXX_OS_DEFINES: u32 = 1;
pub const __NO_CTYPE: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _ISOC95_SOURCE: u32 = 1;
pub const _ISOC99_SOURCE: u32 = 1;
pub const _ISOC11_SOURCE: u32 = 1;
pub const _ISOC2X_SOURCE: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const _XOPEN_SOURCE: u32 = 700;
pub const _XOPEN_SOURCE_EXTENDED: u32 = 1;
pub const _LARGEFILE64_SOURCE: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const _DYNAMIC_STACK_SIZE_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_ISOCXX11: u32 = 1;

            stringify!(std___byte_operand)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___byte_operand_open0___int128_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___byte_operand>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___byte_operand)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___byte_operand>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___byte_operand)
        )
    );
}
#[test]
fn __bindgen_test_layout_std___byte_operand_open0_unsigned___int128_close0_instantiation() {
    assert_eq!(
        ::std::mem::size_of::<std___byte_operand>(),
        1usize,
        concat!(
            "Size of template specialization: ",
            stringify!(std___byte_operand)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<std___byte_operand>(),
        1usize,
        concat!(
            "Alignment of template specialization: ",
            stringify!(std___byte_operand)
        )
    );
}
pub type std___byte_op_t = std___byte_operand;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    const UNINIT: ::std::mem::MaybeUninit<div_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<ldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    const UNINIT: ::std::mem::MaybeUninit<lldiv_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtof32(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float32;
}
extern "C" {
    pub fn strtof64(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float64;
}
extern "C" {
    pub fn strtof32x(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float32x;
}
extern "C" {
    pub fn strtof64x(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> _Float64x;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strfromd(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: f32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfroml(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: u128,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf32(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: _Float32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf64(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: _Float64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf32x(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: _Float32x,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strfromf64x(
        __dest: *mut ::std::os::raw::c_char,
        __size: usize,
        __format: *const ::std::os::raw::c_char,
        __f: _Float64x,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    const UNINIT: ::std::mem::MaybeUninit<__locale_struct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__locales) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_b) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_tolower) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_toupper) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__names) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strtol_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoll_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
        __loc: locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtod_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> f64;
}
extern "C" {
    pub fn strtof_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> f32;
}
extern "C" {
    pub fn strtold_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> u128;
}
extern "C" {
    pub fn strtof32_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float32;
}
extern "C" {
    pub fn strtof64_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float64;
}
extern "C" {
    pub fn strtof32x_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float32x;
}
extern "C" {
    pub fn strtof64x_l(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> _Float64x;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type ino64_t = __ino64_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type off64_t = __off64_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type useconds_t = __useconds_t;
pub type suseconds_t = __suseconds_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    const UNINIT: ::std::mem::MaybeUninit<__sigset_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::std::mem::MaybeUninit<timeval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type blkcnt64_t = __blkcnt64_t;
pub type fsblkcnt64_t = __fsblkcnt64_t;
pub type fsfilcnt64_t = __fsfilcnt64_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___atomic_wide_counter__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__atomic_wide_counter__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__low) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__high) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___atomic_wide_counter() {
    const UNINIT: ::std::mem::MaybeUninit<__atomic_wide_counter> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Size of: ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        ::std::mem::align_of::<__atomic_wide_counter>(),
        8usize,
        concat!("Alignment of ", stringify!(__atomic_wide_counter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value64) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value64)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__atomic_wide_counter),
            "::",
            stringify!(__value32)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_list> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__prev) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_slist> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_mutex_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__elision) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__list) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_rwlock_arch_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__readers) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrphase_futex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writers_futex) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad3) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad4) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cur_writer) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__shared) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__rwelision) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__flags) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_cond_s> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wseq) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_start) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_refs) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g1_orig_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wrefs) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__g_signals) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout___once_flag() {
    const UNINIT: ::std::mem::MaybeUninit<__once_flag> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__once_flag>(),
        4usize,
        concat!("Size of: ", stringify!(__once_flag))
    );
    assert_eq!(
        ::std::mem::align_of::<__once_flag>(),
        4usize,
        concat!("Alignment of ", stringify!(__once_flag))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__once_flag),
            "::",
            stringify!(__data)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutexattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_condattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_attr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_cond_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlock_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlockattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrier_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrierattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    const UNINIT: ::std::mem::MaybeUninit<random_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<random_data>(),
        48usize,
        concat!("Size of: ", stringify!(random_data))
    );
    assert_eq!(
        ::std::mem::align_of::<random_data>(),
        8usize,
        concat!("Alignment of ", stringify!(random_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(fptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_type) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_deg) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_deg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rand_sep) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(rand_sep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(random_data),
            "::",
            stringify!(end_ptr)
        )
    );
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    const UNINIT: ::std::mem::MaybeUninit<drand48_data> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<drand48_data>(),
        24usize,
        concat!("Size of: ", stringify!(drand48_data))
    );
    assert_eq!(
        ::std::mem::align_of::<drand48_data>(),
        8usize,
        concat!("Alignment of ", stringify!(drand48_data))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__old_x) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__old_x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__c) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__c)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__init) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__init)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__a) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(drand48_data),
            "::",
            stringify!(__a)
        )
    );
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: usize, __size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn alloca(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: usize, __size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn secure_getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemp64(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps64(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkostemp(
        __template: *mut ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemp64(
        __template: *mut ::std::os::raw::c_char,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkostemps64(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
        __flags: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn canonicalize_file_name(
        __name: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type comparison_fn_t = __compar_fn_t;
pub type __compar_d_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
        arg3: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn qsort_r(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_d_fn_t,
        __arg: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut u32,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut u32, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const u32, __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn posix_openpt(__oflag: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn grantpt(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unlockpt(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ptsname(__fd: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ptsname_r(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpt() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
pub const BNPluginLoadOrder_EarlyPluginLoadOrder: BNPluginLoadOrder = 0;
pub const BNPluginLoadOrder_NormalPluginLoadOrder: BNPluginLoadOrder = 1;
pub const BNPluginLoadOrder_LatePluginLoadOrder: BNPluginLoadOrder = 2;
pub type BNPluginLoadOrder = ::std::os::raw::c_uint;
pub const PluginLoadStatus_NotAttemptedStatus: PluginLoadStatus = 0;
pub const PluginLoadStatus_LoadSucceededStatus: PluginLoadStatus = 1;
pub const PluginLoadStatus_LoadFailedStatus: PluginLoadStatus = 2;
pub type PluginLoadStatus = ::std::os::raw::c_uint;
pub type BNCorePluginInitFunction = ::std::option::Option<unsafe extern "C" fn() -> bool>;
pub type BNCorePluginDependencyFunction = ::std::option::Option<unsafe extern "C" fn()>;
pub type BNCorePluginABIVersionFunction = ::std::option::Option<unsafe extern "C" fn() -> u32>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDataBuffer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBinaryView {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBinaryViewType {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBinaryReader {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBinaryWriter {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNKeyValueStore {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNSnapshot {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDatabase {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFileMetadata {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTransform {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNArchitecture {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFunction {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBasicBlock {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDownloadProvider {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDownloadInstance {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNWebsocketProvider {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNWebsocketClient {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeParser {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypePrinter {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFlowGraph {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFlowGraphNode {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFlowGraphLayoutRequest {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNSymbol {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTemporaryFile {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLowLevelILFunction {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNMediumLevelILFunction {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNHighLevelILFunction {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLanguageRepresentationFunction {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNType {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeBuilder {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeLibrary {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeLibraryMapping {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNStructure {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNStructureBuilder {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTagType {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTag {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNUser {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNNamedTypeReference {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNNamedTypeReferenceBuilder {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNEnumeration {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNEnumerationBuilder {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCallingConvention {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNPlatform {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNActivity {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNAnalysisContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNWorkflow {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNAnalysisCompletionEvent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDisassemblySettings {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNSaveSettings {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNScriptingProvider {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNScriptingInstance {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNMainThreadAction {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBackgroundTask {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRepository {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRepoPlugin {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRepositoryManager {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNComponent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNSettings {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNMetadata {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNReportCollection {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRelocation {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNSegment {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNSection {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRelocationHandler {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDataRenderer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDataRendererContainer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDisassemblyTextRenderer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLinearViewObject {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLinearViewCursor {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDebugInfo {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDebugInfoParser {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNSecretsProvider {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLogger {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNSymbolQueue {
    _unused: [u8; 0],
}
pub const BNLogLevel_DebugLog: BNLogLevel = 0;
#[doc = "! Debug logging level, most verbose logging level"]
pub const BNLogLevel_InfoLog: BNLogLevel = 1;
#[doc = "! Information logging level, default logging level"]
pub const BNLogLevel_WarningLog: BNLogLevel = 2;
#[doc = "! Warning logging level, messages show with warning icon in the UI"]
pub const BNLogLevel_ErrorLog: BNLogLevel = 3;
#[doc = "! Error logging level, messages show with error icon in the UI"]
pub const BNLogLevel_AlertLog: BNLogLevel = 4;
#[doc = "! Console log levels"]
pub type BNLogLevel = ::std::os::raw::c_uint;
pub const BNEndianness_LittleEndian: BNEndianness = 0;
pub const BNEndianness_BigEndian: BNEndianness = 1;
pub type BNEndianness = ::std::os::raw::c_uint;
pub const BNModificationStatus_Original: BNModificationStatus = 0;
pub const BNModificationStatus_Changed: BNModificationStatus = 1;
pub const BNModificationStatus_Inserted: BNModificationStatus = 2;
pub type BNModificationStatus = ::std::os::raw::c_uint;
pub const BNTransformType_BinaryCodecTransform: BNTransformType = 0;
pub const BNTransformType_TextCodecTransform: BNTransformType = 1;
pub const BNTransformType_UnicodeCodecTransform: BNTransformType = 2;
pub const BNTransformType_DecodeTransform: BNTransformType = 3;
pub const BNTransformType_BinaryEncodeTransform: BNTransformType = 4;
pub const BNTransformType_TextEncodeTransform: BNTransformType = 5;
pub const BNTransformType_EncryptTransform: BNTransformType = 6;
pub const BNTransformType_InvertingTransform: BNTransformType = 7;
pub const BNTransformType_HashTransform: BNTransformType = 8;
pub type BNTransformType = ::std::os::raw::c_uint;
pub const BNBranchType_UnconditionalBranch: BNBranchType = 0;
pub const BNBranchType_FalseBranch: BNBranchType = 1;
pub const BNBranchType_TrueBranch: BNBranchType = 2;
pub const BNBranchType_CallDestination: BNBranchType = 3;
pub const BNBranchType_FunctionReturn: BNBranchType = 4;
pub const BNBranchType_SystemCall: BNBranchType = 5;
pub const BNBranchType_IndirectBranch: BNBranchType = 6;
pub const BNBranchType_ExceptionBranch: BNBranchType = 7;
pub const BNBranchType_UnresolvedBranch: BNBranchType = 127;
pub const BNBranchType_UserDefinedBranch: BNBranchType = 128;
pub type BNBranchType = ::std::os::raw::c_uint;
pub const BNInstructionTextTokenType_TextToken: BNInstructionTextTokenType = 0;
pub const BNInstructionTextTokenType_InstructionToken: BNInstructionTextTokenType = 1;
pub const BNInstructionTextTokenType_OperandSeparatorToken: BNInstructionTextTokenType = 2;
pub const BNInstructionTextTokenType_RegisterToken: BNInstructionTextTokenType = 3;
pub const BNInstructionTextTokenType_IntegerToken: BNInstructionTextTokenType = 4;
pub const BNInstructionTextTokenType_PossibleAddressToken: BNInstructionTextTokenType = 5;
pub const BNInstructionTextTokenType_BeginMemoryOperandToken: BNInstructionTextTokenType = 6;
pub const BNInstructionTextTokenType_EndMemoryOperandToken: BNInstructionTextTokenType = 7;
pub const BNInstructionTextTokenType_FloatingPointToken: BNInstructionTextTokenType = 8;
pub const BNInstructionTextTokenType_AnnotationToken: BNInstructionTextTokenType = 9;
pub const BNInstructionTextTokenType_CodeRelativeAddressToken: BNInstructionTextTokenType = 10;
pub const BNInstructionTextTokenType_ArgumentNameToken: BNInstructionTextTokenType = 11;
pub const BNInstructionTextTokenType_HexDumpByteValueToken: BNInstructionTextTokenType = 12;
pub const BNInstructionTextTokenType_HexDumpSkippedByteToken: BNInstructionTextTokenType = 13;
pub const BNInstructionTextTokenType_HexDumpInvalidByteToken: BNInstructionTextTokenType = 14;
pub const BNInstructionTextTokenType_HexDumpTextToken: BNInstructionTextTokenType = 15;
pub const BNInstructionTextTokenType_OpcodeToken: BNInstructionTextTokenType = 16;
pub const BNInstructionTextTokenType_StringToken: BNInstructionTextTokenType = 17;
pub const BNInstructionTextTokenType_CharacterConstantToken: BNInstructionTextTokenType = 18;
pub const BNInstructionTextTokenType_KeywordToken: BNInstructionTextTokenType = 19;
pub const BNInstructionTextTokenType_TypeNameToken: BNInstructionTextTokenType = 20;
pub const BNInstructionTextTokenType_FieldNameToken: BNInstructionTextTokenType = 21;
pub const BNInstructionTextTokenType_NameSpaceToken: BNInstructionTextTokenType = 22;
pub const BNInstructionTextTokenType_NameSpaceSeparatorToken: BNInstructionTextTokenType = 23;
pub const BNInstructionTextTokenType_TagToken: BNInstructionTextTokenType = 24;
pub const BNInstructionTextTokenType_StructOffsetToken: BNInstructionTextTokenType = 25;
pub const BNInstructionTextTokenType_StructOffsetByteValueToken: BNInstructionTextTokenType = 26;
pub const BNInstructionTextTokenType_StructureHexDumpTextToken: BNInstructionTextTokenType = 27;
pub const BNInstructionTextTokenType_GotoLabelToken: BNInstructionTextTokenType = 28;
pub const BNInstructionTextTokenType_CommentToken: BNInstructionTextTokenType = 29;
pub const BNInstructionTextTokenType_PossibleValueToken: BNInstructionTextTokenType = 30;
pub const BNInstructionTextTokenType_PossibleValueTypeToken: BNInstructionTextTokenType = 31;
pub const BNInstructionTextTokenType_ArrayIndexToken: BNInstructionTextTokenType = 32;
pub const BNInstructionTextTokenType_IndentationToken: BNInstructionTextTokenType = 33;
pub const BNInstructionTextTokenType_UnknownMemoryToken: BNInstructionTextTokenType = 34;
pub const BNInstructionTextTokenType_EnumerationMemberToken: BNInstructionTextTokenType = 35;
pub const BNInstructionTextTokenType_OperationToken: BNInstructionTextTokenType = 36;
pub const BNInstructionTextTokenType_BaseStructureNameToken: BNInstructionTextTokenType = 37;
pub const BNInstructionTextTokenType_BaseStructureSeparatorToken: BNInstructionTextTokenType = 38;
pub const BNInstructionTextTokenType_BraceToken: BNInstructionTextTokenType = 39;
pub const BNInstructionTextTokenType_CodeSymbolToken: BNInstructionTextTokenType = 64;
pub const BNInstructionTextTokenType_DataSymbolToken: BNInstructionTextTokenType = 65;
pub const BNInstructionTextTokenType_LocalVariableToken: BNInstructionTextTokenType = 66;
pub const BNInstructionTextTokenType_ImportToken: BNInstructionTextTokenType = 67;
pub const BNInstructionTextTokenType_AddressDisplayToken: BNInstructionTextTokenType = 68;
pub const BNInstructionTextTokenType_IndirectImportToken: BNInstructionTextTokenType = 69;
pub const BNInstructionTextTokenType_ExternalSymbolToken: BNInstructionTextTokenType = 70;
pub type BNInstructionTextTokenType = ::std::os::raw::c_uint;
pub const BNInstructionTextTokenContext_NoTokenContext: BNInstructionTextTokenContext = 0;
pub const BNInstructionTextTokenContext_LocalVariableTokenContext: BNInstructionTextTokenContext =
    1;
pub const BNInstructionTextTokenContext_DataVariableTokenContext: BNInstructionTextTokenContext = 2;
pub const BNInstructionTextTokenContext_FunctionReturnTokenContext: BNInstructionTextTokenContext =
    3;
pub const BNInstructionTextTokenContext_InstructionAddressTokenContext:
    BNInstructionTextTokenContext = 4;
pub const BNInstructionTextTokenContext_ILInstructionIndexTokenContext:
    BNInstructionTextTokenContext = 5;
pub const BNInstructionTextTokenContext_ConstDataTokenContext: BNInstructionTextTokenContext = 6;
pub const BNInstructionTextTokenContext_ConstStringDataTokenContext: BNInstructionTextTokenContext =
    7;
pub const BNInstructionTextTokenContext_StringReferenceTokenContext: BNInstructionTextTokenContext =
    8;
pub const BNInstructionTextTokenContext_StringDataVariableTokenContext:
    BNInstructionTextTokenContext = 9;
pub const BNInstructionTextTokenContext_StringDisplayTokenContext: BNInstructionTextTokenContext =
    10;
pub type BNInstructionTextTokenContext = ::std::os::raw::c_uint;
pub const BNLinearDisassemblyLineType_BlankLineType: BNLinearDisassemblyLineType = 0;
pub const BNLinearDisassemblyLineType_BasicLineType: BNLinearDisassemblyLineType = 1;
pub const BNLinearDisassemblyLineType_CodeDisassemblyLineType: BNLinearDisassemblyLineType = 2;
pub const BNLinearDisassemblyLineType_DataVariableLineType: BNLinearDisassemblyLineType = 3;
pub const BNLinearDisassemblyLineType_HexDumpLineType: BNLinearDisassemblyLineType = 4;
pub const BNLinearDisassemblyLineType_FunctionHeaderLineType: BNLinearDisassemblyLineType = 5;
pub const BNLinearDisassemblyLineType_FunctionHeaderStartLineType: BNLinearDisassemblyLineType = 6;
pub const BNLinearDisassemblyLineType_FunctionHeaderEndLineType: BNLinearDisassemblyLineType = 7;
pub const BNLinearDisassemblyLineType_FunctionContinuationLineType: BNLinearDisassemblyLineType = 8;
pub const BNLinearDisassemblyLineType_LocalVariableLineType: BNLinearDisassemblyLineType = 9;
pub const BNLinearDisassemblyLineType_LocalVariableListEndLineType: BNLinearDisassemblyLineType =
    10;
pub const BNLinearDisassemblyLineType_FunctionEndLineType: BNLinearDisassemblyLineType = 11;
pub const BNLinearDisassemblyLineType_NoteStartLineType: BNLinearDisassemblyLineType = 12;
pub const BNLinearDisassemblyLineType_NoteLineType: BNLinearDisassemblyLineType = 13;
pub const BNLinearDisassemblyLineType_NoteEndLineType: BNLinearDisassemblyLineType = 14;
pub const BNLinearDisassemblyLineType_SectionStartLineType: BNLinearDisassemblyLineType = 15;
pub const BNLinearDisassemblyLineType_SectionEndLineType: BNLinearDisassemblyLineType = 16;
pub const BNLinearDisassemblyLineType_SectionSeparatorLineType: BNLinearDisassemblyLineType = 17;
pub const BNLinearDisassemblyLineType_NonContiguousSeparatorLineType: BNLinearDisassemblyLineType =
    18;
pub const BNLinearDisassemblyLineType_AnalysisWarningLineType: BNLinearDisassemblyLineType = 19;
pub type BNLinearDisassemblyLineType = ::std::os::raw::c_uint;
pub const BNTokenEscapingType_NoTokenEscapingType: BNTokenEscapingType = 0;
pub const BNTokenEscapingType_BackticksTokenEscapingType: BNTokenEscapingType = 1;
pub const BNTokenEscapingType_QuotedStringEscapingType: BNTokenEscapingType = 2;
pub const BNTokenEscapingType_ReplaceInvalidCharsEscapingType: BNTokenEscapingType = 3;
pub type BNTokenEscapingType = ::std::os::raw::c_uint;
pub const BNAnalysisWarningActionType_NoAnalysisWarningAction: BNAnalysisWarningActionType = 0;
pub const BNAnalysisWarningActionType_ForceAnalysisWarningAction: BNAnalysisWarningActionType = 1;
pub const BNAnalysisWarningActionType_ShowStackGraphWarningAction: BNAnalysisWarningActionType = 2;
pub type BNAnalysisWarningActionType = ::std::os::raw::c_uint;
pub const BNSymbolType_FunctionSymbol: BNSymbolType = 0;
pub const BNSymbolType_ImportAddressSymbol: BNSymbolType = 1;
pub const BNSymbolType_ImportedFunctionSymbol: BNSymbolType = 2;
pub const BNSymbolType_DataSymbol: BNSymbolType = 3;
pub const BNSymbolType_ImportedDataSymbol: BNSymbolType = 4;
pub const BNSymbolType_ExternalSymbol: BNSymbolType = 5;
pub const BNSymbolType_LibraryFunctionSymbol: BNSymbolType = 6;
pub type BNSymbolType = ::std::os::raw::c_uint;
pub const BNSymbolBinding_NoBinding: BNSymbolBinding = 0;
pub const BNSymbolBinding_LocalBinding: BNSymbolBinding = 1;
pub const BNSymbolBinding_GlobalBinding: BNSymbolBinding = 2;
pub const BNSymbolBinding_WeakBinding: BNSymbolBinding = 3;
pub type BNSymbolBinding = ::std::os::raw::c_uint;
pub const BNActionType_TemporaryAction: BNActionType = 0;
pub const BNActionType_DataModificationAction: BNActionType = 1;
pub const BNActionType_AnalysisAction: BNActionType = 2;
pub const BNActionType_DataModificationAndAnalysisAction: BNActionType = 3;
pub type BNActionType = ::std::os::raw::c_uint;
pub const BNLowLevelILOperation_LLIL_NOP: BNLowLevelILOperation = 0;
pub const BNLowLevelILOperation_LLIL_SET_REG: BNLowLevelILOperation = 1;
pub const BNLowLevelILOperation_LLIL_SET_REG_SPLIT: BNLowLevelILOperation = 2;
pub const BNLowLevelILOperation_LLIL_SET_FLAG: BNLowLevelILOperation = 3;
pub const BNLowLevelILOperation_LLIL_SET_REG_STACK_REL: BNLowLevelILOperation = 4;
pub const BNLowLevelILOperation_LLIL_REG_STACK_PUSH: BNLowLevelILOperation = 5;
pub const BNLowLevelILOperation_LLIL_LOAD: BNLowLevelILOperation = 6;
pub const BNLowLevelILOperation_LLIL_STORE: BNLowLevelILOperation = 7;
pub const BNLowLevelILOperation_LLIL_PUSH: BNLowLevelILOperation = 8;
pub const BNLowLevelILOperation_LLIL_POP: BNLowLevelILOperation = 9;
pub const BNLowLevelILOperation_LLIL_REG: BNLowLevelILOperation = 10;
pub const BNLowLevelILOperation_LLIL_REG_SPLIT: BNLowLevelILOperation = 11;
pub const BNLowLevelILOperation_LLIL_REG_STACK_REL: BNLowLevelILOperation = 12;
pub const BNLowLevelILOperation_LLIL_REG_STACK_POP: BNLowLevelILOperation = 13;
pub const BNLowLevelILOperation_LLIL_REG_STACK_FREE_REG: BNLowLevelILOperation = 14;
pub const BNLowLevelILOperation_LLIL_REG_STACK_FREE_REL: BNLowLevelILOperation = 15;
pub const BNLowLevelILOperation_LLIL_CONST: BNLowLevelILOperation = 16;
pub const BNLowLevelILOperation_LLIL_CONST_PTR: BNLowLevelILOperation = 17;
pub const BNLowLevelILOperation_LLIL_EXTERN_PTR: BNLowLevelILOperation = 18;
pub const BNLowLevelILOperation_LLIL_FLOAT_CONST: BNLowLevelILOperation = 19;
pub const BNLowLevelILOperation_LLIL_FLAG: BNLowLevelILOperation = 20;
pub const BNLowLevelILOperation_LLIL_FLAG_BIT: BNLowLevelILOperation = 21;
pub const BNLowLevelILOperation_LLIL_ADD: BNLowLevelILOperation = 22;
pub const BNLowLevelILOperation_LLIL_ADC: BNLowLevelILOperation = 23;
pub const BNLowLevelILOperation_LLIL_SUB: BNLowLevelILOperation = 24;
pub const BNLowLevelILOperation_LLIL_SBB: BNLowLevelILOperation = 25;
pub const BNLowLevelILOperation_LLIL_AND: BNLowLevelILOperation = 26;
pub const BNLowLevelILOperation_LLIL_OR: BNLowLevelILOperation = 27;
pub const BNLowLevelILOperation_LLIL_XOR: BNLowLevelILOperation = 28;
pub const BNLowLevelILOperation_LLIL_LSL: BNLowLevelILOperation = 29;
pub const BNLowLevelILOperation_LLIL_LSR: BNLowLevelILOperation = 30;
pub const BNLowLevelILOperation_LLIL_ASR: BNLowLevelILOperation = 31;
pub const BNLowLevelILOperation_LLIL_ROL: BNLowLevelILOperation = 32;
pub const BNLowLevelILOperation_LLIL_RLC: BNLowLevelILOperation = 33;
pub const BNLowLevelILOperation_LLIL_ROR: BNLowLevelILOperation = 34;
pub const BNLowLevelILOperation_LLIL_RRC: BNLowLevelILOperation = 35;
pub const BNLowLevelILOperation_LLIL_MUL: BNLowLevelILOperation = 36;
pub const BNLowLevelILOperation_LLIL_MULU_DP: BNLowLevelILOperation = 37;
pub const BNLowLevelILOperation_LLIL_MULS_DP: BNLowLevelILOperation = 38;
pub const BNLowLevelILOperation_LLIL_DIVU: BNLowLevelILOperation = 39;
pub const BNLowLevelILOperation_LLIL_DIVU_DP: BNLowLevelILOperation = 40;
pub const BNLowLevelILOperation_LLIL_DIVS: BNLowLevelILOperation = 41;
pub const BNLowLevelILOperation_LLIL_DIVS_DP: BNLowLevelILOperation = 42;
pub const BNLowLevelILOperation_LLIL_MODU: BNLowLevelILOperation = 43;
pub const BNLowLevelILOperation_LLIL_MODU_DP: BNLowLevelILOperation = 44;
pub const BNLowLevelILOperation_LLIL_MODS: BNLowLevelILOperation = 45;
pub const BNLowLevelILOperation_LLIL_MODS_DP: BNLowLevelILOperation = 46;
pub const BNLowLevelILOperation_LLIL_NEG: BNLowLevelILOperation = 47;
pub const BNLowLevelILOperation_LLIL_NOT: BNLowLevelILOperation = 48;
pub const BNLowLevelILOperation_LLIL_SX: BNLowLevelILOperation = 49;
pub const BNLowLevelILOperation_LLIL_ZX: BNLowLevelILOperation = 50;
pub const BNLowLevelILOperation_LLIL_LOW_PART: BNLowLevelILOperation = 51;
pub const BNLowLevelILOperation_LLIL_JUMP: BNLowLevelILOperation = 52;
pub const BNLowLevelILOperation_LLIL_JUMP_TO: BNLowLevelILOperation = 53;
pub const BNLowLevelILOperation_LLIL_CALL: BNLowLevelILOperation = 54;
pub const BNLowLevelILOperation_LLIL_CALL_STACK_ADJUST: BNLowLevelILOperation = 55;
pub const BNLowLevelILOperation_LLIL_TAILCALL: BNLowLevelILOperation = 56;
pub const BNLowLevelILOperation_LLIL_RET: BNLowLevelILOperation = 57;
pub const BNLowLevelILOperation_LLIL_NORET: BNLowLevelILOperation = 58;
pub const BNLowLevelILOperation_LLIL_IF: BNLowLevelILOperation = 59;
pub const BNLowLevelILOperation_LLIL_GOTO: BNLowLevelILOperation = 60;
pub const BNLowLevelILOperation_LLIL_FLAG_COND: BNLowLevelILOperation = 61;
pub const BNLowLevelILOperation_LLIL_FLAG_GROUP: BNLowLevelILOperation = 62;
pub const BNLowLevelILOperation_LLIL_CMP_E: BNLowLevelILOperation = 63;
pub const BNLowLevelILOperation_LLIL_CMP_NE: BNLowLevelILOperation = 64;
pub const BNLowLevelILOperation_LLIL_CMP_SLT: BNLowLevelILOperation = 65;
pub const BNLowLevelILOperation_LLIL_CMP_ULT: BNLowLevelILOperation = 66;
pub const BNLowLevelILOperation_LLIL_CMP_SLE: BNLowLevelILOperation = 67;
pub const BNLowLevelILOperation_LLIL_CMP_ULE: BNLowLevelILOperation = 68;
pub const BNLowLevelILOperation_LLIL_CMP_SGE: BNLowLevelILOperation = 69;
pub const BNLowLevelILOperation_LLIL_CMP_UGE: BNLowLevelILOperation = 70;
pub const BNLowLevelILOperation_LLIL_CMP_SGT: BNLowLevelILOperation = 71;
pub const BNLowLevelILOperation_LLIL_CMP_UGT: BNLowLevelILOperation = 72;
pub const BNLowLevelILOperation_LLIL_TEST_BIT: BNLowLevelILOperation = 73;
pub const BNLowLevelILOperation_LLIL_BOOL_TO_INT: BNLowLevelILOperation = 74;
pub const BNLowLevelILOperation_LLIL_ADD_OVERFLOW: BNLowLevelILOperation = 75;
pub const BNLowLevelILOperation_LLIL_SYSCALL: BNLowLevelILOperation = 76;
pub const BNLowLevelILOperation_LLIL_BP: BNLowLevelILOperation = 77;
pub const BNLowLevelILOperation_LLIL_TRAP: BNLowLevelILOperation = 78;
pub const BNLowLevelILOperation_LLIL_INTRINSIC: BNLowLevelILOperation = 79;
pub const BNLowLevelILOperation_LLIL_UNDEF: BNLowLevelILOperation = 80;
pub const BNLowLevelILOperation_LLIL_UNIMPL: BNLowLevelILOperation = 81;
pub const BNLowLevelILOperation_LLIL_UNIMPL_MEM: BNLowLevelILOperation = 82;
pub const BNLowLevelILOperation_LLIL_FADD: BNLowLevelILOperation = 83;
pub const BNLowLevelILOperation_LLIL_FSUB: BNLowLevelILOperation = 84;
pub const BNLowLevelILOperation_LLIL_FMUL: BNLowLevelILOperation = 85;
pub const BNLowLevelILOperation_LLIL_FDIV: BNLowLevelILOperation = 86;
pub const BNLowLevelILOperation_LLIL_FSQRT: BNLowLevelILOperation = 87;
pub const BNLowLevelILOperation_LLIL_FNEG: BNLowLevelILOperation = 88;
pub const BNLowLevelILOperation_LLIL_FABS: BNLowLevelILOperation = 89;
pub const BNLowLevelILOperation_LLIL_FLOAT_TO_INT: BNLowLevelILOperation = 90;
pub const BNLowLevelILOperation_LLIL_INT_TO_FLOAT: BNLowLevelILOperation = 91;
pub const BNLowLevelILOperation_LLIL_FLOAT_CONV: BNLowLevelILOperation = 92;
pub const BNLowLevelILOperation_LLIL_ROUND_TO_INT: BNLowLevelILOperation = 93;
pub const BNLowLevelILOperation_LLIL_FLOOR: BNLowLevelILOperation = 94;
pub const BNLowLevelILOperation_LLIL_CEIL: BNLowLevelILOperation = 95;
pub const BNLowLevelILOperation_LLIL_FTRUNC: BNLowLevelILOperation = 96;
pub const BNLowLevelILOperation_LLIL_FCMP_E: BNLowLevelILOperation = 97;
pub const BNLowLevelILOperation_LLIL_FCMP_NE: BNLowLevelILOperation = 98;
pub const BNLowLevelILOperation_LLIL_FCMP_LT: BNLowLevelILOperation = 99;
pub const BNLowLevelILOperation_LLIL_FCMP_LE: BNLowLevelILOperation = 100;
pub const BNLowLevelILOperation_LLIL_FCMP_GE: BNLowLevelILOperation = 101;
pub const BNLowLevelILOperation_LLIL_FCMP_GT: BNLowLevelILOperation = 102;
pub const BNLowLevelILOperation_LLIL_FCMP_O: BNLowLevelILOperation = 103;
pub const BNLowLevelILOperation_LLIL_FCMP_UO: BNLowLevelILOperation = 104;
pub const BNLowLevelILOperation_LLIL_SET_REG_SSA: BNLowLevelILOperation = 105;
pub const BNLowLevelILOperation_LLIL_SET_REG_SSA_PARTIAL: BNLowLevelILOperation = 106;
pub const BNLowLevelILOperation_LLIL_SET_REG_SPLIT_SSA: BNLowLevelILOperation = 107;
pub const BNLowLevelILOperation_LLIL_SET_REG_STACK_REL_SSA: BNLowLevelILOperation = 108;
pub const BNLowLevelILOperation_LLIL_SET_REG_STACK_ABS_SSA: BNLowLevelILOperation = 109;
pub const BNLowLevelILOperation_LLIL_REG_SPLIT_DEST_SSA: BNLowLevelILOperation = 110;
pub const BNLowLevelILOperation_LLIL_REG_STACK_DEST_SSA: BNLowLevelILOperation = 111;
pub const BNLowLevelILOperation_LLIL_REG_SSA: BNLowLevelILOperation = 112;
pub const BNLowLevelILOperation_LLIL_REG_SSA_PARTIAL: BNLowLevelILOperation = 113;
pub const BNLowLevelILOperation_LLIL_REG_SPLIT_SSA: BNLowLevelILOperation = 114;
pub const BNLowLevelILOperation_LLIL_REG_STACK_REL_SSA: BNLowLevelILOperation = 115;
pub const BNLowLevelILOperation_LLIL_REG_STACK_ABS_SSA: BNLowLevelILOperation = 116;
pub const BNLowLevelILOperation_LLIL_REG_STACK_FREE_REL_SSA: BNLowLevelILOperation = 117;
pub const BNLowLevelILOperation_LLIL_REG_STACK_FREE_ABS_SSA: BNLowLevelILOperation = 118;
pub const BNLowLevelILOperation_LLIL_SET_FLAG_SSA: BNLowLevelILOperation = 119;
pub const BNLowLevelILOperation_LLIL_FLAG_SSA: BNLowLevelILOperation = 120;
pub const BNLowLevelILOperation_LLIL_FLAG_BIT_SSA: BNLowLevelILOperation = 121;
pub const BNLowLevelILOperation_LLIL_CALL_SSA: BNLowLevelILOperation = 122;
pub const BNLowLevelILOperation_LLIL_SYSCALL_SSA: BNLowLevelILOperation = 123;
pub const BNLowLevelILOperation_LLIL_TAILCALL_SSA: BNLowLevelILOperation = 124;
pub const BNLowLevelILOperation_LLIL_CALL_PARAM: BNLowLevelILOperation = 125;
pub const BNLowLevelILOperation_LLIL_CALL_STACK_SSA: BNLowLevelILOperation = 126;
pub const BNLowLevelILOperation_LLIL_CALL_OUTPUT_SSA: BNLowLevelILOperation = 127;
pub const BNLowLevelILOperation_LLIL_LOAD_SSA: BNLowLevelILOperation = 128;
pub const BNLowLevelILOperation_LLIL_STORE_SSA: BNLowLevelILOperation = 129;
pub const BNLowLevelILOperation_LLIL_INTRINSIC_SSA: BNLowLevelILOperation = 130;
pub const BNLowLevelILOperation_LLIL_REG_PHI: BNLowLevelILOperation = 131;
pub const BNLowLevelILOperation_LLIL_REG_STACK_PHI: BNLowLevelILOperation = 132;
pub const BNLowLevelILOperation_LLIL_FLAG_PHI: BNLowLevelILOperation = 133;
pub const BNLowLevelILOperation_LLIL_MEM_PHI: BNLowLevelILOperation = 134;
pub type BNLowLevelILOperation = ::std::os::raw::c_uint;
pub const BNLowLevelILFlagCondition_LLFC_E: BNLowLevelILFlagCondition = 0;
pub const BNLowLevelILFlagCondition_LLFC_NE: BNLowLevelILFlagCondition = 1;
pub const BNLowLevelILFlagCondition_LLFC_SLT: BNLowLevelILFlagCondition = 2;
pub const BNLowLevelILFlagCondition_LLFC_ULT: BNLowLevelILFlagCondition = 3;
pub const BNLowLevelILFlagCondition_LLFC_SLE: BNLowLevelILFlagCondition = 4;
pub const BNLowLevelILFlagCondition_LLFC_ULE: BNLowLevelILFlagCondition = 5;
pub const BNLowLevelILFlagCondition_LLFC_SGE: BNLowLevelILFlagCondition = 6;
pub const BNLowLevelILFlagCondition_LLFC_UGE: BNLowLevelILFlagCondition = 7;
pub const BNLowLevelILFlagCondition_LLFC_SGT: BNLowLevelILFlagCondition = 8;
pub const BNLowLevelILFlagCondition_LLFC_UGT: BNLowLevelILFlagCondition = 9;
pub const BNLowLevelILFlagCondition_LLFC_NEG: BNLowLevelILFlagCondition = 10;
pub const BNLowLevelILFlagCondition_LLFC_POS: BNLowLevelILFlagCondition = 11;
pub const BNLowLevelILFlagCondition_LLFC_O: BNLowLevelILFlagCondition = 12;
pub const BNLowLevelILFlagCondition_LLFC_NO: BNLowLevelILFlagCondition = 13;
pub const BNLowLevelILFlagCondition_LLFC_FE: BNLowLevelILFlagCondition = 14;
pub const BNLowLevelILFlagCondition_LLFC_FNE: BNLowLevelILFlagCondition = 15;
pub const BNLowLevelILFlagCondition_LLFC_FLT: BNLowLevelILFlagCondition = 16;
pub const BNLowLevelILFlagCondition_LLFC_FLE: BNLowLevelILFlagCondition = 17;
pub const BNLowLevelILFlagCondition_LLFC_FGE: BNLowLevelILFlagCondition = 18;
pub const BNLowLevelILFlagCondition_LLFC_FGT: BNLowLevelILFlagCondition = 19;
pub const BNLowLevelILFlagCondition_LLFC_FO: BNLowLevelILFlagCondition = 20;
pub const BNLowLevelILFlagCondition_LLFC_FUO: BNLowLevelILFlagCondition = 21;
pub type BNLowLevelILFlagCondition = ::std::os::raw::c_uint;
pub const BNFlagRole_SpecialFlagRole: BNFlagRole = 0;
pub const BNFlagRole_ZeroFlagRole: BNFlagRole = 1;
pub const BNFlagRole_PositiveSignFlagRole: BNFlagRole = 2;
pub const BNFlagRole_NegativeSignFlagRole: BNFlagRole = 3;
pub const BNFlagRole_CarryFlagRole: BNFlagRole = 4;
pub const BNFlagRole_OverflowFlagRole: BNFlagRole = 5;
pub const BNFlagRole_HalfCarryFlagRole: BNFlagRole = 6;
pub const BNFlagRole_EvenParityFlagRole: BNFlagRole = 7;
pub const BNFlagRole_OddParityFlagRole: BNFlagRole = 8;
pub const BNFlagRole_OrderedFlagRole: BNFlagRole = 9;
pub const BNFlagRole_UnorderedFlagRole: BNFlagRole = 10;
pub type BNFlagRole = ::std::os::raw::c_uint;
pub const BNFunctionGraphType_InvalidILViewType: BNFunctionGraphType = -1;
pub const BNFunctionGraphType_NormalFunctionGraph: BNFunctionGraphType = 0;
pub const BNFunctionGraphType_LowLevelILFunctionGraph: BNFunctionGraphType = 1;
pub const BNFunctionGraphType_LiftedILFunctionGraph: BNFunctionGraphType = 2;
pub const BNFunctionGraphType_LowLevelILSSAFormFunctionGraph: BNFunctionGraphType = 3;
pub const BNFunctionGraphType_MediumLevelILFunctionGraph: BNFunctionGraphType = 4;
pub const BNFunctionGraphType_MediumLevelILSSAFormFunctionGraph: BNFunctionGraphType = 5;
pub const BNFunctionGraphType_MappedMediumLevelILFunctionGraph: BNFunctionGraphType = 6;
pub const BNFunctionGraphType_MappedMediumLevelILSSAFormFunctionGraph: BNFunctionGraphType = 7;
pub const BNFunctionGraphType_HighLevelILFunctionGraph: BNFunctionGraphType = 8;
pub const BNFunctionGraphType_HighLevelILSSAFormFunctionGraph: BNFunctionGraphType = 9;
pub const BNFunctionGraphType_HighLevelLanguageRepresentationFunctionGraph: BNFunctionGraphType =
    10;
pub type BNFunctionGraphType = ::std::os::raw::c_int;
pub const BNDisassemblyOption_ShowAddress: BNDisassemblyOption = 0;
pub const BNDisassemblyOption_ShowOpcode: BNDisassemblyOption = 1;
pub const BNDisassemblyOption_ExpandLongOpcode: BNDisassemblyOption = 2;
pub const BNDisassemblyOption_ShowVariablesAtTopOfGraph: BNDisassemblyOption = 3;
pub const BNDisassemblyOption_ShowVariableTypesWhenAssigned: BNDisassemblyOption = 4;
pub const BNDisassemblyOption_ShowCallParameterNames: BNDisassemblyOption = 6;
pub const BNDisassemblyOption_ShowRegisterHighlight: BNDisassemblyOption = 7;
pub const BNDisassemblyOption_ShowFunctionAddress: BNDisassemblyOption = 8;
pub const BNDisassemblyOption_ShowFunctionHeader: BNDisassemblyOption = 9;
pub const BNDisassemblyOption_ShowTypeCasts: BNDisassemblyOption = 10;
pub const BNDisassemblyOption_GroupLinearDisassemblyFunctions: BNDisassemblyOption = 64;
pub const BNDisassemblyOption_HighLevelILLinearDisassembly: BNDisassemblyOption = 65;
pub const BNDisassemblyOption_WaitForIL: BNDisassemblyOption = 66;
pub const BNDisassemblyOption_IndentHLILBody: BNDisassemblyOption = 67;
pub const BNDisassemblyOption_ShowFlagUsage: BNDisassemblyOption = 128;
pub const BNDisassemblyOption_ShowStackPointer: BNDisassemblyOption = 129;
pub const BNDisassemblyOption_ShowILTypes: BNDisassemblyOption = 130;
pub const BNDisassemblyOption_ShowILOpcodes: BNDisassemblyOption = 131;
pub type BNDisassemblyOption = ::std::os::raw::c_uint;
pub const BNTypeClass_VoidTypeClass: BNTypeClass = 0;
pub const BNTypeClass_BoolTypeClass: BNTypeClass = 1;
pub const BNTypeClass_IntegerTypeClass: BNTypeClass = 2;
pub const BNTypeClass_FloatTypeClass: BNTypeClass = 3;
pub const BNTypeClass_StructureTypeClass: BNTypeClass = 4;
pub const BNTypeClass_EnumerationTypeClass: BNTypeClass = 5;
pub const BNTypeClass_PointerTypeClass: BNTypeClass = 6;
pub const BNTypeClass_ArrayTypeClass: BNTypeClass = 7;
pub const BNTypeClass_FunctionTypeClass: BNTypeClass = 8;
pub const BNTypeClass_VarArgsTypeClass: BNTypeClass = 9;
pub const BNTypeClass_ValueTypeClass: BNTypeClass = 10;
pub const BNTypeClass_NamedTypeReferenceClass: BNTypeClass = 11;
pub const BNTypeClass_WideCharTypeClass: BNTypeClass = 12;
pub type BNTypeClass = ::std::os::raw::c_uint;
pub const BNNamedTypeReferenceClass_UnknownNamedTypeClass: BNNamedTypeReferenceClass = 0;
pub const BNNamedTypeReferenceClass_TypedefNamedTypeClass: BNNamedTypeReferenceClass = 1;
pub const BNNamedTypeReferenceClass_ClassNamedTypeClass: BNNamedTypeReferenceClass = 2;
pub const BNNamedTypeReferenceClass_StructNamedTypeClass: BNNamedTypeReferenceClass = 3;
pub const BNNamedTypeReferenceClass_UnionNamedTypeClass: BNNamedTypeReferenceClass = 4;
pub const BNNamedTypeReferenceClass_EnumNamedTypeClass: BNNamedTypeReferenceClass = 5;
pub type BNNamedTypeReferenceClass = ::std::os::raw::c_uint;
pub const BNStructureVariant_ClassStructureType: BNStructureVariant = 0;
pub const BNStructureVariant_StructStructureType: BNStructureVariant = 1;
pub const BNStructureVariant_UnionStructureType: BNStructureVariant = 2;
pub type BNStructureVariant = ::std::os::raw::c_uint;
pub const BNMemberScope_NoScope: BNMemberScope = 0;
pub const BNMemberScope_StaticScope: BNMemberScope = 1;
pub const BNMemberScope_VirtualScope: BNMemberScope = 2;
pub const BNMemberScope_ThunkScope: BNMemberScope = 3;
pub const BNMemberScope_FriendScope: BNMemberScope = 4;
pub type BNMemberScope = ::std::os::raw::c_uint;
pub const BNMemberAccess_NoAccess: BNMemberAccess = 0;
pub const BNMemberAccess_PrivateAccess: BNMemberAccess = 1;
pub const BNMemberAccess_ProtectedAccess: BNMemberAccess = 2;
pub const BNMemberAccess_PublicAccess: BNMemberAccess = 3;
pub type BNMemberAccess = ::std::os::raw::c_uint;
pub const BNReferenceType_PointerReferenceType: BNReferenceType = 0;
pub const BNReferenceType_ReferenceReferenceType: BNReferenceType = 1;
pub const BNReferenceType_RValueReferenceType: BNReferenceType = 2;
pub const BNReferenceType_NoReference: BNReferenceType = 3;
pub type BNReferenceType = ::std::os::raw::c_uint;
pub const BNPointerSuffix_Ptr64Suffix: BNPointerSuffix = 0;
pub const BNPointerSuffix_UnalignedSuffix: BNPointerSuffix = 1;
pub const BNPointerSuffix_RestrictSuffix: BNPointerSuffix = 2;
pub const BNPointerSuffix_ReferenceSuffix: BNPointerSuffix = 3;
pub const BNPointerSuffix_LvalueSuffix: BNPointerSuffix = 4;
pub type BNPointerSuffix = ::std::os::raw::c_uint;
pub const BNNameType_NoNameType: BNNameType = 0;
pub const BNNameType_ConstructorNameType: BNNameType = 1;
pub const BNNameType_DestructorNameType: BNNameType = 2;
pub const BNNameType_OperatorNewNameType: BNNameType = 3;
pub const BNNameType_OperatorDeleteNameType: BNNameType = 4;
pub const BNNameType_OperatorAssignNameType: BNNameType = 5;
pub const BNNameType_OperatorRightShiftNameType: BNNameType = 6;
pub const BNNameType_OperatorLeftShiftNameType: BNNameType = 7;
pub const BNNameType_OperatorNotNameType: BNNameType = 8;
pub const BNNameType_OperatorEqualNameType: BNNameType = 9;
pub const BNNameType_OperatorNotEqualNameType: BNNameType = 10;
pub const BNNameType_OperatorArrayNameType: BNNameType = 11;
pub const BNNameType_OperatorArrowNameType: BNNameType = 12;
pub const BNNameType_OperatorStarNameType: BNNameType = 13;
pub const BNNameType_OperatorIncrementNameType: BNNameType = 14;
pub const BNNameType_OperatorDecrementNameType: BNNameType = 15;
pub const BNNameType_OperatorMinusNameType: BNNameType = 16;
pub const BNNameType_OperatorPlusNameType: BNNameType = 17;
pub const BNNameType_OperatorBitAndNameType: BNNameType = 18;
pub const BNNameType_OperatorArrowStarNameType: BNNameType = 19;
pub const BNNameType_OperatorDivideNameType: BNNameType = 20;
pub const BNNameType_OperatorModulusNameType: BNNameType = 21;
pub const BNNameType_OperatorLessThanNameType: BNNameType = 22;
pub const BNNameType_OperatorLessThanEqualNameType: BNNameType = 23;
pub const BNNameType_OperatorGreaterThanNameType: BNNameType = 24;
pub const BNNameType_OperatorGreaterThanEqualNameType: BNNameType = 25;
pub const BNNameType_OperatorCommaNameType: BNNameType = 26;
pub const BNNameType_OperatorParenthesesNameType: BNNameType = 27;
pub const BNNameType_OperatorTildeNameType: BNNameType = 28;
pub const BNNameType_OperatorXorNameType: BNNameType = 29;
pub const BNNameType_OperatorBitOrNameType: BNNameType = 30;
pub const BNNameType_OperatorLogicalAndNameType: BNNameType = 31;
pub const BNNameType_OperatorLogicalOrNameType: BNNameType = 32;
pub const BNNameType_OperatorStarEqualNameType: BNNameType = 33;
pub const BNNameType_OperatorPlusEqualNameType: BNNameType = 34;
pub const BNNameType_OperatorMinusEqualNameType: BNNameType = 35;
pub const BNNameType_OperatorDivideEqualNameType: BNNameType = 36;
pub const BNNameType_OperatorModulusEqualNameType: BNNameType = 37;
pub const BNNameType_OperatorRightShiftEqualNameType: BNNameType = 38;
pub const BNNameType_OperatorLeftShiftEqualNameType: BNNameType = 39;
pub const BNNameType_OperatorAndEqualNameType: BNNameType = 40;
pub const BNNameType_OperatorOrEqualNameType: BNNameType = 41;
pub const BNNameType_OperatorXorEqualNameType: BNNameType = 42;
pub const BNNameType_VFTableNameType: BNNameType = 43;
pub const BNNameType_VBTableNameType: BNNameType = 44;
pub const BNNameType_VCallNameType: BNNameType = 45;
pub const BNNameType_TypeofNameType: BNNameType = 46;
pub const BNNameType_LocalStaticGuardNameType: BNNameType = 47;
pub const BNNameType_StringNameType: BNNameType = 48;
pub const BNNameType_VBaseDestructorNameType: BNNameType = 49;
pub const BNNameType_VectorDeletingDestructorNameType: BNNameType = 50;
pub const BNNameType_DefaultConstructorClosureNameType: BNNameType = 51;
pub const BNNameType_ScalarDeletingDestructorNameType: BNNameType = 52;
pub const BNNameType_VectorConstructorIteratorNameType: BNNameType = 53;
pub const BNNameType_VectorDestructorIteratorNameType: BNNameType = 54;
pub const BNNameType_VectorVBaseConstructorIteratorNameType: BNNameType = 55;
pub const BNNameType_VirtualDisplacementMapNameType: BNNameType = 56;
pub const BNNameType_EHVectorConstructorIteratorNameType: BNNameType = 57;
pub const BNNameType_EHVectorDestructorIteratorNameType: BNNameType = 58;
pub const BNNameType_EHVectorVBaseConstructorIteratorNameType: BNNameType = 59;
pub const BNNameType_CopyConstructorClosureNameType: BNNameType = 60;
pub const BNNameType_UDTReturningNameType: BNNameType = 61;
pub const BNNameType_LocalVFTableNameType: BNNameType = 62;
pub const BNNameType_LocalVFTableConstructorClosureNameType: BNNameType = 63;
pub const BNNameType_OperatorNewArrayNameType: BNNameType = 64;
pub const BNNameType_OperatorDeleteArrayNameType: BNNameType = 65;
pub const BNNameType_PlacementDeleteClosureNameType: BNNameType = 66;
pub const BNNameType_PlacementDeleteClosureArrayNameType: BNNameType = 67;
pub const BNNameType_OperatorReturnTypeNameType: BNNameType = 68;
pub const BNNameType_RttiTypeDescriptor: BNNameType = 69;
pub const BNNameType_RttiBaseClassDescriptor: BNNameType = 70;
pub const BNNameType_RttiBaseClassArray: BNNameType = 71;
pub const BNNameType_RttiClassHierarchyDescriptor: BNNameType = 72;
pub const BNNameType_RttiCompleteObjectLocator: BNNameType = 73;
pub const BNNameType_OperatorUnaryMinusNameType: BNNameType = 74;
pub const BNNameType_OperatorUnaryPlusNameType: BNNameType = 75;
pub const BNNameType_OperatorUnaryBitAndNameType: BNNameType = 76;
pub const BNNameType_OperatorUnaryStarNameType: BNNameType = 77;
pub const BNNameType_OmniCallSigNameType: BNNameType = 78;
pub const BNNameType_ManagedVectorConstructorIteratorNameType: BNNameType = 79;
pub const BNNameType_ManagedVectorDestructorIteratorNameType: BNNameType = 80;
pub const BNNameType_EHVectorCopyConstructorIteratorNameType: BNNameType = 81;
pub const BNNameType_EHVectorVBaseCopyConstructorIteratorNameType: BNNameType = 82;
pub const BNNameType_DynamicInitializerNameType: BNNameType = 83;
pub const BNNameType_DynamicAtExitDestructorNameType: BNNameType = 84;
pub const BNNameType_VectorCopyConstructorIteratorNameType: BNNameType = 85;
pub const BNNameType_VectorVBaseCopyConstructorIteratorNameType: BNNameType = 86;
pub const BNNameType_ManagedVectorCopyConstructorIteratorNameType: BNNameType = 87;
pub const BNNameType_LocalStaticThreadGuardNameType: BNNameType = 88;
pub const BNNameType_UserDefinedLiteralOperatorNameType: BNNameType = 89;
pub type BNNameType = ::std::os::raw::c_uint;
pub const BNCallingConventionName_NoCallingConvention: BNCallingConventionName = 0;
pub const BNCallingConventionName_CdeclCallingConvention: BNCallingConventionName = 1;
pub const BNCallingConventionName_PascalCallingConvention: BNCallingConventionName = 2;
pub const BNCallingConventionName_ThisCallCallingConvention: BNCallingConventionName = 3;
pub const BNCallingConventionName_STDCallCallingConvention: BNCallingConventionName = 4;
pub const BNCallingConventionName_FastcallCallingConvention: BNCallingConventionName = 5;
pub const BNCallingConventionName_CLRCallCallingConvention: BNCallingConventionName = 6;
pub const BNCallingConventionName_EabiCallCallingConvention: BNCallingConventionName = 7;
pub const BNCallingConventionName_VectorCallCallingConvention: BNCallingConventionName = 8;
pub const BNCallingConventionName_SwiftCallingConvention: BNCallingConventionName = 9;
pub const BNCallingConventionName_SwiftAsyncCallingConvention: BNCallingConventionName = 10;
pub type BNCallingConventionName = ::std::os::raw::c_uint;
pub const BNStringType_AsciiString: BNStringType = 0;
pub const BNStringType_Utf16String: BNStringType = 1;
pub const BNStringType_Utf32String: BNStringType = 2;
pub const BNStringType_Utf8String: BNStringType = 3;
pub type BNStringType = ::std::os::raw::c_uint;
pub const BNIntegerDisplayType_DefaultIntegerDisplayType: BNIntegerDisplayType = 0;
pub const BNIntegerDisplayType_BinaryDisplayType: BNIntegerDisplayType = 1;
pub const BNIntegerDisplayType_SignedOctalDisplayType: BNIntegerDisplayType = 2;
pub const BNIntegerDisplayType_UnsignedOctalDisplayType: BNIntegerDisplayType = 3;
pub const BNIntegerDisplayType_SignedDecimalDisplayType: BNIntegerDisplayType = 4;
pub const BNIntegerDisplayType_UnsignedDecimalDisplayType: BNIntegerDisplayType = 5;
pub const BNIntegerDisplayType_SignedHexadecimalDisplayType: BNIntegerDisplayType = 6;
pub const BNIntegerDisplayType_UnsignedHexadecimalDisplayType: BNIntegerDisplayType = 7;
pub const BNIntegerDisplayType_CharacterConstantDisplayType: BNIntegerDisplayType = 8;
pub const BNIntegerDisplayType_PointerDisplayType: BNIntegerDisplayType = 9;
pub const BNIntegerDisplayType_FloatDisplayType: BNIntegerDisplayType = 10;
pub const BNIntegerDisplayType_DoubleDisplayType: BNIntegerDisplayType = 11;
pub const BNIntegerDisplayType_EnumerationDisplayType: BNIntegerDisplayType = 12;
pub type BNIntegerDisplayType = ::std::os::raw::c_uint;
pub const BNFlowGraphOption_FlowGraphUsesBlockHighlights: BNFlowGraphOption = 0;
pub const BNFlowGraphOption_FlowGraphUsesInstructionHighlights: BNFlowGraphOption = 1;
pub const BNFlowGraphOption_FlowGraphIncludesUserComments: BNFlowGraphOption = 2;
pub const BNFlowGraphOption_FlowGraphAllowsPatching: BNFlowGraphOption = 3;
pub const BNFlowGraphOption_FlowGraphAllowsInlineInstructionEditing: BNFlowGraphOption = 4;
pub const BNFlowGraphOption_FlowGraphShowsSecondaryRegisterHighlighting: BNFlowGraphOption = 5;
pub type BNFlowGraphOption = ::std::os::raw::c_uint;
pub const BNILInstructionAttribute_ILAllowDeadStoreElimination: BNILInstructionAttribute = 1;
pub const BNILInstructionAttribute_ILPreventDeadStoreElimination: BNILInstructionAttribute = 2;
pub const BNILInstructionAttribute_MLILAssumePossibleUse: BNILInstructionAttribute = 4;
pub type BNILInstructionAttribute = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLowLevelILInstruction {
    pub operation: BNLowLevelILOperation,
    pub attributes: u32,
    pub size: usize,
    pub flags: u32,
    pub sourceOperand: u32,
    pub operands: [u64; 4usize],
    pub address: u64,
}
#[test]
fn bindgen_test_layout_BNLowLevelILInstruction() {
    const UNINIT: ::std::mem::MaybeUninit<BNLowLevelILInstruction> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNLowLevelILInstruction>(),
        64usize,
        concat!("Size of: ", stringify!(BNLowLevelILInstruction))
    );
    assert_eq!(
        ::std::mem::align_of::<BNLowLevelILInstruction>(),
        8usize,
        concat!("Alignment of ", stringify!(BNLowLevelILInstruction))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operation) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILInstruction),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attributes) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILInstruction),
            "::",
            stringify!(attributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILInstruction),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILInstruction),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sourceOperand) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILInstruction),
            "::",
            stringify!(sourceOperand)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operands) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILInstruction),
            "::",
            stringify!(operands)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILInstruction),
            "::",
            stringify!(address)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLowLevelILLabel {
    pub resolved: bool,
    pub ref_: usize,
    pub operand: usize,
}
#[test]
fn bindgen_test_layout_BNLowLevelILLabel() {
    const UNINIT: ::std::mem::MaybeUninit<BNLowLevelILLabel> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNLowLevelILLabel>(),
        24usize,
        concat!("Size of: ", stringify!(BNLowLevelILLabel))
    );
    assert_eq!(
        ::std::mem::align_of::<BNLowLevelILLabel>(),
        8usize,
        concat!("Alignment of ", stringify!(BNLowLevelILLabel))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resolved) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILLabel),
            "::",
            stringify!(resolved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ref_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILLabel),
            "::",
            stringify!(ref_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operand) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLowLevelILLabel),
            "::",
            stringify!(operand)
        )
    );
}
pub const BNImplicitRegisterExtend_NoExtend: BNImplicitRegisterExtend = 0;
pub const BNImplicitRegisterExtend_ZeroExtendToFullWidth: BNImplicitRegisterExtend = 1;
pub const BNImplicitRegisterExtend_SignExtendToFullWidth: BNImplicitRegisterExtend = 2;
pub type BNImplicitRegisterExtend = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRegisterInfo {
    pub fullWidthRegister: u32,
    pub offset: usize,
    pub size: usize,
    pub extend: BNImplicitRegisterExtend,
}
#[test]
fn bindgen_test_layout_BNRegisterInfo() {
    const UNINIT: ::std::mem::MaybeUninit<BNRegisterInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNRegisterInfo>(),
        32usize,
        concat!("Size of: ", stringify!(BNRegisterInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<BNRegisterInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(BNRegisterInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fullWidthRegister) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterInfo),
            "::",
            stringify!(fullWidthRegister)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterInfo),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterInfo),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extend) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterInfo),
            "::",
            stringify!(extend)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRegisterStackInfo {
    pub firstStorageReg: u32,
    pub firstTopRelativeReg: u32,
    pub storageCount: u32,
    pub topRelativeCount: u32,
    pub stackTopReg: u32,
}
#[test]
fn bindgen_test_layout_BNRegisterStackInfo() {
    const UNINIT: ::std::mem::MaybeUninit<BNRegisterStackInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNRegisterStackInfo>(),
        20usize,
        concat!("Size of: ", stringify!(BNRegisterStackInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<BNRegisterStackInfo>(),
        4usize,
        concat!("Alignment of ", stringify!(BNRegisterStackInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).firstStorageReg) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterStackInfo),
            "::",
            stringify!(firstStorageReg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).firstTopRelativeReg) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterStackInfo),
            "::",
            stringify!(firstTopRelativeReg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).storageCount) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterStackInfo),
            "::",
            stringify!(storageCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).topRelativeCount) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterStackInfo),
            "::",
            stringify!(topRelativeCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stackTopReg) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterStackInfo),
            "::",
            stringify!(stackTopReg)
        )
    );
}
pub const BNRegisterValueType_UndeterminedValue: BNRegisterValueType = 0;
pub const BNRegisterValueType_EntryValue: BNRegisterValueType = 1;
pub const BNRegisterValueType_ConstantValue: BNRegisterValueType = 2;
pub const BNRegisterValueType_ConstantPointerValue: BNRegisterValueType = 3;
pub const BNRegisterValueType_ExternalPointerValue: BNRegisterValueType = 4;
pub const BNRegisterValueType_StackFrameOffset: BNRegisterValueType = 5;
pub const BNRegisterValueType_ReturnAddressValue: BNRegisterValueType = 6;
pub const BNRegisterValueType_ImportedAddressValue: BNRegisterValueType = 7;
pub const BNRegisterValueType_SignedRangeValue: BNRegisterValueType = 8;
pub const BNRegisterValueType_UnsignedRangeValue: BNRegisterValueType = 9;
pub const BNRegisterValueType_LookupTableValue: BNRegisterValueType = 10;
pub const BNRegisterValueType_InSetOfValues: BNRegisterValueType = 11;
pub const BNRegisterValueType_NotInSetOfValues: BNRegisterValueType = 12;
pub const BNRegisterValueType_ConstantDataValue: BNRegisterValueType = 32768;
pub const BNRegisterValueType_ConstantDataZeroExtendValue: BNRegisterValueType = 32769;
pub const BNRegisterValueType_ConstantDataSignExtendValue: BNRegisterValueType = 32770;
pub const BNRegisterValueType_ConstantDataAggregateValue: BNRegisterValueType = 32771;
pub type BNRegisterValueType = ::std::os::raw::c_uint;
pub const BNDataFlowQueryOption_FromAddressesInLookupTableQueryOption: BNDataFlowQueryOption = 0;
pub type BNDataFlowQueryOption = ::std::os::raw::c_uint;
pub const BNPluginOrigin_OfficialPluginOrigin: BNPluginOrigin = 0;
pub const BNPluginOrigin_CommunityPluginOrigin: BNPluginOrigin = 1;
pub const BNPluginOrigin_OtherPluginOrigin: BNPluginOrigin = 2;
pub type BNPluginOrigin = ::std::os::raw::c_uint;
pub const BNPluginStatus_NotInstalledPluginStatus: BNPluginStatus = 0;
pub const BNPluginStatus_InstalledPluginStatus: BNPluginStatus = 1;
pub const BNPluginStatus_EnabledPluginStatus: BNPluginStatus = 2;
pub const BNPluginStatus_UpdateAvailablePluginStatus: BNPluginStatus = 16;
pub const BNPluginStatus_DeletePendingPluginStatus: BNPluginStatus = 32;
pub const BNPluginStatus_UpdatePendingPluginStatus: BNPluginStatus = 64;
pub const BNPluginStatus_DisablePendingPluginStatus: BNPluginStatus = 128;
pub const BNPluginStatus_PendingRestartPluginStatus: BNPluginStatus = 512;
pub const BNPluginStatus_BeingUpdatedPluginStatus: BNPluginStatus = 1024;
pub const BNPluginStatus_BeingDeletedPluginStatus: BNPluginStatus = 2048;
pub const BNPluginStatus_DependenciesBeingInstalledStatus: BNPluginStatus = 4096;
pub type BNPluginStatus = ::std::os::raw::c_uint;
pub const BNPluginType_CorePluginType: BNPluginType = 0;
pub const BNPluginType_UiPluginType: BNPluginType = 1;
pub const BNPluginType_ArchitecturePluginType: BNPluginType = 2;
pub const BNPluginType_BinaryViewPluginType: BNPluginType = 3;
pub const BNPluginType_HelperPluginType: BNPluginType = 4;
pub type BNPluginType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLookupTableEntry {
    pub fromValues: *mut i64,
    pub fromCount: usize,
    pub toValue: i64,
}
#[test]
fn bindgen_test_layout_BNLookupTableEntry() {
    const UNINIT: ::std::mem::MaybeUninit<BNLookupTableEntry> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNLookupTableEntry>(),
        24usize,
        concat!("Size of: ", stringify!(BNLookupTableEntry))
    );
    assert_eq!(
        ::std::mem::align_of::<BNLookupTableEntry>(),
        8usize,
        concat!("Alignment of ", stringify!(BNLookupTableEntry))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fromValues) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLookupTableEntry),
            "::",
            stringify!(fromValues)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fromCount) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLookupTableEntry),
            "::",
            stringify!(fromCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).toValue) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLookupTableEntry),
            "::",
            stringify!(toValue)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRegisterValue {
    pub state: BNRegisterValueType,
    pub value: i64,
    pub offset: i64,
    pub size: usize,
}
#[test]
fn bindgen_test_layout_BNRegisterValue() {
    const UNINIT: ::std::mem::MaybeUninit<BNRegisterValue> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNRegisterValue>(),
        32usize,
        concat!("Size of: ", stringify!(BNRegisterValue))
    );
    assert_eq!(
        ::std::mem::align_of::<BNRegisterValue>(),
        8usize,
        concat!("Alignment of ", stringify!(BNRegisterValue))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterValue),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterValue),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterValue),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterValue),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRegisterValueWithConfidence {
    pub value: BNRegisterValue,
    pub confidence: u8,
}
#[test]
fn bindgen_test_layout_BNRegisterValueWithConfidence() {
    const UNINIT: ::std::mem::MaybeUninit<BNRegisterValueWithConfidence> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNRegisterValueWithConfidence>(),
        40usize,
        concat!("Size of: ", stringify!(BNRegisterValueWithConfidence))
    );
    assert_eq!(
        ::std::mem::align_of::<BNRegisterValueWithConfidence>(),
        8usize,
        concat!("Alignment of ", stringify!(BNRegisterValueWithConfidence))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterValueWithConfidence),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).confidence) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterValueWithConfidence),
            "::",
            stringify!(confidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNValueRange {
    pub start: u64,
    pub end: u64,
    pub step: u64,
}
#[test]
fn bindgen_test_layout_BNValueRange() {
    const UNINIT: ::std::mem::MaybeUninit<BNValueRange> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNValueRange>(),
        24usize,
        concat!("Size of: ", stringify!(BNValueRange))
    );
    assert_eq!(
        ::std::mem::align_of::<BNValueRange>(),
        8usize,
        concat!("Alignment of ", stringify!(BNValueRange))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNValueRange),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNValueRange),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).step) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNValueRange),
            "::",
            stringify!(step)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNPossibleValueSet {
    pub state: BNRegisterValueType,
    pub value: i64,
    pub offset: i64,
    pub size: usize,
    pub ranges: *mut BNValueRange,
    pub valueSet: *mut i64,
    pub table: *mut BNLookupTableEntry,
    pub count: usize,
}
#[test]
fn bindgen_test_layout_BNPossibleValueSet() {
    const UNINIT: ::std::mem::MaybeUninit<BNPossibleValueSet> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNPossibleValueSet>(),
        64usize,
        concat!("Size of: ", stringify!(BNPossibleValueSet))
    );
    assert_eq!(
        ::std::mem::align_of::<BNPossibleValueSet>(),
        8usize,
        concat!("Alignment of ", stringify!(BNPossibleValueSet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPossibleValueSet),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPossibleValueSet),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPossibleValueSet),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPossibleValueSet),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ranges) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPossibleValueSet),
            "::",
            stringify!(ranges)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).valueSet) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPossibleValueSet),
            "::",
            stringify!(valueSet)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).table) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPossibleValueSet),
            "::",
            stringify!(table)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPossibleValueSet),
            "::",
            stringify!(count)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRegisterOrConstant {
    pub constant: bool,
    pub reg: u32,
    pub value: u64,
}
#[test]
fn bindgen_test_layout_BNRegisterOrConstant() {
    const UNINIT: ::std::mem::MaybeUninit<BNRegisterOrConstant> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNRegisterOrConstant>(),
        16usize,
        concat!("Size of: ", stringify!(BNRegisterOrConstant))
    );
    assert_eq!(
        ::std::mem::align_of::<BNRegisterOrConstant>(),
        8usize,
        concat!("Alignment of ", stringify!(BNRegisterOrConstant))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).constant) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterOrConstant),
            "::",
            stringify!(constant)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reg) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterOrConstant),
            "::",
            stringify!(reg)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRegisterOrConstant),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDataVariable {
    pub address: u64,
    pub type_: *mut BNType,
    pub autoDiscovered: bool,
    pub typeConfidence: u8,
}
#[test]
fn bindgen_test_layout_BNDataVariable() {
    const UNINIT: ::std::mem::MaybeUninit<BNDataVariable> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNDataVariable>(),
        24usize,
        concat!("Size of: ", stringify!(BNDataVariable))
    );
    assert_eq!(
        ::std::mem::align_of::<BNDataVariable>(),
        8usize,
        concat!("Alignment of ", stringify!(BNDataVariable))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariable),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariable),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).autoDiscovered) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariable),
            "::",
            stringify!(autoDiscovered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeConfidence) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariable),
            "::",
            stringify!(typeConfidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDataVariableAndName {
    pub address: u64,
    pub type_: *mut BNType,
    pub name: *mut ::std::os::raw::c_char,
    pub autoDiscovered: bool,
    pub typeConfidence: u8,
}
#[test]
fn bindgen_test_layout_BNDataVariableAndName() {
    const UNINIT: ::std::mem::MaybeUninit<BNDataVariableAndName> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNDataVariableAndName>(),
        32usize,
        concat!("Size of: ", stringify!(BNDataVariableAndName))
    );
    assert_eq!(
        ::std::mem::align_of::<BNDataVariableAndName>(),
        8usize,
        concat!("Alignment of ", stringify!(BNDataVariableAndName))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariableAndName),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariableAndName),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariableAndName),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).autoDiscovered) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariableAndName),
            "::",
            stringify!(autoDiscovered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeConfidence) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariableAndName),
            "::",
            stringify!(typeConfidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNDataVariableAndNameAndDebugParser {
    pub address: u64,
    pub type_: *mut BNType,
    pub name: *mut ::std::os::raw::c_char,
    pub parser: *mut ::std::os::raw::c_char,
    pub autoDiscovered: bool,
    pub typeConfidence: u8,
}
#[test]
fn bindgen_test_layout_BNDataVariableAndNameAndDebugParser() {
    const UNINIT: ::std::mem::MaybeUninit<BNDataVariableAndNameAndDebugParser> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNDataVariableAndNameAndDebugParser>(),
        40usize,
        concat!("Size of: ", stringify!(BNDataVariableAndNameAndDebugParser))
    );
    assert_eq!(
        ::std::mem::align_of::<BNDataVariableAndNameAndDebugParser>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(BNDataVariableAndNameAndDebugParser)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariableAndNameAndDebugParser),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariableAndNameAndDebugParser),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariableAndNameAndDebugParser),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parser) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariableAndNameAndDebugParser),
            "::",
            stringify!(parser)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).autoDiscovered) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariableAndNameAndDebugParser),
            "::",
            stringify!(autoDiscovered)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeConfidence) as usize - ptr as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(BNDataVariableAndNameAndDebugParser),
            "::",
            stringify!(typeConfidence)
        )
    );
}
pub const BNMediumLevelILOperation_MLIL_NOP: BNMediumLevelILOperation = 0;
pub const BNMediumLevelILOperation_MLIL_SET_VAR: BNMediumLevelILOperation = 1;
pub const BNMediumLevelILOperation_MLIL_SET_VAR_FIELD: BNMediumLevelILOperation = 2;
pub const BNMediumLevelILOperation_MLIL_SET_VAR_SPLIT: BNMediumLevelILOperation = 3;
pub const BNMediumLevelILOperation_MLIL_LOAD: BNMediumLevelILOperation = 4;
pub const BNMediumLevelILOperation_MLIL_LOAD_STRUCT: BNMediumLevelILOperation = 5;
pub const BNMediumLevelILOperation_MLIL_STORE: BNMediumLevelILOperation = 6;
pub const BNMediumLevelILOperation_MLIL_STORE_STRUCT: BNMediumLevelILOperation = 7;
pub const BNMediumLevelILOperation_MLIL_VAR: BNMediumLevelILOperation = 8;
pub const BNMediumLevelILOperation_MLIL_VAR_FIELD: BNMediumLevelILOperation = 9;
pub const BNMediumLevelILOperation_MLIL_VAR_SPLIT: BNMediumLevelILOperation = 10;
pub const BNMediumLevelILOperation_MLIL_ADDRESS_OF: BNMediumLevelILOperation = 11;
pub const BNMediumLevelILOperation_MLIL_ADDRESS_OF_FIELD: BNMediumLevelILOperation = 12;
pub const BNMediumLevelILOperation_MLIL_CONST: BNMediumLevelILOperation = 13;
pub const BNMediumLevelILOperation_MLIL_CONST_DATA: BNMediumLevelILOperation = 14;
pub const BNMediumLevelILOperation_MLIL_CONST_PTR: BNMediumLevelILOperation = 15;
pub const BNMediumLevelILOperation_MLIL_EXTERN_PTR: BNMediumLevelILOperation = 16;
pub const BNMediumLevelILOperation_MLIL_FLOAT_CONST: BNMediumLevelILOperation = 17;
pub const BNMediumLevelILOperation_MLIL_IMPORT: BNMediumLevelILOperation = 18;
pub const BNMediumLevelILOperation_MLIL_ADD: BNMediumLevelILOperation = 19;
pub const BNMediumLevelILOperation_MLIL_ADC: BNMediumLevelILOperation = 20;
pub const BNMediumLevelILOperation_MLIL_SUB: BNMediumLevelILOperation = 21;
pub const BNMediumLevelILOperation_MLIL_SBB: BNMediumLevelILOperation = 22;
pub const BNMediumLevelILOperation_MLIL_AND: BNMediumLevelILOperation = 23;
pub const BNMediumLevelILOperation_MLIL_OR: BNMediumLevelILOperation = 24;
pub const BNMediumLevelILOperation_MLIL_XOR: BNMediumLevelILOperation = 25;
pub const BNMediumLevelILOperation_MLIL_LSL: BNMediumLevelILOperation = 26;
pub const BNMediumLevelILOperation_MLIL_LSR: BNMediumLevelILOperation = 27;
pub const BNMediumLevelILOperation_MLIL_ASR: BNMediumLevelILOperation = 28;
pub const BNMediumLevelILOperation_MLIL_ROL: BNMediumLevelILOperation = 29;
pub const BNMediumLevelILOperation_MLIL_RLC: BNMediumLevelILOperation = 30;
pub const BNMediumLevelILOperation_MLIL_ROR: BNMediumLevelILOperation = 31;
pub const BNMediumLevelILOperation_MLIL_RRC: BNMediumLevelILOperation = 32;
pub const BNMediumLevelILOperation_MLIL_MUL: BNMediumLevelILOperation = 33;
pub const BNMediumLevelILOperation_MLIL_MULU_DP: BNMediumLevelILOperation = 34;
pub const BNMediumLevelILOperation_MLIL_MULS_DP: BNMediumLevelILOperation = 35;
pub const BNMediumLevelILOperation_MLIL_DIVU: BNMediumLevelILOperation = 36;
pub const BNMediumLevelILOperation_MLIL_DIVU_DP: BNMediumLevelILOperation = 37;
pub const BNMediumLevelILOperation_MLIL_DIVS: BNMediumLevelILOperation = 38;
pub const BNMediumLevelILOperation_MLIL_DIVS_DP: BNMediumLevelILOperation = 39;
pub const BNMediumLevelILOperation_MLIL_MODU: BNMediumLevelILOperation = 40;
pub const BNMediumLevelILOperation_MLIL_MODU_DP: BNMediumLevelILOperation = 41;
pub const BNMediumLevelILOperation_MLIL_MODS: BNMediumLevelILOperation = 42;
pub const BNMediumLevelILOperation_MLIL_MODS_DP: BNMediumLevelILOperation = 43;
pub const BNMediumLevelILOperation_MLIL_NEG: BNMediumLevelILOperation = 44;
pub const BNMediumLevelILOperation_MLIL_NOT: BNMediumLevelILOperation = 45;
pub const BNMediumLevelILOperation_MLIL_SX: BNMediumLevelILOperation = 46;
pub const BNMediumLevelILOperation_MLIL_ZX: BNMediumLevelILOperation = 47;
pub const BNMediumLevelILOperation_MLIL_LOW_PART: BNMediumLevelILOperation = 48;
pub const BNMediumLevelILOperation_MLIL_JUMP: BNMediumLevelILOperation = 49;
pub const BNMediumLevelILOperation_MLIL_JUMP_TO: BNMediumLevelILOperation = 50;
pub const BNMediumLevelILOperation_MLIL_RET_HINT: BNMediumLevelILOperation = 51;
pub const BNMediumLevelILOperation_MLIL_CALL: BNMediumLevelILOperation = 52;
pub const BNMediumLevelILOperation_MLIL_CALL_UNTYPED: BNMediumLevelILOperation = 53;
pub const BNMediumLevelILOperation_MLIL_CALL_OUTPUT: BNMediumLevelILOperation = 54;
pub const BNMediumLevelILOperation_MLIL_CALL_PARAM: BNMediumLevelILOperation = 55;
pub const BNMediumLevelILOperation_MLIL_RET: BNMediumLevelILOperation = 56;
pub const BNMediumLevelILOperation_MLIL_NORET: BNMediumLevelILOperation = 57;
pub const BNMediumLevelILOperation_MLIL_IF: BNMediumLevelILOperation = 58;
pub const BNMediumLevelILOperation_MLIL_GOTO: BNMediumLevelILOperation = 59;
pub const BNMediumLevelILOperation_MLIL_CMP_E: BNMediumLevelILOperation = 60;
pub const BNMediumLevelILOperation_MLIL_CMP_NE: BNMediumLevelILOperation = 61;
pub const BNMediumLevelILOperation_MLIL_CMP_SLT: BNMediumLevelILOperation = 62;
pub const BNMediumLevelILOperation_MLIL_CMP_ULT: BNMediumLevelILOperation = 63;
pub const BNMediumLevelILOperation_MLIL_CMP_SLE: BNMediumLevelILOperation = 64;
pub const BNMediumLevelILOperation_MLIL_CMP_ULE: BNMediumLevelILOperation = 65;
pub const BNMediumLevelILOperation_MLIL_CMP_SGE: BNMediumLevelILOperation = 66;
pub const BNMediumLevelILOperation_MLIL_CMP_UGE: BNMediumLevelILOperation = 67;
pub const BNMediumLevelILOperation_MLIL_CMP_SGT: BNMediumLevelILOperation = 68;
pub const BNMediumLevelILOperation_MLIL_CMP_UGT: BNMediumLevelILOperation = 69;
pub const BNMediumLevelILOperation_MLIL_TEST_BIT: BNMediumLevelILOperation = 70;
pub const BNMediumLevelILOperation_MLIL_BOOL_TO_INT: BNMediumLevelILOperation = 71;
pub const BNMediumLevelILOperation_MLIL_ADD_OVERFLOW: BNMediumLevelILOperation = 72;
pub const BNMediumLevelILOperation_MLIL_SYSCALL: BNMediumLevelILOperation = 73;
pub const BNMediumLevelILOperation_MLIL_SYSCALL_UNTYPED: BNMediumLevelILOperation = 74;
pub const BNMediumLevelILOperation_MLIL_TAILCALL: BNMediumLevelILOperation = 75;
pub const BNMediumLevelILOperation_MLIL_TAILCALL_UNTYPED: BNMediumLevelILOperation = 76;
pub const BNMediumLevelILOperation_MLIL_INTRINSIC: BNMediumLevelILOperation = 77;
pub const BNMediumLevelILOperation_MLIL_FREE_VAR_SLOT: BNMediumLevelILOperation = 78;
pub const BNMediumLevelILOperation_MLIL_BP: BNMediumLevelILOperation = 79;
pub const BNMediumLevelILOperation_MLIL_TRAP: BNMediumLevelILOperation = 80;
pub const BNMediumLevelILOperation_MLIL_UNDEF: BNMediumLevelILOperation = 81;
pub const BNMediumLevelILOperation_MLIL_UNIMPL: BNMediumLevelILOperation = 82;
pub const BNMediumLevelILOperation_MLIL_UNIMPL_MEM: BNMediumLevelILOperation = 83;
pub const BNMediumLevelILOperation_MLIL_FADD: BNMediumLevelILOperation = 84;
pub const BNMediumLevelILOperation_MLIL_FSUB: BNMediumLevelILOperation = 85;
pub const BNMediumLevelILOperation_MLIL_FMUL: BNMediumLevelILOperation = 86;
pub const BNMediumLevelILOperation_MLIL_FDIV: BNMediumLevelILOperation = 87;
pub const BNMediumLevelILOperation_MLIL_FSQRT: BNMediumLevelILOperation = 88;
pub const BNMediumLevelILOperation_MLIL_FNEG: BNMediumLevelILOperation = 89;
pub const BNMediumLevelILOperation_MLIL_FABS: BNMediumLevelILOperation = 90;
pub const BNMediumLevelILOperation_MLIL_FLOAT_TO_INT: BNMediumLevelILOperation = 91;
pub const BNMediumLevelILOperation_MLIL_INT_TO_FLOAT: BNMediumLevelILOperation = 92;
pub const BNMediumLevelILOperation_MLIL_FLOAT_CONV: BNMediumLevelILOperation = 93;
pub const BNMediumLevelILOperation_MLIL_ROUND_TO_INT: BNMediumLevelILOperation = 94;
pub const BNMediumLevelILOperation_MLIL_FLOOR: BNMediumLevelILOperation = 95;
pub const BNMediumLevelILOperation_MLIL_CEIL: BNMediumLevelILOperation = 96;
pub const BNMediumLevelILOperation_MLIL_FTRUNC: BNMediumLevelILOperation = 97;
pub const BNMediumLevelILOperation_MLIL_FCMP_E: BNMediumLevelILOperation = 98;
pub const BNMediumLevelILOperation_MLIL_FCMP_NE: BNMediumLevelILOperation = 99;
pub const BNMediumLevelILOperation_MLIL_FCMP_LT: BNMediumLevelILOperation = 100;
pub const BNMediumLevelILOperation_MLIL_FCMP_LE: BNMediumLevelILOperation = 101;
pub const BNMediumLevelILOperation_MLIL_FCMP_GE: BNMediumLevelILOperation = 102;
pub const BNMediumLevelILOperation_MLIL_FCMP_GT: BNMediumLevelILOperation = 103;
pub const BNMediumLevelILOperation_MLIL_FCMP_O: BNMediumLevelILOperation = 104;
pub const BNMediumLevelILOperation_MLIL_FCMP_UO: BNMediumLevelILOperation = 105;
pub const BNMediumLevelILOperation_MLIL_SET_VAR_SSA: BNMediumLevelILOperation = 106;
pub const BNMediumLevelILOperation_MLIL_SET_VAR_SSA_FIELD: BNMediumLevelILOperation = 107;
pub const BNMediumLevelILOperation_MLIL_SET_VAR_SPLIT_SSA: BNMediumLevelILOperation = 108;
pub const BNMediumLevelILOperation_MLIL_SET_VAR_ALIASED: BNMediumLevelILOperation = 109;
pub const BNMediumLevelILOperation_MLIL_SET_VAR_ALIASED_FIELD: BNMediumLevelILOperation = 110;
pub const BNMediumLevelILOperation_MLIL_VAR_SSA: BNMediumLevelILOperation = 111;
pub const BNMediumLevelILOperation_MLIL_VAR_SSA_FIELD: BNMediumLevelILOperation = 112;
pub const BNMediumLevelILOperation_MLIL_VAR_ALIASED: BNMediumLevelILOperation = 113;
pub const BNMediumLevelILOperation_MLIL_VAR_ALIASED_FIELD: BNMediumLevelILOperation = 114;
pub const BNMediumLevelILOperation_MLIL_VAR_SPLIT_SSA: BNMediumLevelILOperation = 115;
pub const BNMediumLevelILOperation_MLIL_CALL_SSA: BNMediumLevelILOperation = 116;
pub const BNMediumLevelILOperation_MLIL_CALL_UNTYPED_SSA: BNMediumLevelILOperation = 117;
pub const BNMediumLevelILOperation_MLIL_SYSCALL_SSA: BNMediumLevelILOperation = 118;
pub const BNMediumLevelILOperation_MLIL_SYSCALL_UNTYPED_SSA: BNMediumLevelILOperation = 119;
pub const BNMediumLevelILOperation_MLIL_TAILCALL_SSA: BNMediumLevelILOperation = 120;
pub const BNMediumLevelILOperation_MLIL_TAILCALL_UNTYPED_SSA: BNMediumLevelILOperation = 121;
pub const BNMediumLevelILOperation_MLIL_CALL_PARAM_SSA: BNMediumLevelILOperation = 122;
pub const BNMediumLevelILOperation_MLIL_CALL_OUTPUT_SSA: BNMediumLevelILOperation = 123;
pub const BNMediumLevelILOperation_MLIL_LOAD_SSA: BNMediumLevelILOperation = 124;
pub const BNMediumLevelILOperation_MLIL_LOAD_STRUCT_SSA: BNMediumLevelILOperation = 125;
pub const BNMediumLevelILOperation_MLIL_STORE_SSA: BNMediumLevelILOperation = 126;
pub const BNMediumLevelILOperation_MLIL_STORE_STRUCT_SSA: BNMediumLevelILOperation = 127;
pub const BNMediumLevelILOperation_MLIL_INTRINSIC_SSA: BNMediumLevelILOperation = 128;
pub const BNMediumLevelILOperation_MLIL_FREE_VAR_SLOT_SSA: BNMediumLevelILOperation = 129;
pub const BNMediumLevelILOperation_MLIL_VAR_PHI: BNMediumLevelILOperation = 130;
pub const BNMediumLevelILOperation_MLIL_MEM_PHI: BNMediumLevelILOperation = 131;
pub type BNMediumLevelILOperation = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNMediumLevelILInstruction {
    pub operation: BNMediumLevelILOperation,
    pub attributes: u32,
    pub sourceOperand: u32,
    pub size: usize,
    pub operands: [u64; 5usize],
    pub address: u64,
}
#[test]
fn bindgen_test_layout_BNMediumLevelILInstruction() {
    const UNINIT: ::std::mem::MaybeUninit<BNMediumLevelILInstruction> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNMediumLevelILInstruction>(),
        72usize,
        concat!("Size of: ", stringify!(BNMediumLevelILInstruction))
    );
    assert_eq!(
        ::std::mem::align_of::<BNMediumLevelILInstruction>(),
        8usize,
        concat!("Alignment of ", stringify!(BNMediumLevelILInstruction))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operation) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILInstruction),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attributes) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILInstruction),
            "::",
            stringify!(attributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sourceOperand) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILInstruction),
            "::",
            stringify!(sourceOperand)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILInstruction),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operands) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILInstruction),
            "::",
            stringify!(operands)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILInstruction),
            "::",
            stringify!(address)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNMediumLevelILLabel {
    pub resolved: bool,
    pub ref_: usize,
    pub operand: usize,
}
#[test]
fn bindgen_test_layout_BNMediumLevelILLabel() {
    const UNINIT: ::std::mem::MaybeUninit<BNMediumLevelILLabel> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNMediumLevelILLabel>(),
        24usize,
        concat!("Size of: ", stringify!(BNMediumLevelILLabel))
    );
    assert_eq!(
        ::std::mem::align_of::<BNMediumLevelILLabel>(),
        8usize,
        concat!("Alignment of ", stringify!(BNMediumLevelILLabel))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resolved) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILLabel),
            "::",
            stringify!(resolved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ref_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILLabel),
            "::",
            stringify!(ref_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operand) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNMediumLevelILLabel),
            "::",
            stringify!(operand)
        )
    );
}
pub const BNVariableSourceType_StackVariableSourceType: BNVariableSourceType = 0;
pub const BNVariableSourceType_RegisterVariableSourceType: BNVariableSourceType = 1;
pub const BNVariableSourceType_FlagVariableSourceType: BNVariableSourceType = 2;
pub type BNVariableSourceType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNVariable {
    pub type_: BNVariableSourceType,
    pub index: u32,
    pub storage: i64,
}
#[test]
fn bindgen_test_layout_BNVariable() {
    const UNINIT: ::std::mem::MaybeUninit<BNVariable> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNVariable>(),
        16usize,
        concat!("Size of: ", stringify!(BNVariable))
    );
    assert_eq!(
        ::std::mem::align_of::<BNVariable>(),
        8usize,
        concat!("Alignment of ", stringify!(BNVariable))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNVariable),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNVariable),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).storage) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNVariable),
            "::",
            stringify!(storage)
        )
    );
}
pub const BNHighLevelILOperation_HLIL_NOP: BNHighLevelILOperation = 0;
pub const BNHighLevelILOperation_HLIL_BLOCK: BNHighLevelILOperation = 1;
pub const BNHighLevelILOperation_HLIL_IF: BNHighLevelILOperation = 2;
pub const BNHighLevelILOperation_HLIL_WHILE: BNHighLevelILOperation = 3;
pub const BNHighLevelILOperation_HLIL_DO_WHILE: BNHighLevelILOperation = 4;
pub const BNHighLevelILOperation_HLIL_FOR: BNHighLevelILOperation = 5;
pub const BNHighLevelILOperation_HLIL_SWITCH: BNHighLevelILOperation = 6;
pub const BNHighLevelILOperation_HLIL_CASE: BNHighLevelILOperation = 7;
pub const BNHighLevelILOperation_HLIL_BREAK: BNHighLevelILOperation = 8;
pub const BNHighLevelILOperation_HLIL_CONTINUE: BNHighLevelILOperation = 9;
pub const BNHighLevelILOperation_HLIL_JUMP: BNHighLevelILOperation = 10;
pub const BNHighLevelILOperation_HLIL_RET: BNHighLevelILOperation = 11;
pub const BNHighLevelILOperation_HLIL_NORET: BNHighLevelILOperation = 12;
pub const BNHighLevelILOperation_HLIL_GOTO: BNHighLevelILOperation = 13;
pub const BNHighLevelILOperation_HLIL_LABEL: BNHighLevelILOperation = 14;
pub const BNHighLevelILOperation_HLIL_VAR_DECLARE: BNHighLevelILOperation = 15;
pub const BNHighLevelILOperation_HLIL_VAR_INIT: BNHighLevelILOperation = 16;
pub const BNHighLevelILOperation_HLIL_ASSIGN: BNHighLevelILOperation = 17;
pub const BNHighLevelILOperation_HLIL_ASSIGN_UNPACK: BNHighLevelILOperation = 18;
pub const BNHighLevelILOperation_HLIL_VAR: BNHighLevelILOperation = 19;
pub const BNHighLevelILOperation_HLIL_STRUCT_FIELD: BNHighLevelILOperation = 20;
pub const BNHighLevelILOperation_HLIL_ARRAY_INDEX: BNHighLevelILOperation = 21;
pub const BNHighLevelILOperation_HLIL_SPLIT: BNHighLevelILOperation = 22;
pub const BNHighLevelILOperation_HLIL_DEREF: BNHighLevelILOperation = 23;
pub const BNHighLevelILOperation_HLIL_DEREF_FIELD: BNHighLevelILOperation = 24;
pub const BNHighLevelILOperation_HLIL_ADDRESS_OF: BNHighLevelILOperation = 25;
pub const BNHighLevelILOperation_HLIL_CONST: BNHighLevelILOperation = 26;
pub const BNHighLevelILOperation_HLIL_CONST_DATA: BNHighLevelILOperation = 27;
pub const BNHighLevelILOperation_HLIL_CONST_PTR: BNHighLevelILOperation = 28;
pub const BNHighLevelILOperation_HLIL_EXTERN_PTR: BNHighLevelILOperation = 29;
pub const BNHighLevelILOperation_HLIL_FLOAT_CONST: BNHighLevelILOperation = 30;
pub const BNHighLevelILOperation_HLIL_IMPORT: BNHighLevelILOperation = 31;
pub const BNHighLevelILOperation_HLIL_ADD: BNHighLevelILOperation = 32;
pub const BNHighLevelILOperation_HLIL_ADC: BNHighLevelILOperation = 33;
pub const BNHighLevelILOperation_HLIL_SUB: BNHighLevelILOperation = 34;
pub const BNHighLevelILOperation_HLIL_SBB: BNHighLevelILOperation = 35;
pub const BNHighLevelILOperation_HLIL_AND: BNHighLevelILOperation = 36;
pub const BNHighLevelILOperation_HLIL_OR: BNHighLevelILOperation = 37;
pub const BNHighLevelILOperation_HLIL_XOR: BNHighLevelILOperation = 38;
pub const BNHighLevelILOperation_HLIL_LSL: BNHighLevelILOperation = 39;
pub const BNHighLevelILOperation_HLIL_LSR: BNHighLevelILOperation = 40;
pub const BNHighLevelILOperation_HLIL_ASR: BNHighLevelILOperation = 41;
pub const BNHighLevelILOperation_HLIL_ROL: BNHighLevelILOperation = 42;
pub const BNHighLevelILOperation_HLIL_RLC: BNHighLevelILOperation = 43;
pub const BNHighLevelILOperation_HLIL_ROR: BNHighLevelILOperation = 44;
pub const BNHighLevelILOperation_HLIL_RRC: BNHighLevelILOperation = 45;
pub const BNHighLevelILOperation_HLIL_MUL: BNHighLevelILOperation = 46;
pub const BNHighLevelILOperation_HLIL_MULU_DP: BNHighLevelILOperation = 47;
pub const BNHighLevelILOperation_HLIL_MULS_DP: BNHighLevelILOperation = 48;
pub const BNHighLevelILOperation_HLIL_DIVU: BNHighLevelILOperation = 49;
pub const BNHighLevelILOperation_HLIL_DIVU_DP: BNHighLevelILOperation = 50;
pub const BNHighLevelILOperation_HLIL_DIVS: BNHighLevelILOperation = 51;
pub const BNHighLevelILOperation_HLIL_DIVS_DP: BNHighLevelILOperation = 52;
pub const BNHighLevelILOperation_HLIL_MODU: BNHighLevelILOperation = 53;
pub const BNHighLevelILOperation_HLIL_MODU_DP: BNHighLevelILOperation = 54;
pub const BNHighLevelILOperation_HLIL_MODS: BNHighLevelILOperation = 55;
pub const BNHighLevelILOperation_HLIL_MODS_DP: BNHighLevelILOperation = 56;
pub const BNHighLevelILOperation_HLIL_NEG: BNHighLevelILOperation = 57;
pub const BNHighLevelILOperation_HLIL_NOT: BNHighLevelILOperation = 58;
pub const BNHighLevelILOperation_HLIL_SX: BNHighLevelILOperation = 59;
pub const BNHighLevelILOperation_HLIL_ZX: BNHighLevelILOperation = 60;
pub const BNHighLevelILOperation_HLIL_LOW_PART: BNHighLevelILOperation = 61;
pub const BNHighLevelILOperation_HLIL_CALL: BNHighLevelILOperation = 62;
pub const BNHighLevelILOperation_HLIL_CMP_E: BNHighLevelILOperation = 63;
pub const BNHighLevelILOperation_HLIL_CMP_NE: BNHighLevelILOperation = 64;
pub const BNHighLevelILOperation_HLIL_CMP_SLT: BNHighLevelILOperation = 65;
pub const BNHighLevelILOperation_HLIL_CMP_ULT: BNHighLevelILOperation = 66;
pub const BNHighLevelILOperation_HLIL_CMP_SLE: BNHighLevelILOperation = 67;
pub const BNHighLevelILOperation_HLIL_CMP_ULE: BNHighLevelILOperation = 68;
pub const BNHighLevelILOperation_HLIL_CMP_SGE: BNHighLevelILOperation = 69;
pub const BNHighLevelILOperation_HLIL_CMP_UGE: BNHighLevelILOperation = 70;
pub const BNHighLevelILOperation_HLIL_CMP_SGT: BNHighLevelILOperation = 71;
pub const BNHighLevelILOperation_HLIL_CMP_UGT: BNHighLevelILOperation = 72;
pub const BNHighLevelILOperation_HLIL_TEST_BIT: BNHighLevelILOperation = 73;
pub const BNHighLevelILOperation_HLIL_BOOL_TO_INT: BNHighLevelILOperation = 74;
pub const BNHighLevelILOperation_HLIL_ADD_OVERFLOW: BNHighLevelILOperation = 75;
pub const BNHighLevelILOperation_HLIL_SYSCALL: BNHighLevelILOperation = 76;
pub const BNHighLevelILOperation_HLIL_TAILCALL: BNHighLevelILOperation = 77;
pub const BNHighLevelILOperation_HLIL_INTRINSIC: BNHighLevelILOperation = 78;
pub const BNHighLevelILOperation_HLIL_BP: BNHighLevelILOperation = 79;
pub const BNHighLevelILOperation_HLIL_TRAP: BNHighLevelILOperation = 80;
pub const BNHighLevelILOperation_HLIL_UNDEF: BNHighLevelILOperation = 81;
pub const BNHighLevelILOperation_HLIL_UNIMPL: BNHighLevelILOperation = 82;
pub const BNHighLevelILOperation_HLIL_UNIMPL_MEM: BNHighLevelILOperation = 83;
pub const BNHighLevelILOperation_HLIL_FADD: BNHighLevelILOperation = 84;
pub const BNHighLevelILOperation_HLIL_FSUB: BNHighLevelILOperation = 85;
pub const BNHighLevelILOperation_HLIL_FMUL: BNHighLevelILOperation = 86;
pub const BNHighLevelILOperation_HLIL_FDIV: BNHighLevelILOperation = 87;
pub const BNHighLevelILOperation_HLIL_FSQRT: BNHighLevelILOperation = 88;
pub const BNHighLevelILOperation_HLIL_FNEG: BNHighLevelILOperation = 89;
pub const BNHighLevelILOperation_HLIL_FABS: BNHighLevelILOperation = 90;
pub const BNHighLevelILOperation_HLIL_FLOAT_TO_INT: BNHighLevelILOperation = 91;
pub const BNHighLevelILOperation_HLIL_INT_TO_FLOAT: BNHighLevelILOperation = 92;
pub const BNHighLevelILOperation_HLIL_FLOAT_CONV: BNHighLevelILOperation = 93;
pub const BNHighLevelILOperation_HLIL_ROUND_TO_INT: BNHighLevelILOperation = 94;
pub const BNHighLevelILOperation_HLIL_FLOOR: BNHighLevelILOperation = 95;
pub const BNHighLevelILOperation_HLIL_CEIL: BNHighLevelILOperation = 96;
pub const BNHighLevelILOperation_HLIL_FTRUNC: BNHighLevelILOperation = 97;
pub const BNHighLevelILOperation_HLIL_FCMP_E: BNHighLevelILOperation = 98;
pub const BNHighLevelILOperation_HLIL_FCMP_NE: BNHighLevelILOperation = 99;
pub const BNHighLevelILOperation_HLIL_FCMP_LT: BNHighLevelILOperation = 100;
pub const BNHighLevelILOperation_HLIL_FCMP_LE: BNHighLevelILOperation = 101;
pub const BNHighLevelILOperation_HLIL_FCMP_GE: BNHighLevelILOperation = 102;
pub const BNHighLevelILOperation_HLIL_FCMP_GT: BNHighLevelILOperation = 103;
pub const BNHighLevelILOperation_HLIL_FCMP_O: BNHighLevelILOperation = 104;
pub const BNHighLevelILOperation_HLIL_FCMP_UO: BNHighLevelILOperation = 105;
pub const BNHighLevelILOperation_HLIL_UNREACHABLE: BNHighLevelILOperation = 106;
pub const BNHighLevelILOperation_HLIL_WHILE_SSA: BNHighLevelILOperation = 107;
pub const BNHighLevelILOperation_HLIL_DO_WHILE_SSA: BNHighLevelILOperation = 108;
pub const BNHighLevelILOperation_HLIL_FOR_SSA: BNHighLevelILOperation = 109;
pub const BNHighLevelILOperation_HLIL_VAR_INIT_SSA: BNHighLevelILOperation = 110;
pub const BNHighLevelILOperation_HLIL_ASSIGN_MEM_SSA: BNHighLevelILOperation = 111;
pub const BNHighLevelILOperation_HLIL_ASSIGN_UNPACK_MEM_SSA: BNHighLevelILOperation = 112;
pub const BNHighLevelILOperation_HLIL_VAR_SSA: BNHighLevelILOperation = 113;
pub const BNHighLevelILOperation_HLIL_ARRAY_INDEX_SSA: BNHighLevelILOperation = 114;
pub const BNHighLevelILOperation_HLIL_DEREF_SSA: BNHighLevelILOperation = 115;
pub const BNHighLevelILOperation_HLIL_DEREF_FIELD_SSA: BNHighLevelILOperation = 116;
pub const BNHighLevelILOperation_HLIL_CALL_SSA: BNHighLevelILOperation = 117;
pub const BNHighLevelILOperation_HLIL_SYSCALL_SSA: BNHighLevelILOperation = 118;
pub const BNHighLevelILOperation_HLIL_INTRINSIC_SSA: BNHighLevelILOperation = 119;
pub const BNHighLevelILOperation_HLIL_VAR_PHI: BNHighLevelILOperation = 120;
pub const BNHighLevelILOperation_HLIL_MEM_PHI: BNHighLevelILOperation = 121;
pub type BNHighLevelILOperation = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNHighLevelILInstruction {
    pub operation: BNHighLevelILOperation,
    pub attributes: u32,
    pub sourceOperand: u32,
    pub size: usize,
    pub operands: [u64; 5usize],
    pub address: u64,
    pub parent: usize,
}
#[test]
fn bindgen_test_layout_BNHighLevelILInstruction() {
    const UNINIT: ::std::mem::MaybeUninit<BNHighLevelILInstruction> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNHighLevelILInstruction>(),
        80usize,
        concat!("Size of: ", stringify!(BNHighLevelILInstruction))
    );
    assert_eq!(
        ::std::mem::align_of::<BNHighLevelILInstruction>(),
        8usize,
        concat!("Alignment of ", stringify!(BNHighLevelILInstruction))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operation) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighLevelILInstruction),
            "::",
            stringify!(operation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attributes) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighLevelILInstruction),
            "::",
            stringify!(attributes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sourceOperand) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighLevelILInstruction),
            "::",
            stringify!(sourceOperand)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighLevelILInstruction),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operands) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighLevelILInstruction),
            "::",
            stringify!(operands)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighLevelILInstruction),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighLevelILInstruction),
            "::",
            stringify!(parent)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNLogListener {
    pub context: *mut ::std::os::raw::c_void,
    pub log: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            sessionId: usize,
            level: BNLogLevel,
            msg: *const ::std::os::raw::c_char,
            logger_name: *const ::std::os::raw::c_char,
            tid: usize,
        ),
    >,
    pub close: ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub getLogLevel: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> BNLogLevel,
    >,
}
#[test]
fn bindgen_test_layout_BNLogListener() {
    const UNINIT: ::std::mem::MaybeUninit<BNLogListener> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNLogListener>(),
        32usize,
        concat!("Size of: ", stringify!(BNLogListener))
    );
    assert_eq!(
        ::std::mem::align_of::<BNLogListener>(),
        8usize,
        concat!("Alignment of ", stringify!(BNLogListener))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLogListener),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).log) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLogListener),
            "::",
            stringify!(log)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).close) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLogListener),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getLogLevel) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNLogListener),
            "::",
            stringify!(getLogLevel)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNNavigationHandler {
    pub context: *mut ::std::os::raw::c_void,
    pub getCurrentView: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_char,
    >,
    pub getCurrentOffset:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u64>,
    pub navigate: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *const ::std::os::raw::c_char,
            offset: u64,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_BNNavigationHandler() {
    const UNINIT: ::std::mem::MaybeUninit<BNNavigationHandler> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNNavigationHandler>(),
        32usize,
        concat!("Size of: ", stringify!(BNNavigationHandler))
    );
    assert_eq!(
        ::std::mem::align_of::<BNNavigationHandler>(),
        8usize,
        concat!("Alignment of ", stringify!(BNNavigationHandler))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNavigationHandler),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getCurrentView) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNavigationHandler),
            "::",
            stringify!(getCurrentView)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getCurrentOffset) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNavigationHandler),
            "::",
            stringify!(getCurrentOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).navigate) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNavigationHandler),
            "::",
            stringify!(navigate)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNNameList {
    pub name: *mut *mut ::std::os::raw::c_char,
    pub join: *mut ::std::os::raw::c_char,
    pub nameCount: usize,
}
#[test]
fn bindgen_test_layout_BNNameList() {
    const UNINIT: ::std::mem::MaybeUninit<BNNameList> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNNameList>(),
        24usize,
        concat!("Size of: ", stringify!(BNNameList))
    );
    assert_eq!(
        ::std::mem::align_of::<BNNameList>(),
        8usize,
        concat!("Alignment of ", stringify!(BNNameList))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameList),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).join) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameList),
            "::",
            stringify!(join)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameCount) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameList),
            "::",
            stringify!(nameCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNNameSpace {
    pub name: *mut *mut ::std::os::raw::c_char,
    pub join: *mut ::std::os::raw::c_char,
    pub nameCount: usize,
}
#[test]
fn bindgen_test_layout_BNNameSpace() {
    const UNINIT: ::std::mem::MaybeUninit<BNNameSpace> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNNameSpace>(),
        24usize,
        concat!("Size of: ", stringify!(BNNameSpace))
    );
    assert_eq!(
        ::std::mem::align_of::<BNNameSpace>(),
        8usize,
        concat!("Alignment of ", stringify!(BNNameSpace))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameSpace),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).join) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameSpace),
            "::",
            stringify!(join)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameCount) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameSpace),
            "::",
            stringify!(nameCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNQualifiedName {
    pub name: *mut *mut ::std::os::raw::c_char,
    pub join: *mut ::std::os::raw::c_char,
    pub nameCount: usize,
}
#[test]
fn bindgen_test_layout_BNQualifiedName() {
    const UNINIT: ::std::mem::MaybeUninit<BNQualifiedName> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNQualifiedName>(),
        24usize,
        concat!("Size of: ", stringify!(BNQualifiedName))
    );
    assert_eq!(
        ::std::mem::align_of::<BNQualifiedName>(),
        8usize,
        concat!("Alignment of ", stringify!(BNQualifiedName))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNQualifiedName),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).join) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNQualifiedName),
            "::",
            stringify!(join)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nameCount) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNQualifiedName),
            "::",
            stringify!(nameCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBinaryDataNotification {
    pub context: *mut ::std::os::raw::c_void,
    pub notificationBarrier: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, view: *mut BNBinaryView) -> u64,
    >,
    pub dataWritten: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            offset: u64,
            len: usize,
        ),
    >,
    pub dataInserted: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            offset: u64,
            len: usize,
        ),
    >,
    pub dataRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            offset: u64,
            len: u64,
        ),
    >,
    pub functionAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNFunction,
        ),
    >,
    pub functionRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNFunction,
        ),
    >,
    pub functionUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNFunction,
        ),
    >,
    pub functionUpdateRequested: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            func: *mut BNFunction,
        ),
    >,
    pub dataVariableAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            var: *mut BNDataVariable,
        ),
    >,
    pub dataVariableRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            var: *mut BNDataVariable,
        ),
    >,
    pub dataVariableUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            var: *mut BNDataVariable,
        ),
    >,
    pub dataMetadataUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            offset: u64,
        ),
    >,
    pub tagTypeUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            tagType: *mut BNTagType,
        ),
    >,
    pub tagAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            tagRef: *mut BNTagReference,
        ),
    >,
    pub tagRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            tagRef: *mut BNTagReference,
        ),
    >,
    pub tagUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            tagRef: *mut BNTagReference,
        ),
    >,
    pub symbolAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            sym: *mut BNSymbol,
        ),
    >,
    pub symbolRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            sym: *mut BNSymbol,
        ),
    >,
    pub symbolUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            sym: *mut BNSymbol,
        ),
    >,
    pub stringFound: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            type_: BNStringType,
            offset: u64,
            len: usize,
        ),
    >,
    pub stringRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            type_: BNStringType,
            offset: u64,
            len: usize,
        ),
    >,
    pub typeDefined: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            name: *mut BNQualifiedName,
            type_: *mut BNType,
        ),
    >,
    pub typeUndefined: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            name: *mut BNQualifiedName,
            type_: *mut BNType,
        ),
    >,
    pub typeReferenceChanged: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            name: *mut BNQualifiedName,
            type_: *mut BNType,
        ),
    >,
    pub typeFieldReferenceChanged: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            name: *mut BNQualifiedName,
            offset: u64,
        ),
    >,
    pub segmentAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            segment: *mut BNSegment,
        ),
    >,
    pub segmentRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            segment: *mut BNSegment,
        ),
    >,
    pub segmentUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            segment: *mut BNSegment,
        ),
    >,
    pub sectionAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            section: *mut BNSection,
        ),
    >,
    pub sectionRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            section: *mut BNSection,
        ),
    >,
    pub sectionUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            section: *mut BNSection,
        ),
    >,
    pub componentNameUpdated: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            previousName: *mut ::std::os::raw::c_char,
            component: *mut BNComponent,
        ),
    >,
    pub componentAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            component: *mut BNComponent,
        ),
    >,
    pub componentMoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            formerParent: *mut BNComponent,
            newParent: *mut BNComponent,
            component: *mut BNComponent,
        ),
    >,
    pub componentRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            formerParent: *mut BNComponent,
            component: *mut BNComponent,
        ),
    >,
    pub componentFunctionAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            component: *mut BNComponent,
            function: *mut BNFunction,
        ),
    >,
    pub componentFunctionRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            component: *mut BNComponent,
            function: *mut BNFunction,
        ),
    >,
    pub componentDataVariableAdded: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            component: *mut BNComponent,
            var: *mut BNDataVariable,
        ),
    >,
    pub componentDataVariableRemoved: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            view: *mut BNBinaryView,
            component: *mut BNComponent,
            var: *mut BNDataVariable,
        ),
    >,
}
#[test]
fn bindgen_test_layout_BNBinaryDataNotification() {
    const UNINIT: ::std::mem::MaybeUninit<BNBinaryDataNotification> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNBinaryDataNotification>(),
        320usize,
        concat!("Size of: ", stringify!(BNBinaryDataNotification))
    );
    assert_eq!(
        ::std::mem::align_of::<BNBinaryDataNotification>(),
        8usize,
        concat!("Alignment of ", stringify!(BNBinaryDataNotification))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).notificationBarrier) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(notificationBarrier)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataWritten) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(dataWritten)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataInserted) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(dataInserted)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataRemoved) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(dataRemoved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).functionAdded) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(functionAdded)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).functionRemoved) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(functionRemoved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).functionUpdated) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(functionUpdated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).functionUpdateRequested) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(functionUpdateRequested)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataVariableAdded) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(dataVariableAdded)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataVariableRemoved) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(dataVariableRemoved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataVariableUpdated) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(dataVariableUpdated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataMetadataUpdated) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(dataMetadataUpdated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tagTypeUpdated) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(tagTypeUpdated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tagAdded) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(tagAdded)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tagRemoved) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(tagRemoved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tagUpdated) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(tagUpdated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).symbolAdded) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(symbolAdded)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).symbolRemoved) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(symbolRemoved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).symbolUpdated) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(symbolUpdated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stringFound) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(stringFound)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stringRemoved) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(stringRemoved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeDefined) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(typeDefined)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeUndefined) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(typeUndefined)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeReferenceChanged) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(typeReferenceChanged)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeFieldReferenceChanged) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(typeFieldReferenceChanged)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).segmentAdded) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(segmentAdded)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).segmentRemoved) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(segmentRemoved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).segmentUpdated) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(segmentUpdated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectionAdded) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(sectionAdded)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectionRemoved) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(sectionRemoved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectionUpdated) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(sectionUpdated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).componentNameUpdated) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(componentNameUpdated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).componentAdded) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(componentAdded)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).componentMoved) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(componentMoved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).componentRemoved) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(componentRemoved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).componentFunctionAdded) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(componentFunctionAdded)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).componentFunctionRemoved) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(componentFunctionRemoved)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).componentDataVariableAdded) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(componentDataVariableAdded)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).componentDataVariableRemoved) as usize - ptr as usize
        },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBinaryDataNotification),
            "::",
            stringify!(componentDataVariableRemoved)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFileAccessor {
    pub context: *mut ::std::os::raw::c_void,
    pub getLength:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u64>,
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            dest: *mut ::std::os::raw::c_void,
            offset: u64,
            len: usize,
        ) -> usize,
    >,
    pub write: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            offset: u64,
            src: *const ::std::os::raw::c_void,
            len: usize,
        ) -> usize,
    >,
}
#[test]
fn bindgen_test_layout_BNFileAccessor() {
    const UNINIT: ::std::mem::MaybeUninit<BNFileAccessor> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNFileAccessor>(),
        32usize,
        concat!("Size of: ", stringify!(BNFileAccessor))
    );
    assert_eq!(
        ::std::mem::align_of::<BNFileAccessor>(),
        8usize,
        concat!("Alignment of ", stringify!(BNFileAccessor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFileAccessor),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getLength) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFileAccessor),
            "::",
            stringify!(getLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFileAccessor),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFileAccessor),
            "::",
            stringify!(write)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomBinaryView {
    pub context: *mut ::std::os::raw::c_void,
    pub init:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub freeObject: ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub externalRefTaken:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub externalRefReleased:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void)>,
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            dest: *mut ::std::os::raw::c_void,
            offset: u64,
            len: usize,
        ) -> usize,
    >,
    pub write: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            offset: u64,
            src: *const ::std::os::raw::c_void,
            len: usize,
        ) -> usize,
    >,
    pub insert: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            offset: u64,
            src: *const ::std::os::raw::c_void,
            len: usize,
        ) -> usize,
    >,
    pub remove: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64, len: u64) -> usize,
    >,
    pub getModification: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            offset: u64,
        ) -> BNModificationStatus,
    >,
    pub isValidOffset: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> bool,
    >,
    pub isOffsetReadable: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> bool,
    >,
    pub isOffsetWritable: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> bool,
    >,
    pub isOffsetExecutable: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> bool,
    >,
    pub isOffsetBackedByFile: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> bool,
    >,
    pub getNextValidOffset: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, offset: u64) -> u64,
    >,
    pub getStart:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u64>,
    pub getLength:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u64>,
    pub getEntryPoint:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u64>,
    pub isExecutable:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub getDefaultEndianness: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> BNEndianness,
    >,
    pub isRelocatable:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub getAddressSize:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> usize>,
    pub save: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            accessor: *mut BNFileAccessor,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_BNCustomBinaryView() {
    const UNINIT: ::std::mem::MaybeUninit<BNCustomBinaryView> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNCustomBinaryView>(),
        192usize,
        concat!("Size of: ", stringify!(BNCustomBinaryView))
    );
    assert_eq!(
        ::std::mem::align_of::<BNCustomBinaryView>(),
        8usize,
        concat!("Alignment of ", stringify!(BNCustomBinaryView))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freeObject) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(freeObject)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).externalRefTaken) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(externalRefTaken)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).externalRefReleased) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(externalRefReleased)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).insert) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(insert)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).remove) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(remove)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getModification) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(getModification)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isValidOffset) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(isValidOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isOffsetReadable) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(isOffsetReadable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isOffsetWritable) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(isOffsetWritable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isOffsetExecutable) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(isOffsetExecutable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isOffsetBackedByFile) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(isOffsetBackedByFile)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getNextValidOffset) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(getNextValidOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getStart) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(getStart)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getLength) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(getLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getEntryPoint) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(getEntryPoint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isExecutable) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(isExecutable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getDefaultEndianness) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(getDefaultEndianness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isRelocatable) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(isRelocatable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getAddressSize) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(getAddressSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).save) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryView),
            "::",
            stringify!(save)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomBinaryViewType {
    pub context: *mut ::std::os::raw::c_void,
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
        ) -> *mut BNBinaryView,
    >,
    pub parse: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
        ) -> *mut BNBinaryView,
    >,
    pub isValidForData: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, data: *mut BNBinaryView) -> bool,
    >,
    pub isDeprecated:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub getLoadSettingsForData: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut BNBinaryView,
        ) -> *mut BNSettings,
    >,
}
#[test]
fn bindgen_test_layout_BNCustomBinaryViewType() {
    const UNINIT: ::std::mem::MaybeUninit<BNCustomBinaryViewType> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNCustomBinaryViewType>(),
        48usize,
        concat!("Size of: ", stringify!(BNCustomBinaryViewType))
    );
    assert_eq!(
        ::std::mem::align_of::<BNCustomBinaryViewType>(),
        8usize,
        concat!("Alignment of ", stringify!(BNCustomBinaryViewType))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryViewType),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).create) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryViewType),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).parse) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryViewType),
            "::",
            stringify!(parse)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isValidForData) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryViewType),
            "::",
            stringify!(isValidForData)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isDeprecated) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryViewType),
            "::",
            stringify!(isDeprecated)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getLoadSettingsForData) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomBinaryViewType),
            "::",
            stringify!(getLoadSettingsForData)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTransformParameterInfo {
    pub name: *mut ::std::os::raw::c_char,
    pub longName: *mut ::std::os::raw::c_char,
    pub fixedLength: usize,
}
#[test]
fn bindgen_test_layout_BNTransformParameterInfo() {
    const UNINIT: ::std::mem::MaybeUninit<BNTransformParameterInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNTransformParameterInfo>(),
        24usize,
        concat!("Size of: ", stringify!(BNTransformParameterInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<BNTransformParameterInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(BNTransformParameterInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTransformParameterInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).longName) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTransformParameterInfo),
            "::",
            stringify!(longName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fixedLength) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTransformParameterInfo),
            "::",
            stringify!(fixedLength)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTransformParameter {
    pub name: *const ::std::os::raw::c_char,
    pub value: *mut BNDataBuffer,
}
#[test]
fn bindgen_test_layout_BNTransformParameter() {
    const UNINIT: ::std::mem::MaybeUninit<BNTransformParameter> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNTransformParameter>(),
        16usize,
        concat!("Size of: ", stringify!(BNTransformParameter))
    );
    assert_eq!(
        ::std::mem::align_of::<BNTransformParameter>(),
        8usize,
        concat!("Alignment of ", stringify!(BNTransformParameter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTransformParameter),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTransformParameter),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomTransform {
    pub context: *mut ::std::os::raw::c_void,
    pub getParameters: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            count: *mut usize,
        ) -> *mut BNTransformParameterInfo,
    >,
    pub freeParameters: ::std::option::Option<
        unsafe extern "C" fn(params: *mut BNTransformParameterInfo, count: usize),
    >,
    pub decode: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            input: *mut BNDataBuffer,
            output: *mut BNDataBuffer,
            params: *mut BNTransformParameter,
            paramCount: usize,
        ) -> bool,
    >,
    pub encode: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            input: *mut BNDataBuffer,
            output: *mut BNDataBuffer,
            params: *mut BNTransformParameter,
            paramCount: usize,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_BNCustomTransform() {
    const UNINIT: ::std::mem::MaybeUninit<BNCustomTransform> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNCustomTransform>(),
        40usize,
        concat!("Size of: ", stringify!(BNCustomTransform))
    );
    assert_eq!(
        ::std::mem::align_of::<BNCustomTransform>(),
        8usize,
        concat!("Alignment of ", stringify!(BNCustomTransform))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomTransform),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getParameters) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomTransform),
            "::",
            stringify!(getParameters)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freeParameters) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomTransform),
            "::",
            stringify!(freeParameters)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).decode) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomTransform),
            "::",
            stringify!(decode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encode) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomTransform),
            "::",
            stringify!(encode)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNInstructionInfo {
    pub length: usize,
    pub branchCount: usize,
    pub archTransitionByTargetAddr: bool,
    pub branchDelay: bool,
    pub branchType: [BNBranchType; 3usize],
    pub branchTarget: [u64; 3usize],
    pub branchArch: [*mut BNArchitecture; 3usize],
}
#[test]
fn bindgen_test_layout_BNInstructionInfo() {
    const UNINIT: ::std::mem::MaybeUninit<BNInstructionInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNInstructionInfo>(),
        80usize,
        concat!("Size of: ", stringify!(BNInstructionInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<BNInstructionInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(BNInstructionInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionInfo),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).branchCount) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionInfo),
            "::",
            stringify!(branchCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).archTransitionByTargetAddr) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionInfo),
            "::",
            stringify!(archTransitionByTargetAddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).branchDelay) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionInfo),
            "::",
            stringify!(branchDelay)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).branchType) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionInfo),
            "::",
            stringify!(branchType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).branchTarget) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionInfo),
            "::",
            stringify!(branchTarget)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).branchArch) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionInfo),
            "::",
            stringify!(branchArch)
        )
    );
}
pub const BNRelocationType_ELFGlobalRelocationType: BNRelocationType = 0;
pub const BNRelocationType_ELFCopyRelocationType: BNRelocationType = 1;
pub const BNRelocationType_ELFJumpSlotRelocationType: BNRelocationType = 2;
pub const BNRelocationType_StandardRelocationType: BNRelocationType = 3;
pub const BNRelocationType_IgnoredRelocation: BNRelocationType = 4;
pub const BNRelocationType_UnhandledRelocation: BNRelocationType = 5;
pub type BNRelocationType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNRelocationInfo {
    pub type_: BNRelocationType,
    pub pcRelative: bool,
    pub baseRelative: bool,
    pub base: u64,
    pub size: usize,
    pub truncateSize: usize,
    pub nativeType: u64,
    pub addend: usize,
    pub hasSign: bool,
    pub implicitAddend: bool,
    pub external: bool,
    pub symbolIndex: usize,
    pub sectionIndex: usize,
    pub address: u64,
    pub target: u64,
    pub dataRelocation: bool,
    pub relocationDataCache: [u8; 8usize],
    pub prev: *mut BNRelocationInfo,
    pub next: *mut BNRelocationInfo,
}
#[test]
fn bindgen_test_layout_BNRelocationInfo() {
    const UNINIT: ::std::mem::MaybeUninit<BNRelocationInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNRelocationInfo>(),
        120usize,
        concat!("Size of: ", stringify!(BNRelocationInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<BNRelocationInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(BNRelocationInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pcRelative) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(pcRelative)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseRelative) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(baseRelative)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).truncateSize) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(truncateSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nativeType) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(nativeType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).addend) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(addend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hasSign) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(hasSign)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).implicitAddend) as usize - ptr as usize },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(implicitAddend)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).external) as usize - ptr as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(external)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).symbolIndex) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(symbolIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sectionIndex) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(sectionIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(target)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dataRelocation) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(dataRelocation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).relocationDataCache) as usize - ptr as usize },
        89usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(relocationDataCache)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).prev) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(BNRelocationInfo),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNInstructionTextToken {
    pub type_: BNInstructionTextTokenType,
    pub text: *mut ::std::os::raw::c_char,
    pub value: u64,
    pub width: u64,
    pub size: usize,
    pub operand: usize,
    pub context: BNInstructionTextTokenContext,
    pub confidence: u8,
    pub address: u64,
    pub typeNames: *mut *mut ::std::os::raw::c_char,
    pub namesCount: usize,
}
#[test]
fn bindgen_test_layout_BNInstructionTextToken() {
    const UNINIT: ::std::mem::MaybeUninit<BNInstructionTextToken> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNInstructionTextToken>(),
        80usize,
        concat!("Size of: ", stringify!(BNInstructionTextToken))
    );
    assert_eq!(
        ::std::mem::align_of::<BNInstructionTextToken>(),
        8usize,
        concat!("Alignment of ", stringify!(BNInstructionTextToken))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).text) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(text)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).operand) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(operand)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).confidence) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(confidence)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).address) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeNames) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(typeNames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).namesCount) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextToken),
            "::",
            stringify!(namesCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNInstructionTextLine {
    pub tokens: *mut BNInstructionTextToken,
    pub count: usize,
}
#[test]
fn bindgen_test_layout_BNInstructionTextLine() {
    const UNINIT: ::std::mem::MaybeUninit<BNInstructionTextLine> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNInstructionTextLine>(),
        16usize,
        concat!("Size of: ", stringify!(BNInstructionTextLine))
    );
    assert_eq!(
        ::std::mem::align_of::<BNInstructionTextLine>(),
        8usize,
        concat!("Alignment of ", stringify!(BNInstructionTextLine))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextLine),
            "::",
            stringify!(tokens)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNInstructionTextLine),
            "::",
            stringify!(count)
        )
    );
}
pub const BNTypeDefinitionLineType_TypedefLineType: BNTypeDefinitionLineType = 0;
pub const BNTypeDefinitionLineType_StructDefinitionLineType: BNTypeDefinitionLineType = 1;
pub const BNTypeDefinitionLineType_StructFieldLineType: BNTypeDefinitionLineType = 2;
pub const BNTypeDefinitionLineType_StructDefinitionEndLineType: BNTypeDefinitionLineType = 3;
pub const BNTypeDefinitionLineType_EnumDefinitionLineType: BNTypeDefinitionLineType = 4;
pub const BNTypeDefinitionLineType_EnumMemberLineType: BNTypeDefinitionLineType = 5;
pub const BNTypeDefinitionLineType_EnumDefinitionEndLineType: BNTypeDefinitionLineType = 6;
pub const BNTypeDefinitionLineType_PaddingLineType: BNTypeDefinitionLineType = 7;
pub const BNTypeDefinitionLineType_UndefinedXrefLineType: BNTypeDefinitionLineType = 8;
pub const BNTypeDefinitionLineType_CollapsedPaddingLineType: BNTypeDefinitionLineType = 9;
pub type BNTypeDefinitionLineType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeDefinitionLine {
    pub lineType: BNTypeDefinitionLineType,
    pub tokens: *mut BNInstructionTextToken,
    pub count: usize,
    pub type_: *mut BNType,
    pub rootType: *mut BNType,
    pub rootTypeName: *mut ::std::os::raw::c_char,
    pub baseType: *mut BNNamedTypeReference,
    pub baseOffset: u64,
    pub offset: u64,
    pub fieldIndex: usize,
}
#[test]
fn bindgen_test_layout_BNTypeDefinitionLine() {
    const UNINIT: ::std::mem::MaybeUninit<BNTypeDefinitionLine> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNTypeDefinitionLine>(),
        80usize,
        concat!("Size of: ", stringify!(BNTypeDefinitionLine))
    );
    assert_eq!(
        ::std::mem::align_of::<BNTypeDefinitionLine>(),
        8usize,
        concat!("Alignment of ", stringify!(BNTypeDefinitionLine))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lineType) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTypeDefinitionLine),
            "::",
            stringify!(lineType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tokens) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTypeDefinitionLine),
            "::",
            stringify!(tokens)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTypeDefinitionLine),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTypeDefinitionLine),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rootType) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTypeDefinitionLine),
            "::",
            stringify!(rootType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rootTypeName) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTypeDefinitionLine),
            "::",
            stringify!(rootTypeName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseType) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTypeDefinitionLine),
            "::",
            stringify!(baseType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseOffset) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTypeDefinitionLine),
            "::",
            stringify!(baseOffset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTypeDefinitionLine),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fieldIndex) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTypeDefinitionLine),
            "::",
            stringify!(fieldIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFlagConditionForSemanticClass {
    pub semanticClass: u32,
    pub condition: BNLowLevelILFlagCondition,
}
#[test]
fn bindgen_test_layout_BNFlagConditionForSemanticClass() {
    const UNINIT: ::std::mem::MaybeUninit<BNFlagConditionForSemanticClass> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNFlagConditionForSemanticClass>(),
        8usize,
        concat!("Size of: ", stringify!(BNFlagConditionForSemanticClass))
    );
    assert_eq!(
        ::std::mem::align_of::<BNFlagConditionForSemanticClass>(),
        4usize,
        concat!("Alignment of ", stringify!(BNFlagConditionForSemanticClass))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).semanticClass) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlagConditionForSemanticClass),
            "::",
            stringify!(semanticClass)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).condition) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlagConditionForSemanticClass),
            "::",
            stringify!(condition)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNNameAndType {
    pub name: *mut ::std::os::raw::c_char,
    pub type_: *mut BNType,
    pub typeConfidence: u8,
}
#[test]
fn bindgen_test_layout_BNNameAndType() {
    const UNINIT: ::std::mem::MaybeUninit<BNNameAndType> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNNameAndType>(),
        24usize,
        concat!("Size of: ", stringify!(BNNameAndType))
    );
    assert_eq!(
        ::std::mem::align_of::<BNNameAndType>(),
        8usize,
        concat!("Alignment of ", stringify!(BNNameAndType))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameAndType),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameAndType),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).typeConfidence) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNNameAndType),
            "::",
            stringify!(typeConfidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNTypeWithConfidence {
    pub type_: *mut BNType,
    pub confidence: u8,
}
#[test]
fn bindgen_test_layout_BNTypeWithConfidence() {
    const UNINIT: ::std::mem::MaybeUninit<BNTypeWithConfidence> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNTypeWithConfidence>(),
        16usize,
        concat!("Size of: ", stringify!(BNTypeWithConfidence))
    );
    assert_eq!(
        ::std::mem::align_of::<BNTypeWithConfidence>(),
        8usize,
        concat!("Alignment of ", stringify!(BNTypeWithConfidence))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTypeWithConfidence),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).confidence) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNTypeWithConfidence),
            "::",
            stringify!(confidence)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNCustomArchitecture {
    pub context: *mut ::std::os::raw::c_void,
    pub init: ::std::option::Option<
        unsafe extern "C" fn(context: *mut ::std::os::raw::c_void, obj: *mut BNArchitecture),
    >,
    pub getEndianness: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> BNEndianness,
    >,
    pub getAddressSize:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> usize>,
    pub getDefaultIntegerSize:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> usize>,
    pub getInstructionAlignment:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> usize>,
    pub getMaxInstructionLength:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> usize>,
    pub getOpcodeDisplayLength:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> usize>,
    pub getAssociatedArchitectureByAddress: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            addr: *mut u64,
        ) -> *mut BNArchitecture,
    >,
    pub getInstructionInfo: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            maxLen: usize,
            result: *mut BNInstructionInfo,
        ) -> bool,
    >,
    pub getInstructionText: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: *mut usize,
            result: *mut *mut BNInstructionTextToken,
            count: *mut usize,
        ) -> bool,
    >,
    pub freeInstructionText: ::std::option::Option<
        unsafe extern "C" fn(tokens: *mut BNInstructionTextToken, count: usize),
    >,
    pub getInstructionLowLevelIL: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: *mut usize,
            il: *mut BNLowLevelILFunction,
        ) -> bool,
    >,
    pub getRegisterName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            reg: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getFlagName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            flag: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getFlagWriteTypeName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            flags: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getSemanticFlagClassName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            semClass: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getSemanticFlagGroupName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            semGroup: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getFullWidthRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getAllRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getAllFlags: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getAllFlagWriteTypes: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getAllSemanticFlagClasses: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getAllSemanticFlagGroups: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getFlagRole: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            flag: u32,
            semClass: u32,
        ) -> BNFlagRole,
    >,
    pub getFlagsRequiredForFlagCondition: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            cond: BNLowLevelILFlagCondition,
            semClass: u32,
            count: *mut usize,
        ) -> *mut u32,
    >,
    pub getFlagsRequiredForSemanticFlagGroup: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            semGroup: u32,
            count: *mut usize,
        ) -> *mut u32,
    >,
    pub getFlagConditionsForSemanticFlagGroup: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            semGroup: u32,
            count: *mut usize,
        ) -> *mut BNFlagConditionForSemanticClass,
    >,
    pub freeFlagConditionsForSemanticFlagGroup: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            conditions: *mut BNFlagConditionForSemanticClass,
        ),
    >,
    pub getFlagsWrittenByFlagWriteType: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            writeType: u32,
            count: *mut usize,
        ) -> *mut u32,
    >,
    pub getSemanticClassForFlagWriteType: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, writeType: u32) -> u32,
    >,
    pub getFlagWriteLowLevelIL: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            op: BNLowLevelILOperation,
            size: usize,
            flagWriteType: u32,
            flag: u32,
            operands: *mut BNRegisterOrConstant,
            operandCount: usize,
            il: *mut BNLowLevelILFunction,
        ) -> usize,
    >,
    pub getFlagConditionLowLevelIL: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            cond: BNLowLevelILFlagCondition,
            semClass: u32,
            il: *mut BNLowLevelILFunction,
        ) -> usize,
    >,
    pub getSemanticFlagGroupLowLevelIL: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            semGroup: u32,
            il: *mut BNLowLevelILFunction,
        ) -> usize,
    >,
    pub freeRegisterList: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, regs: *mut u32),
    >,
    pub getRegisterInfo: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            reg: u32,
            result: *mut BNRegisterInfo,
        ),
    >,
    pub getStackPointerRegister:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u32>,
    pub getLinkRegister:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> u32>,
    pub getGlobalRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getSystemRegisters: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getRegisterStackName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            regStack: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getAllRegisterStacks: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getRegisterStackInfo: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            regStack: u32,
            result: *mut BNRegisterStackInfo,
        ),
    >,
    pub getIntrinsicName: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            intrinsic: u32,
        ) -> *mut ::std::os::raw::c_char,
    >,
    pub getAllIntrinsics: ::std::option::Option<
        unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void, count: *mut usize) -> *mut u32,
    >,
    pub getIntrinsicInputs: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            intrinsic: u32,
            count: *mut usize,
        ) -> *mut BNNameAndType,
    >,
    pub freeNameAndTypeList: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            nt: *mut BNNameAndType,
            count: usize,
        ),
    >,
    pub getIntrinsicOutputs: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            intrinsic: u32,
            count: *mut usize,
        ) -> *mut BNTypeWithConfidence,
    >,
    pub freeTypeList: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            types: *mut BNTypeWithConfidence,
            count: usize,
        ),
    >,
    pub canAssemble:
        ::std::option::Option<unsafe extern "C" fn(ctxt: *mut ::std::os::raw::c_void) -> bool>,
    pub assemble: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            code: *const ::std::os::raw::c_char,
            addr: u64,
            result: *mut BNDataBuffer,
            errors: *mut *mut ::std::os::raw::c_char,
        ) -> bool,
    >,
    pub isNeverBranchPatchAvailable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub isAlwaysBranchPatchAvailable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub isInvertBranchPatchAvailable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub isSkipAndReturnZeroPatchAvailable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub isSkipAndReturnValuePatchAvailable: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *const u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub convertToNop: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub alwaysBranch: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub invertBranch: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut u8,
            addr: u64,
            len: usize,
        ) -> bool,
    >,
    pub skipAndReturnValue: ::std::option::Option<
        unsafe extern "C" fn(
            ctxt: *mut ::std::os::raw::c_void,
            data: *mut u8,
            addr: u64,
            len: usize,
            value: u64,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_BNCustomArchitecture() {
    const UNINIT: ::std::mem::MaybeUninit<BNCustomArchitecture> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNCustomArchitecture>(),
        480usize,
        concat!("Size of: ", stringify!(BNCustomArchitecture))
    );
    assert_eq!(
        ::std::mem::align_of::<BNCustomArchitecture>(),
        8usize,
        concat!("Alignment of ", stringify!(BNCustomArchitecture))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).context) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).init) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getEndianness) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getEndianness)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getAddressSize) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAddressSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getDefaultIntegerSize) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getDefaultIntegerSize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getInstructionAlignment) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getInstructionAlignment)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getMaxInstructionLength) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getMaxInstructionLength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getOpcodeDisplayLength) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getOpcodeDisplayLength)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).getAssociatedArchitectureByAddress) as usize - ptr as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAssociatedArchitectureByAddress)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getInstructionInfo) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getInstructionInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getInstructionText) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getInstructionText)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freeInstructionText) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(freeInstructionText)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getInstructionLowLevelIL) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getInstructionLowLevelIL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getRegisterName) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getRegisterName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getFlagName) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getFlagWriteTypeName) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagWriteTypeName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getSemanticFlagClassName) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getSemanticFlagClassName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getSemanticFlagGroupName) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getSemanticFlagGroupName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getFullWidthRegisters) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFullWidthRegisters)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getAllRegisters) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAllRegisters)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getAllFlags) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAllFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getAllFlagWriteTypes) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAllFlagWriteTypes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getAllSemanticFlagClasses) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAllSemanticFlagClasses)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getAllSemanticFlagGroups) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAllSemanticFlagGroups)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getFlagRole) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagRole)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).getFlagsRequiredForFlagCondition) as usize - ptr as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagsRequiredForFlagCondition)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).getFlagsRequiredForSemanticFlagGroup) as usize
                - ptr as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagsRequiredForSemanticFlagGroup)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).getFlagConditionsForSemanticFlagGroup) as usize
                - ptr as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagConditionsForSemanticFlagGroup)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).freeFlagConditionsForSemanticFlagGroup) as usize
                - ptr as usize
        },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(freeFlagConditionsForSemanticFlagGroup)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).getFlagsWrittenByFlagWriteType) as usize - ptr as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagsWrittenByFlagWriteType)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).getSemanticClassForFlagWriteType) as usize - ptr as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getSemanticClassForFlagWriteType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getFlagWriteLowLevelIL) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagWriteLowLevelIL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getFlagConditionLowLevelIL) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getFlagConditionLowLevelIL)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).getSemanticFlagGroupLowLevelIL) as usize - ptr as usize
        },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getSemanticFlagGroupLowLevelIL)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freeRegisterList) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(freeRegisterList)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getRegisterInfo) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getRegisterInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getStackPointerRegister) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getStackPointerRegister)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getLinkRegister) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getLinkRegister)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getGlobalRegisters) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getGlobalRegisters)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getSystemRegisters) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getSystemRegisters)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getRegisterStackName) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getRegisterStackName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getAllRegisterStacks) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAllRegisterStacks)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getRegisterStackInfo) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getRegisterStackInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getIntrinsicName) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getIntrinsicName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getAllIntrinsics) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getAllIntrinsics)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getIntrinsicInputs) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getIntrinsicInputs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freeNameAndTypeList) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(freeNameAndTypeList)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getIntrinsicOutputs) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(getIntrinsicOutputs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freeTypeList) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(freeTypeList)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).canAssemble) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(canAssemble)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).assemble) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(assemble)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isNeverBranchPatchAvailable) as usize - ptr as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(isNeverBranchPatchAvailable)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).isAlwaysBranchPatchAvailable) as usize - ptr as usize
        },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(isAlwaysBranchPatchAvailable)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).isInvertBranchPatchAvailable) as usize - ptr as usize
        },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(isInvertBranchPatchAvailable)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).isSkipAndReturnZeroPatchAvailable) as usize - ptr as usize
        },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(isSkipAndReturnZeroPatchAvailable)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).isSkipAndReturnValuePatchAvailable) as usize - ptr as usize
        },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(isSkipAndReturnValuePatchAvailable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).convertToNop) as usize - ptr as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(convertToNop)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alwaysBranch) as usize - ptr as usize },
        456usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(alwaysBranch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).invertBranch) as usize - ptr as usize },
        464usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(invertBranch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).skipAndReturnValue) as usize - ptr as usize },
        472usize,
        concat!(
            "Offset of field: ",
            stringify!(BNCustomArchitecture),
            "::",
            stringify!(skipAndReturnValue)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNBasicBlockEdge {
    pub type_: BNBranchType,
    pub target: *mut BNBasicBlock,
    pub backEdge: bool,
    pub fallThrough: bool,
}
#[test]
fn bindgen_test_layout_BNBasicBlockEdge() {
    const UNINIT: ::std::mem::MaybeUninit<BNBasicBlockEdge> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNBasicBlockEdge>(),
        24usize,
        concat!("Size of: ", stringify!(BNBasicBlockEdge))
    );
    assert_eq!(
        ::std::mem::align_of::<BNBasicBlockEdge>(),
        8usize,
        concat!("Alignment of ", stringify!(BNBasicBlockEdge))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBasicBlockEdge),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBasicBlockEdge),
            "::",
            stringify!(target)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).backEdge) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBasicBlockEdge),
            "::",
            stringify!(backEdge)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fallThrough) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(BNBasicBlockEdge),
            "::",
            stringify!(fallThrough)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNPoint {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_BNPoint() {
    const UNINIT: ::std::mem::MaybeUninit<BNPoint> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNPoint>(),
        8usize,
        concat!("Size of: ", stringify!(BNPoint))
    );
    assert_eq!(
        ::std::mem::align_of::<BNPoint>(),
        4usize,
        concat!("Alignment of ", stringify!(BNPoint))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPoint),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNPoint),
            "::",
            stringify!(y)
        )
    );
}
pub const BNThemeColor_AddressColor: BNThemeColor = 0;
pub const BNThemeColor_ModifiedColor: BNThemeColor = 1;
pub const BNThemeColor_InsertedColor: BNThemeColor = 2;
pub const BNThemeColor_NotPresentColor: BNThemeColor = 3;
pub const BNThemeColor_SelectionColor: BNThemeColor = 4;
pub const BNThemeColor_OutlineColor: BNThemeColor = 5;
pub const BNThemeColor_BackgroundHighlightDarkColor: BNThemeColor = 6;
pub const BNThemeColor_BackgroundHighlightLightColor: BNThemeColor = 7;
pub const BNThemeColor_BoldBackgroundHighlightDarkColor: BNThemeColor = 8;
pub const BNThemeColor_BoldBackgroundHighlightLightColor: BNThemeColor = 9;
pub const BNThemeColor_AlphanumericHighlightColor: BNThemeColor = 10;
pub const BNThemeColor_PrintableHighlightColor: BNThemeColor = 11;
pub const BNThemeColor_GraphBackgroundDarkColor: BNThemeColor = 12;
pub const BNThemeColor_GraphBackgroundLightColor: BNThemeColor = 13;
pub const BNThemeColor_GraphNodeDarkColor: BNThemeColor = 14;
pub const BNThemeColor_GraphNodeLightColor: BNThemeColor = 15;
pub const BNThemeColor_GraphNodeOutlineColor: BNThemeColor = 16;
pub const BNThemeColor_GraphNodeShadowColor: BNThemeColor = 17;
pub const BNThemeColor_GraphEntryNodeIndicatorColor: BNThemeColor = 18;
pub const BNThemeColor_GraphExitNodeIndicatorColor: BNThemeColor = 19;
pub const BNThemeColor_GraphExitNoreturnNodeIndicatorColor: BNThemeColor = 20;
pub const BNThemeColor_TrueBranchColor: BNThemeColor = 21;
pub const BNThemeColor_FalseBranchColor: BNThemeColor = 22;
pub const BNThemeColor_UnconditionalBranchColor: BNThemeColor = 23;
pub const BNThemeColor_AltTrueBranchColor: BNThemeColor = 24;
pub const BNThemeColor_AltFalseBranchColor: BNThemeColor = 25;
pub const BNThemeColor_AltUnconditionalBranchColor: BNThemeColor = 26;
pub const BNThemeColor_RegisterColor: BNThemeColor = 27;
pub const BNThemeColor_NumberColor: BNThemeColor = 28;
pub const BNThemeColor_CodeSymbolColor: BNThemeColor = 29;
pub const BNThemeColor_DataSymbolColor: BNThemeColor = 30;
pub const BNThemeColor_StackVariableColor: BNThemeColor = 31;
pub const BNThemeColor_ImportColor: BNThemeColor = 32;
pub const BNThemeColor_InstructionHighlightColor: BNThemeColor = 33;
pub const BNThemeColor_RelatedInstructionHighlightColor: BNThemeColor = 34;
pub const BNThemeColor_TokenHighlightColor: BNThemeColor = 35;
pub const BNThemeColor_TokenSelectionColor: BNThemeColor = 36;
pub const BNThemeColor_AnnotationColor: BNThemeColor = 37;
pub const BNThemeColor_OpcodeColor: BNThemeColor = 38;
pub const BNThemeColor_LinearDisassemblyFunctionHeaderColor: BNThemeColor = 39;
pub const BNThemeColor_LinearDisassemblyBlockColor: BNThemeColor = 40;
pub const BNThemeColor_LinearDisassemblyNoteColor: BNThemeColor = 41;
pub const BNThemeColor_LinearDisassemblySeparatorColor: BNThemeColor = 42;
pub const BNThemeColor_StringColor: BNThemeColor = 43;
pub const BNThemeColor_TypeNameColor: BNThemeColor = 44;
pub const BNThemeColor_FieldNameColor: BNThemeColor = 45;
pub const BNThemeColor_KeywordColor: BNThemeColor = 46;
pub const BNThemeColor_UncertainColor: BNThemeColor = 47;
pub const BNThemeColor_NameSpaceColor: BNThemeColor = 48;
pub const BNThemeColor_NameSpaceSeparatorColor: BNThemeColor = 49;
pub const BNThemeColor_GotoLabelColor: BNThemeColor = 50;
pub const BNThemeColor_CommentColor: BNThemeColor = 51;
pub const BNThemeColor_OperationColor: BNThemeColor = 52;
pub const BNThemeColor_BaseStructureNameColor: BNThemeColor = 53;
pub const BNThemeColor_ScriptConsoleOutputColor: BNThemeColor = 54;
pub const BNThemeColor_ScriptConsoleWarningColor: BNThemeColor = 55;
pub const BNThemeColor_ScriptConsoleErrorColor: BNThemeColor = 56;
pub const BNThemeColor_ScriptConsoleEchoColor: BNThemeColor = 57;
pub const BNThemeColor_BlueStandardHighlightColor: BNThemeColor = 58;
pub const BNThemeColor_GreenStandardHighlightColor: BNThemeColor = 59;
pub const BNThemeColor_CyanStandardHighlightColor: BNThemeColor = 60;
pub const BNThemeColor_RedStandardHighlightColor: BNThemeColor = 61;
pub const BNThemeColor_MagentaStandardHighlightColor: BNThemeColor = 62;
pub const BNThemeColor_YellowStandardHighlightColor: BNThemeColor = 63;
pub const BNThemeColor_OrangeStandardHighlightColor: BNThemeColor = 64;
pub const BNThemeColor_WhiteStandardHighlightColor: BNThemeColor = 65;
pub const BNThemeColor_BlackStandardHighlightColor: BNThemeColor = 66;
pub const BNThemeColor_MiniGraphOverlayColor: BNThemeColor = 67;
pub const BNThemeColor_FeatureMapBaseColor: BNThemeColor = 68;
pub const BNThemeColor_FeatureMapNavLineColor: BNThemeColor = 69;
pub const BNThemeColor_FeatureMapNavHighlightColor: BNThemeColor = 70;
pub const BNThemeColor_FeatureMapDataVariableColor: BNThemeColor = 71;
pub const BNThemeColor_FeatureMapAsciiStringColor: BNThemeColor = 72;
pub const BNThemeColor_FeatureMapUnicodeStringColor: BNThemeColor = 73;
pub const BNThemeColor_FeatureMapFunctionColor: BNThemeColor = 74;
pub const BNThemeColor_FeatureMapImportColor: BNThemeColor = 75;
pub const BNThemeColor_FeatureMapExternColor: BNThemeColor = 76;
pub const BNThemeColor_FeatureMapLibraryColor: BNThemeColor = 77;
pub const BNThemeColor_SidebarBackgroundColor: BNThemeColor = 78;
pub const BNThemeColor_SidebarInactiveIconColor: BNThemeColor = 79;
pub const BNThemeColor_SidebarActiveIconColor: BNThemeColor = 80;
pub const BNThemeColor_SidebarHeaderBackgroundColor: BNThemeColor = 81;
pub const BNThemeColor_SidebarHeaderTextColor: BNThemeColor = 82;
pub const BNThemeColor_SidebarWidgetBackgroundColor: BNThemeColor = 83;
pub const BNThemeColor_ActivePaneBackgroundColor: BNThemeColor = 84;
pub const BNThemeColor_InactivePaneBackgroundColor: BNThemeColor = 85;
pub const BNThemeColor_BraceOption1Color: BNThemeColor = 86;
pub const BNThemeColor_BraceOption2Color: BNThemeColor = 87;
pub const BNThemeColor_BraceOption3Color: BNThemeColor = 88;
pub const BNThemeColor_BraceOption4Color: BNThemeColor = 89;
pub const BNThemeColor_BraceOption5Color: BNThemeColor = 90;
pub const BNThemeColor_BraceOption6Color: BNThemeColor = 91;
pub type BNThemeColor = ::std::os::raw::c_uint;
pub const BNEdgePenStyle_NoPen: BNEdgePenStyle = 0;
pub const BNEdgePenStyle_SolidLine: BNEdgePenStyle = 1;
pub const BNEdgePenStyle_DashLine: BNEdgePenStyle = 2;
pub const BNEdgePenStyle_DotLine: BNEdgePenStyle = 3;
pub const BNEdgePenStyle_DashDotLine: BNEdgePenStyle = 4;
pub const BNEdgePenStyle_DashDotDotLine: BNEdgePenStyle = 5;
pub type BNEdgePenStyle = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNEdgeStyle {
    pub style: BNEdgePenStyle,
    pub width: usize,
    pub color: BNThemeColor,
}
#[test]
fn bindgen_test_layout_BNEdgeStyle() {
    const UNINIT: ::std::mem::MaybeUninit<BNEdgeStyle> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNEdgeStyle>(),
        24usize,
        concat!("Size of: ", stringify!(BNEdgeStyle))
    );
    assert_eq!(
        ::std::mem::align_of::<BNEdgeStyle>(),
        8usize,
        concat!("Alignment of ", stringify!(BNEdgeStyle))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).style) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNEdgeStyle),
            "::",
            stringify!(style)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNEdgeStyle),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNEdgeStyle),
            "::",
            stringify!(color)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNFlowGraphEdge {
    pub type_: BNBranchType,
    pub target: *mut BNFlowGraphNode,
    pub points: *mut BNPoint,
    pub pointCount: usize,
    pub backEdge: bool,
    pub style: BNEdgeStyle,
}
#[test]
fn bindgen_test_layout_BNFlowGraphEdge() {
    const UNINIT: ::std::mem::MaybeUninit<BNFlowGraphEdge> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNFlowGraphEdge>(),
        64usize,
        concat!("Size of: ", stringify!(BNFlowGraphEdge))
    );
    assert_eq!(
        ::std::mem::align_of::<BNFlowGraphEdge>(),
        8usize,
        concat!("Alignment of ", stringify!(BNFlowGraphEdge))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlowGraphEdge),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).target) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlowGraphEdge),
            "::",
            stringify!(target)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).points) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlowGraphEdge),
            "::",
            stringify!(points)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pointCount) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlowGraphEdge),
            "::",
            stringify!(pointCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).backEdge) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlowGraphEdge),
            "::",
            stringify!(backEdge)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).style) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(BNFlowGraphEdge),
            "::",
            stringify!(style)
        )
    );
}
pub const BNHighlightColorStyle_StandardHighlightColor: BNHighlightColorStyle = 0;
pub const BNHighlightColorStyle_MixedHighlightColor: BNHighlightColorStyle = 1;
pub const BNHighlightColorStyle_CustomHighlightColor: BNHighlightColorStyle = 2;
pub type BNHighlightColorStyle = ::std::os::raw::c_uint;
pub const BNHighlightStandardColor_NoHighlightColor: BNHighlightStandardColor = 0;
pub const BNHighlightStandardColor_BlueHighlightColor: BNHighlightStandardColor = 1;
pub const BNHighlightStandardColor_GreenHighlightColor: BNHighlightStandardColor = 2;
pub const BNHighlightStandardColor_CyanHighlightColor: BNHighlightStandardColor = 3;
pub const BNHighlightStandardColor_RedHighlightColor: BNHighlightStandardColor = 4;
pub const BNHighlightStandardColor_MagentaHighlightColor: BNHighlightStandardColor = 5;
pub const BNHighlightStandardColor_YellowHighlightColor: BNHighlightStandardColor = 6;
pub const BNHighlightStandardColor_OrangeHighlightColor: BNHighlightStandardColor = 7;
pub const BNHighlightStandardColor_WhiteHighlightColor: BNHighlightStandardColor = 8;
pub const BNHighlightStandardColor_BlackHighlightColor: BNHighlightStandardColor = 9;
pub type BNHighlightStandardColor = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BNHighlightColor {
    pub style: BNHighlightColorStyle,
    pub color: BNHighlightStandardColor,
    pub mixColor: BNHighlightStandardColor,
    pub mix: u8,
    pub r: u8,
    pub g: u8,
    pub b: u8,
    pub alpha: u8,
}
#[test]
fn bindgen_test_layout_BNHighlightColor() {
    const UNINIT: ::std::mem::MaybeUninit<BNHighlightColor> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BNHighlightColor>(),
        20usize,
        concat!("Size of: ", stringify!(BNHighlightColor))
    );
    assert_eq!(
        ::std::mem::align_of::<BNHighlightColor>(),
        4usize,
        concat!("Alignment of ", stringify!(BNHighlightColor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).style) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighlightColor),
            "::",
            stringify!(style)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).color) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighlightColor),
            "::",
            stringify!(color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mixColor) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighlightColor),
            "::",
            stringify!(mixColor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mix) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighlightColor),
            "::",
            stringify!(mix)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighlightColor),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(BNHighlightColor),
            "::",
            stringify!(g)
        )
    );
